[
  {
    "question_text": "What does SBL stand for in the context of Spamhaus block lists?",
    "correct_answer": "Spamhaus Block List",
    "distractors": [
      {
        "question_text": "Spam Blocking List",
        "misconception": "Targets word order/substitution: &#39;Blocking&#39; is a plausible action but &#39;Block&#39; is the correct term in the official name."
      },
      {
        "question_text": "Spamhaus Blacklist",
        "misconception": "Targets synonym substitution: &#39;Blacklist&#39; is a common synonym for a block list, but &#39;Block List&#39; is the precise term used by Spamhaus."
      },
      {
        "question_text": "Server Block List",
        "misconception": "Targets scope confusion: While SBL often blocks servers, &#39;Spamhaus&#39; specifies the organization and &#39;Block&#39; is the correct action, not &#39;Server&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The SBL, or Spamhaus Block List, is a specific database maintained by the Spamhaus organization. It contains IP addresses from which Spamhaus recommends not accepting email, primarily targeting sources of spam.",
      "distractor_analysis": "Distractors test the precision of recall. &#39;Spam Blocking List&#39; changes the word order and form. &#39;Spamhaus Blacklist&#39; uses a common synonym but not the exact term. &#39;Server Block List&#39; incorrectly generalizes the &#39;S&#39; to &#39;Server&#39; instead of &#39;Spamhaus&#39;, which is crucial for identifying the source and context of the list.",
      "analogy": "Think of SBL as a specific &#39;No-Fly List&#39; for email, curated by a specific authority (Spamhaus), rather than a generic &#39;No Entry List&#39;."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does JPEG stand for in the context of digital image processing?",
    "correct_answer": "Joint Photographic Experts Group",
    "distractors": [
      {
        "question_text": "Joint Picture Encoding Group",
        "misconception": "Targets word substitution: &#39;Picture&#39; is a common synonym for &#39;Photographic&#39;, but &#39;Photographic&#39; is the precise term in the standard&#39;s name."
      },
      {
        "question_text": "Joint Photographic Enhancement Group",
        "misconception": "Targets functional confusion: &#39;Enhancement&#39; relates to image processing but is not part of the compression standard&#39;s name, which focuses on expertise in photography."
      },
      {
        "question_text": "Joint Pixel Encoding Group",
        "misconception": "Targets technical detail confusion: While pixels are fundamental to images, &#39;Photographic&#39; refers to the broader image type the group specializes in, not just individual pixels."
      }
    ],
    "detailed_explanation": {
      "core_logic": "JPEG is a commonly used method of lossy compression for digital images, particularly for those produced by digital photography. It is also the name of the committee that created the standard, the Joint Photographic Experts Group.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Picture&#39; is a plausible substitute for &#39;Photographic&#39;, &#39;Enhancement&#39; relates to image manipulation but not the core function of the group&#39;s name, and &#39;Pixel&#39; is a fundamental image unit but not the correct term in the acronym.",
      "analogy": "Think of JPEG as the &#39;club&#39; (Joint Photographic Experts Group) that invented a specific way (the JPEG compression algorithm) to pack photos into smaller files, much like a specialized team designing a new type of efficient shipping container for specific goods."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "DIGITAL_IMAGE_BASICS"
    ]
  },
  {
    "question_text": "What does KPI stand for in the context of physical security and risk management?",
    "correct_answer": "Key Performance Indicator",
    "distractors": [
      {
        "question_text": "Key Process Identifier",
        "misconception": "Targets word substitution: &#39;Process&#39; is a related concept in management, but &#39;Performance&#39; is the correct term for measuring effectiveness."
      },
      {
        "question_text": "Known Performance Index",
        "misconception": "Targets similar-sounding terms: &#39;Known&#39; and &#39;Index&#39; are plausible but incorrect substitutions for &#39;Key&#39; and &#39;Indicator&#39;."
      },
      {
        "question_text": "Critical Performance Indicator",
        "misconception": "Targets synonym substitution: &#39;Critical&#39; is a synonym for &#39;Key&#39; but not the exact term used in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "KPI, or Key Performance Indicator, refers to a measurable value that demonstrates how effectively a company is achieving key business objectives. In cybersecurity and physical security, KPIs are used to assess the effectiveness of security efforts, such as the number of successful intrusions or the time to detect incidents, allowing management to make informed decisions.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Key Process Identifier&#39; substitutes &#39;Performance&#39; with &#39;Process&#39;, a common confusion point. &#39;Known Performance Index&#39; uses similar-sounding words that are incorrect. &#39;Critical Performance Indicator&#39; uses a synonym for &#39;Key&#39;, which is close but not the exact term.",
      "analogy": "Think of a car&#39;s dashboard. The speedometer, fuel gauge, and engine temperature are KPIs for the car&#39;s performance, indicating how well it&#39;s running and if it&#39;s meeting its operational goals."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does ASCII stand for in the context of data encoding?",
    "correct_answer": "American Standard Code for Information Interchange",
    "distractors": [
      {
        "question_text": "Advanced Standard Code for Information Interchange",
        "misconception": "Targets word substitution: &#39;Advanced&#39; is a common technical term but incorrect here, testing precise recall of &#39;American&#39;."
      },
      {
        "question_text": "American Standard Character for Information Interchange",
        "misconception": "Targets word substitution: &#39;Character&#39; is closely related to encoding but &#39;Code&#39; is the correct term, testing precision."
      },
      {
        "question_text": "Automated Standard Code for Information Interchange",
        "misconception": "Targets word substitution: &#39;Automated&#39; is a plausible technical term but incorrect, testing exact memory of &#39;American&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ASCII is a character encoding standard for electronic communication. It represents text in computers, telecommunications equipment, and other devices. The standard defines 128 characters, including uppercase and lowercase English letters, numbers, punctuation marks, and control characters.",
      "distractor_analysis": "Each distractor replaces a key word in the correct expansion with a plausible but incorrect alternative. &#39;Advanced&#39; and &#39;Automated&#39; are common technical descriptors that could be mistakenly associated with a standard. &#39;Character&#39; is very close to &#39;Code&#39; in this context, making it a strong distractor for those with partial knowledge.",
      "analogy": "ASCII is like the alphabet for computers, providing a universal way for different machines to understand and display text."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "text = &quot;Hello, World!&quot;\nencoded_bytes = text.encode(&#39;ascii&#39;)\nprint(encoded_bytes)",
        "context": "Python&#39;s `encode()` method can convert a string to a byte sequence using the ASCII encoding."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does INFOSEC stand for in the context of cybersecurity?",
    "correct_answer": "Information Security",
    "distractors": [
      {
        "question_text": "Information Systems Security",
        "misconception": "Targets scope confusion: &#39;Systems&#39; is a common addition but not part of the exact acronym, implying a broader scope than intended."
      },
      {
        "question_text": "Information Security Engineering",
        "misconception": "Targets functional confusion: &#39;Engineering&#39; is a related discipline but not the direct expansion of the term itself."
      },
      {
        "question_text": "Integrated Network Security",
        "misconception": "Targets letter confusion: &#39;I&#39; and &#39;N&#39; can be confused, and &#39;Integrated&#39; sounds plausible in a network context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "INFOSEC is a widely used abbreviation for Information Security, which encompasses the processes and tools designed to protect sensitive information from unauthorized access, use, disclosure, disruption, modification, or destruction.",
      "distractor_analysis": "The distractors introduce plausible but incorrect words like &#39;Systems&#39; or &#39;Engineering&#39; which are related fields, or completely different words like &#39;Integrated Network&#39; that share initial letters, testing the precision of recall.",
      "analogy": "INFOSEC is like the umbrella term for all the methods and practices used to keep your digital secrets safe, similar to how &#39;MedSci&#39; is short for Medical Science."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does NAT stand for in network security?",
    "correct_answer": "Network Address Translation",
    "distractors": [
      {
        "question_text": "Network Access Translation",
        "misconception": "Targets word substitution: &#39;Access&#39; is a common networking term but incorrect here, confusing address with access control."
      },
      {
        "question_text": "Network Address Transceiver",
        "misconception": "Targets similar-sounding terms: &#39;Transceiver&#39; is a network component but unrelated to the function of NAT."
      },
      {
        "question_text": "Network Application Translation",
        "misconception": "Targets scope confusion: NAT operates at the network layer, not typically at the application layer, confusing its function with application proxies."
      }
    ],
    "detailed_explanation": {
      "core_logic": "NAT (Network Address Translation) is a method of remapping one IP address space into another by modifying network address information in the IP header of packets while they are in transit across a traffic routing device. It is commonly used to allow multiple devices on a private network to share a single public IP address.",
      "distractor_analysis": "The distractors test precise recall of the &#39;Address&#39; component and the &#39;Translation&#39; function. Substituting &#39;Access&#39; or &#39;Application&#39; changes the fundamental layer or purpose, while &#39;Transceiver&#39; refers to a physical device, not a protocol function.",
      "analogy": "Think of NAT like a postal service for your house. Everyone inside your house (private network) has a unique internal address, but all mail sent out from your house (to the internet) appears to come from one single, public address (your house&#39;s street address). When mail comes back to that public address, the postal service (NAT device) knows which internal resident it&#39;s for."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "iptables -t nat -A POSTROUTING -o eth0 -j MASQUERADE",
        "context": "This Linux iptables command configures a common form of NAT called MASQUERADE, allowing internal network devices to access the internet via the &#39;eth0&#39; interface."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does RSS stand for in the context of wireless signal strength measurement?",
    "correct_answer": "Received Signal Strength",
    "distractors": [
      {
        "question_text": "Radio Signal Strength",
        "misconception": "Targets word substitution: &#39;Radio&#39; is a common association with wireless signals, but &#39;Received&#39; specifically denotes the measurement at the receiver."
      },
      {
        "question_text": "Relative Signal Strength",
        "misconception": "Targets similar-sounding terms: &#39;Relative&#39; implies a comparison, which is a characteristic of some signal measurements, but not the direct meaning of RSS."
      },
      {
        "question_text": "Remote Sensor Strength",
        "misconception": "Targets concept conflation: &#39;Remote Sensor&#39; relates to the context of the document, but &#39;Signal Strength&#39; is the core measurement, and &#39;Received&#39; is the correct qualifier."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Received Signal Strength (RSS) is a measurement of the power present in a received radio signal. It&#39;s a general term for the power level of a radio signal at the receiver, often expressed in decibels relative to one milliwatt (dBm).",
      "distractor_analysis": "The distractors play on common associations with wireless technology (Radio), similar-sounding concepts (Relative), or context-specific terms (Remote Sensor) to mislead those who don&#39;t know the precise expansion. &#39;Radio Signal Strength&#39; is particularly tricky as &#39;Radio&#39; is often used interchangeably with &#39;wireless&#39;, but &#39;Received&#39; is the specific and correct term for the measurement at the receiving end.",
      "analogy": "Think of RSS like the volume level on your headphones. It&#39;s how loud the sound (signal) is when it reaches your ears (receiver), not necessarily how loud it was at the source or how it compares to other sounds."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does IoT stand for in the context of computing and embedded systems?",
    "correct_answer": "Internet of Things",
    "distractors": [
      {
        "question_text": "Integrated of Things",
        "misconception": "Targets similar-sounding terms: &#39;Integrated&#39; sounds plausible for interconnected devices but is incorrect."
      },
      {
        "question_text": "Internal of Things",
        "misconception": "Targets word substitution: &#39;Internal&#39; might suggest local networks, but &#39;Internet&#39; emphasizes global connectivity."
      },
      {
        "question_text": "Information of Things",
        "misconception": "Targets concept confusion: While IoT deals with information, &#39;Information&#39; is not the correct first word of the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IoT refers to the vast network of physical objects—&#39;things&#39;—that are embedded with sensors, software, and other technologies for the purpose of connecting and exchanging data with other devices and systems over the internet. This enables these objects to collect and exchange data, often without human intervention.",
      "distractor_analysis": "The distractors use words that are semantically related to the concept of interconnected devices (Integrated, Internal, Information) but do not form the precise, universally accepted expansion of the acronym IoT. This tests for exact recall rather than general understanding.",
      "analogy": "Think of IoT as giving everyday objects (like your fridge, car, or even a light bulb) the ability to &#39;talk&#39; to each other and to you over the internet, making them &#39;smart&#39; and interconnected."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does JVM stand for in the context of software and system monitoring?",
    "correct_answer": "Java Virtual Machine",
    "distractors": [
      {
        "question_text": "JavaScript Virtual Machine",
        "misconception": "Targets language confusion: Students might confuse Java with JavaScript, both popular programming languages."
      },
      {
        "question_text": "Joint Virtual Module",
        "misconception": "Targets similar-sounding but incorrect terms: &#39;Joint&#39; and &#39;Module&#39; are plausible but not accurate for the &#39;J&#39; and &#39;M&#39; in JVM."
      },
      {
        "question_text": "Java Verification Mechanism",
        "misconception": "Targets functional misunderstanding: While verification is a part of Java&#39;s security, &#39;Virtual Machine&#39; describes its core runtime environment."
      }
    ],
    "detailed_explanation": {
      "core_logic": "JVM, or Java Virtual Machine, is an abstract computing machine that enables a computer to run Java programs. It is a key component of the Java platform, allowing Java code to be compiled into bytecode and then executed on any system with a compatible JVM, providing platform independence.",
      "distractor_analysis": "The distractors target common confusions: mistaking Java for JavaScript, using plausible but incorrect words like &#39;Joint&#39; or &#39;Module&#39;, and misinterpreting the &#39;M&#39; as &#39;Mechanism&#39; instead of &#39;Machine&#39;, which fundamentally changes the concept.",
      "analogy": "Think of the JVM as a universal adapter for Java programs. You write your Java code once, and the JVM translates it so it can run on any operating system, much like a power adapter lets you plug your device into different outlets worldwide."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "java -version\n# Output will typically include JVM version information",
        "context": "Checking the installed Java Development Kit (JDK) version will often display the associated JVM version."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "DEV_BASICS",
      "OS_BASICS"
    ]
  },
  {
    "question_text": "What does API stand for in the context of cloud services and log collection?",
    "correct_answer": "Application Programming Interface",
    "distractors": [
      {
        "question_text": "Application Protocol Interface",
        "misconception": "Targets term substitution: &#39;Protocol&#39; is a common networking term and sounds plausible in an interface context, but &#39;Programming&#39; is the correct term."
      },
      {
        "question_text": "Automated Program Interface",
        "misconception": "Targets word substitution: &#39;Automated&#39; relates to the function of APIs but is not part of the official expansion, and &#39;Program&#39; is less precise than &#39;Programming&#39;."
      },
      {
        "question_text": "Advanced Programming Interface",
        "misconception": "Targets common adjective use: &#39;Advanced&#39; is a frequently used adjective in technology, making it a plausible but incorrect substitution for &#39;Application&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Application Programming Interface (API) is a set of defined rules that enable different software applications to communicate with each other. In cloud services, APIs allow external systems, like security tools, to programmatically access data, including logs, and interact with the service&#39;s functionalities.",
      "distractor_analysis": "The distractors replace &#39;Programming&#39; with &#39;Protocol&#39; (a related but incorrect concept), &#39;Application&#39; with &#39;Automated&#39; (a functional description, not the term), or &#39;Application&#39; with &#39;Advanced&#39; (a common but incorrect adjective), testing the precise recall of each word in the acronym.",
      "analogy": "Think of an API as a restaurant menu. It lists what you can order (functions) and how to order it (parameters), without needing to know how the kitchen (the cloud service) prepares the food."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "import requests\n\nresponse = requests.get(&#39;https://api.example.com/logs?date=2023-01-01&#39;)\nprint(response.json())",
        "context": "This Python snippet demonstrates how an application might use an HTTP GET request to interact with a cloud service&#39;s API to retrieve logs."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does SSO stand for in cybersecurity?",
    "correct_answer": "Single Sign-On",
    "distractors": [
      {
        "question_text": "Secure System Operations",
        "misconception": "Targets similar-sounding terms: &#39;System Operations&#39; is a plausible but incorrect substitution for &#39;Sign-On&#39;."
      },
      {
        "question_text": "Security Service Orchestration",
        "misconception": "Targets acronym letter confusion: &#39;SSO&#39; can be confused with &#39;SOAR&#39; (Security Orchestration, Automation, and Response) or similar concepts involving &#39;Orchestration&#39;."
      },
      {
        "question_text": "Standard Security Objective",
        "misconception": "Targets general security terms: &#39;Security Objective&#39; is a valid security concept but not the correct expansion for SSO."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Single Sign-On (SSO) is an authentication scheme that allows a user to log in with a single ID and password to gain access to multiple related but independent software systems. It simplifies user experience and improves security by reducing password fatigue and the attack surface.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Secure System Operations&#39; uses common security terms but misrepresents the &#39;SO&#39; part. &#39;Security Service Orchestration&#39; attempts to link SSO to a related but distinct security automation concept. &#39;Standard Security Objective&#39; uses generic security terminology that doesn&#39;t fit the &#39;Sign-On&#39; function.",
      "analogy": "SSO is like a master key that opens all the doors in a building, rather than needing a separate key for each room."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of an SSO flow using SAML\n# User requests resource -&gt; SP redirects to IdP -&gt; User authenticates at IdP -&gt; IdP sends SAML assertion to SP -&gt; SP grants access",
        "context": "SSO often relies on protocols like SAML (Security Assertion Markup Language) or OAuth/OpenID Connect for secure authentication across services."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "AUTH_BASICS"
    ]
  }
]