[
  {
    "question_text": "What does GPDM stand for in the context of modeling human motion in multimedia content?",
    "correct_answer": "Gaussian Process Dynamical Model",
    "distractors": [
      {
        "question_text": "General Process Dynamics Model",
        "misconception": "Targets word substitution: &#39;General&#39; is a common substitute for &#39;Gaussian&#39; in general modeling contexts, but incorrect here."
      },
      {
        "question_text": "Graphical Process Data Model",
        "misconception": "Targets similar-sounding terms: &#39;Graphical&#39; and &#39;Data&#39; are related to modeling but do not form the correct acronym."
      },
      {
        "question_text": "Gaussian Probability Distribution Model",
        "misconception": "Targets concept conflation: &#39;Probability Distribution&#39; is a core concept in Gaussian processes, but &#39;Dynamical&#39; refers to the time-series aspect being modeled."
      }
    ],
    "detailed_explanation": {
      "core_logic": "GPDM, or Gaussian Process Dynamical Model, is a probabilistic model used for learning and representing complex, non-linear dynamical systems. It leverages Gaussian processes to model the transitions between states in a latent space, making it suitable for tasks like human motion modeling where trajectories evolve over time.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;General Process Dynamics Model&#39; replaces &#39;Gaussian&#39; with a plausible but incorrect adjective. &#39;Graphical Process Data Model&#39; uses words related to data and visualization but is not the correct expansion. &#39;Gaussian Probability Distribution Model&#39; includes key terms but misses &#39;Dynamical,&#39; which is crucial for understanding its application to evolving systems.",
      "analogy": "Think of GPDM as a sophisticated weather forecast model that not only predicts tomorrow&#39;s temperature (Gaussian Process) but also how the entire weather system evolves over time (Dynamical Model), learning from past patterns."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "# Conceptual representation of a GPDM kernel function\ndef rbf_kernel(x1, x2, gamma):\n    return math.exp(-gamma * np.sum((x1 - x2)**2) / 2)",
        "context": "The RBF kernel, a common component in GPDM, measures similarity between latent variables."
      }
    ],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "ML_BASICS",
      "MATH_PROBABILITY"
    ]
  }
]