[
  {
    "question_text": "Which of the following BEST defines the primary purpose of an Intrusion Detection System (IDS) in a network?",
    "correct_answer": "A system that monitors network traffic for suspicious activity and alerts administrators to potential threats",
    "distractors": [
      {
        "question_text": "A system that actively blocks or prevents malicious network traffic based on predefined rules",
        "misconception": "Targets functional confusion: Students often confuse IDS (detection) with IPS (prevention), which actively blocks traffic."
      },
      {
        "question_text": "A device that filters network traffic between different security zones based on IP addresses and ports",
        "misconception": "Targets device confusion: Students confuse IDS with a firewall, which primarily controls traffic flow based on rules."
      },
      {
        "question_text": "A centralized system for collecting, analyzing, and managing security logs and events from various sources",
        "misconception": "Targets scope confusion: Students confuse IDS with SIEM (Security Information and Event Management), which aggregates and analyzes logs from many systems."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An IDS (Intrusion Detection System) is designed to monitor network or system activities for malicious or policy-violating behavior and then alert administrators. It focuses on detection and alerting, not active prevention.",
      "distractor_analysis": "An IPS (Intrusion Prevention System) actively blocks traffic. A firewall filters traffic based on rules. A SIEM system collects and analyzes logs from various sources, including IDS, but is a broader security management tool.",
      "analogy": "An IDS is like a security camera with an alarm that notifies you of a break-in; an IPS is like a security guard who physically stops the intruder."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "Which statement accurately describes a threat in information security?",
    "correct_answer": "Something that has the potential to cause damage to a system or asset",
    "distractors": [
      {
        "question_text": "The likelihood and impact of an undesirable event occurring",
        "misconception": "Targets terminology confusion: Students confuse &#39;threat&#39; with &#39;risk&#39;, which encompasses likelihood and impact."
      },
      {
        "question_text": "A weakness in a system that could be exploited by an attacker",
        "misconception": "Targets terminology confusion: Students confuse &#39;threat&#39; with &#39;vulnerability&#39;, which is a weakness, not the potential source of harm."
      },
      {
        "question_text": "A specific instance of a threat agent successfully exploiting a vulnerability",
        "misconception": "Targets process confusion: Students confuse &#39;threat&#39; with &#39;exploit&#39;, which is the action taken to leverage a vulnerability."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A threat is an entity or event that has the potential to cause harm to a system or organization. It is the &#39;what&#39; that could go wrong. Examples include malware, natural disasters, or malicious actors.",
      "distractor_analysis": "Risk combines the likelihood and impact of a threat exploiting a vulnerability. A vulnerability is a weakness. An exploit is the mechanism by which a threat leverages a vulnerability.",
      "analogy": "A threat is like a hungry wolf. A vulnerability is a hole in the fence. Risk is the chance the wolf gets through the hole and eats the sheep."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST describes the primary objective of a port scan in penetration testing?",
    "correct_answer": "To verify the existence of a target system and enumerate its open communication channels.",
    "distractors": [
      {
        "question_text": "To identify specific vulnerabilities within applications running on a target system.",
        "misconception": "Targets scope confusion: While port scanning is a precursor to vulnerability identification, its direct objective is not to find specific vulnerabilities but to identify open ports."
      },
      {
        "question_text": "To establish a persistent backdoor on the target system for future access.",
        "misconception": "Targets phase confusion: This describes a post-exploitation activity, not the initial information gathering phase of port scanning."
      },
      {
        "question_text": "To exfiltrate sensitive data from the target system&#39;s open ports.",
        "misconception": "Targets purpose confusion: Data exfiltration is a goal of exploitation, not the reconnaissance phase of port scanning, which focuses on discovery."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The text explicitly states two objectives for port scanning: &#39;1) verification of the existence of the target system, and 2) obtaining a list of communication channels (ports) that accept connections.&#39; This foundational step precedes deeper analysis.",
      "distractor_analysis": "Identifying specific vulnerabilities comes after port scanning. Establishing backdoors and exfiltrating data are advanced exploitation and post-exploitation activities, not the initial goal of a port scan.",
      "analogy": "Port scanning is like checking which doors and windows are open on a building; it doesn&#39;t tell you what&#39;s inside or how to break in, but it tells you where to look next."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nmap -sP 192.168.1.0/24",
        "context": "An Nmap command to perform a ping scan across a network range to verify host existence."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST describes &#39;dumpster diving&#39; in the context of social engineering information gathering?",
    "correct_answer": "Physically sifting through a target&#39;s discarded waste to find valuable information or documents",
    "distractors": [
      {
        "question_text": "Searching public online databases and archives for company records and employee details",
        "misconception": "Targets scope confusion: Students might confuse physical trash searching with digital data mining from public records, both are information gathering but distinct methods."
      },
      {
        "question_text": "Using specialized search engine queries to uncover hidden files and sensitive data on websites",
        "misconception": "Targets method confusion: Students might confuse dumpster diving with &#39;Google dorking&#39; or similar OSINT techniques, which are digital and not physical."
      },
      {
        "question_text": "Exploiting vulnerabilities in a company&#39;s public-facing servers to access internal documents",
        "misconception": "Targets attack vector confusion: Students might confuse passive information gathering from trash with active exploitation of network vulnerabilities, which is a more technical and potentially illegal action."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Dumpster diving is a physical reconnaissance technique where an attacker searches through a target&#39;s discarded physical waste (trash) to find documents, devices, or other items that contain sensitive or useful information for a social engineering attack.",
      "distractor_analysis": "Searching public online databases and using specialized search engine queries are digital information gathering methods. Exploiting server vulnerabilities is an active technical attack, not passive physical information gathering.",
      "analogy": "Dumpster diving is like an archaeologist sifting through ruins to find clues about a past civilization, but in this case, the &#39;ruins&#39; are trash and the &#39;clues&#39; are sensitive data."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  }
]