[
  {
    "question_text": "What distinguishes a &#39;threat&#39; from a &#39;risk&#39; in cybersecurity?",
    "correct_answer": "A risk is a potential problem and its effects, while a threat is a path or method by which that risk could occur.",
    "distractors": [
      {
        "question_text": "A threat is a weakness in a system, while a risk is the likelihood of that weakness being exploited.",
        "misconception": "Targets terminology confusion: Students often confuse &#39;threat&#39; with &#39;vulnerability&#39; (a weakness) and &#39;risk&#39; with &#39;likelihood&#39;."
      },
      {
        "question_text": "A risk is an event that has already happened, while a threat is a potential future event.",
        "misconception": "Targets temporal confusion: Students incorrectly associate &#39;risk&#39; with past events and &#39;threat&#39; solely with future events, rather than their definitional relationship."
      },
      {
        "question_text": "A threat is the impact of an incident, while a risk is the probability of that impact occurring.",
        "misconception": "Targets component confusion: Students incorrectly map &#39;threat&#39; to &#39;impact&#39; and &#39;risk&#39; to &#39;probability&#39;, rather than understanding risk as a combination of likelihood and impact, and threat as the agent/method."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In cybersecurity, a risk represents the potential for loss or harm, encompassing both the problem itself and its potential consequences. A threat, on the other hand, is the specific method, agent, or path through which that risk might materialize. Threats exploit vulnerabilities to create risks.",
      "distractor_analysis": "The first distractor confuses &#39;threat&#39; with &#39;vulnerability&#39; and &#39;risk&#39; with &#39;likelihood&#39;. The second incorrectly assigns a temporal aspect to &#39;risk&#39; as a past event. The third misattributes &#39;threat&#39; to &#39;impact&#39; and &#39;risk&#39; to &#39;probability&#39;, which are components of risk assessment but not the definitions of the terms themselves.",
      "analogy": "Imagine a house with an open window (vulnerability). A burglar (threat) could use that open window to enter and steal valuables (risk). The open window is not the threat itself, but what the threat exploits."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST defines the principle of Zero Trust in cybersecurity?",
    "correct_answer": "A security model that requires strict identity verification for every person and device attempting to access resources on a private network, regardless of whether they are inside or outside the network perimeter.",
    "distractors": [
      {
        "question_text": "A security strategy that assumes all internal network traffic is trusted by default, focusing protection on the network perimeter.",
        "misconception": "Targets conceptual reversal: Students confuse Zero Trust with the traditional perimeter-based security model it aims to replace, which trusts internal networks."
      },
      {
        "question_text": "A framework for managing software vulnerabilities by ensuring all third-party applications are thoroughly scanned and patched before deployment.",
        "misconception": "Targets scope misunderstanding: Students incorrectly narrow Zero Trust to only software vulnerability management, rather than a comprehensive access control model."
      },
      {
        "question_text": "A policy that dictates all data must be encrypted at rest and in transit, regardless of its sensitivity level.",
        "misconception": "Targets attribute confusion: Students associate Zero Trust with a specific security control (encryption) rather than its overarching principle of &#39;never trust, always verify&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Zero Trust is a security model centered on the belief that organizations should not automatically trust anything inside or outside its network perimeter. Instead, it requires verification of every user and device before granting access to resources, applying the principle of &#39;never trust, always verify&#39;.",
      "distractor_analysis": "The first distractor describes the opposite of Zero Trust, which is the traditional perimeter-based model. The second distractor focuses too narrowly on software vulnerability management, which is a component of security but not the definition of Zero Trust. The third distractor highlights encryption, an important security control, but not the fundamental principle of Zero Trust itself.",
      "analogy": "Zero Trust is like a highly secure building where every person, even employees, must show ID and state their purpose at every door, rather than just at the main entrance."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What distinguishes the Zero Trust security model from the traditional &#39;castle-and-moat&#39; model?",
    "correct_answer": "Zero Trust assumes no implicit trust, requiring continuous verification for all users and devices, regardless of location, while &#39;castle-and-moat&#39; trusts everything inside the network perimeter.",
    "distractors": [
      {
        "question_text": "Zero Trust focuses on securing the network perimeter, whereas &#39;castle-and-moat&#39; emphasizes endpoint security.",
        "misconception": "Targets reversal error: Students confuse the primary focus of each model. Zero Trust de-emphasizes the perimeter, while &#39;castle-and-moat&#39; relies heavily on it."
      },
      {
        "question_text": "Zero Trust is primarily concerned with data encryption, while &#39;castle-and-moat&#39; focuses on strong authentication.",
        "misconception": "Targets scope misunderstanding: Both models incorporate encryption and authentication, but these are not their defining distinctions. This distractor misrepresents their core principles."
      },
      {
        "question_text": "Zero Trust grants access based on user roles, while &#39;castle-and-moat&#39; grants access based on device posture.",
        "misconception": "Targets attribute confusion: Role-Based Access Control (RBAC) is a component that can be used in both, but it&#39;s not the fundamental differentiator. Device posture is a key element of Zero Trust, but not the sole basis for &#39;castle-and-moat&#39; access."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The &#39;castle-and-moat&#39; model operates on the principle that once inside the network perimeter, entities are trusted. In contrast, the Zero Trust model operates on the principle of &#39;never trust, always verify,&#39; meaning no user or device is inherently trusted, even if they are inside the network. Access is granted based on continuous verification of identity, device posture, and other contextual factors.",
      "distractor_analysis": "The first distractor incorrectly reverses the focus; Zero Trust explicitly moves away from perimeter-centric security. The second distractor misrepresents the core concerns; while both models use encryption and authentication, these are not their defining differences. The third distractor confuses specific access control mechanisms with the overarching trust philosophy of each model.",
      "analogy": "The &#39;castle-and-moat&#39; model is like a walled city where everyone inside is assumed friendly. Zero Trust is like a modern airport, where every person and bag is screened, regardless of where they came from or where they&#39;re going within the airport."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS"
    ]
  }
]