[
  {
    "question_text": "A SAST report identifies 50 instances of &#39;SQL Injection&#39; vulnerabilities. The development team has limited resources. How should these findings be triaged effectively?",
    "correct_answer": "Prioritize findings based on data flow from untrusted input to database queries, focusing on critical data access.",
    "distractors": [
      {
        "question_text": "Address all findings immediately, regardless of context or impact.",
        "misconception": "Targets resource management misunderstanding: Student ignores practical constraints and advocates for an unrealistic &#39;fix everything&#39; approach."
      },
      {
        "question_text": "Ignore findings in non-production code or test files.",
        "misconception": "Targets scope misunderstanding: Student might dismiss findings in code that could still be deployed or used as a template for production code."
      },
      {
        "question_text": "Assign all findings to the developer who committed the most lines of code.",
        "misconception": "Targets process misunderstanding: Student confuses accountability for code changes with responsibility for security remediation, which should be based on impact and expertise."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Effective triage of SAST findings, especially for a high volume of SQL Injection, involves understanding the context and potential impact. Prioritizing based on whether the vulnerable code path receives untrusted user input and if it accesses sensitive or critical database operations ensures that the most dangerous and exploitable issues are addressed first. This aligns with risk-based prioritization.",
      "distractor_analysis": "Addressing all findings immediately is often impractical due to resource constraints. While non-production code might seem less critical, it can still pose risks or indicate systemic issues. Assigning based on lines of code committed is an arbitrary and ineffective way to manage security remediation.",
      "analogy": "Triaging SAST findings is like a hospital emergency room prioritizing patients: you treat the most critical cases with the highest risk of severe harm first, rather than treating everyone in the order they arrive or based on who has the most minor cuts."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "procedure",
    "prerequisites": [
      "SAST_BASICS",
      "SQL_INJECTION",
      "RISK_MANAGEMENT"
    ]
  },
  {
    "question_text": "A security analyst is reviewing a Node.js application that uses the Express framework and Pug templating engine. The application has passed automated vulnerability scans, but the analyst suspects there might be &#39;golden egg&#39; findings related to coding issues, misconfigurations, or logic flaws. Which security testing approach is BEST suited to uncover these types of vulnerabilities in this specific application context?",
    "correct_answer": "Manual penetration testing combined with IAST to observe runtime behavior and data flow within the Node.js application.",
    "distractors": [
      {
        "question_text": "Running an advanced SAST tool specifically configured for Node.js and JavaScript to find all potential coding issues.",
        "misconception": "Targets overestimation of SAST: Student believes SAST can find all &#39;coding issues&#39; including logic flaws and complex misconfigurations without runtime context."
      },
      {
        "question_text": "Deploying a DAST scanner with comprehensive web application attack payloads against the running Express application.",
        "misconception": "Targets DAST limitations: Student overlooks DAST&#39;s inability to see internal application logic, misconfigurations, or complex logic flaws that don&#39;t manifest as typical injection/XSS."
      },
      {
        "question_text": "Performing a thorough code review of all NPM packages used by the application for known vulnerabilities and insecure dependencies.",
        "misconception": "Targets scope confusion: Student focuses only on third-party dependencies, neglecting custom code logic flaws and application-level misconfigurations."
      }
    ],
    "detailed_explanation": {
      "core_logic": "For &#39;golden egg&#39; findings like coding issues, misconfigurations, and logic flaws that automated scanners often miss, a combination of manual penetration testing and IAST is highly effective. Manual penetration testing allows an analyst to understand the application&#39;s business logic, identify complex attack chains, and test for subtle misconfigurations. IAST, integrated into the running application, provides visibility into internal data flow, function calls, and code execution paths, helping to pinpoint the exact location and cause of vulnerabilities that manifest at runtime, especially in a dynamic language like Node.js.",
      "distractor_analysis": "While SAST is good for many coding issues, it struggles with logic flaws, complex misconfigurations, and issues that depend on runtime context. DAST is excellent for common web vulnerabilities but has limited visibility into internal application logic and often misses subtle logic flaws. Reviewing NPM packages is crucial for supply chain security but doesn&#39;t address custom code logic flaws or application-level misconfigurations.",
      "analogy": "Think of it like a detective investigating a complex crime. Automated scanners are like security cameras (SAST) or basic patrol cars (DAST) – they catch obvious things. But for &#39;golden eggs&#39; (complex crimes), you need a detective (manual pentester) who understands human behavior and can follow clues, combined with forensic tools (IAST) that show the internal workings of the crime scene."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "SAST_BASICS",
      "DAST_BASICS",
      "IAST_BASICS",
      "PEN_TESTING_METHODOLOGY"
    ]
  }
]