[
  {
    "question_text": "What does IaaS stand for in the context of cloud computing services?",
    "correct_answer": "Infrastructure as a Service",
    "distractors": [
      {
        "question_text": "Identity as a Service",
        "misconception": "Targets similar-sounding acronyms: IDaaS is a distinct cloud service type that sounds similar to IaaS."
      },
      {
        "question_text": "Information as a Service",
        "misconception": "Targets word substitution: &#39;Information&#39; is a common IT term that could plausibly replace &#39;Infrastructure&#39; for someone with partial knowledge."
      },
      {
        "question_text": "Integrated as a Service",
        "misconception": "Targets common IT prefixes: &#39;Integrated&#39; is a frequently used term in IT, making it a plausible but incorrect substitute."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IaaS provides virtualized computing resources over the Internet, where a third-party provider hosts infrastructure components like virtual machines, storage, and networking. Users manage their operating systems, applications, and data.",
      "distractor_analysis": "The distractors test the precise recall of the &#39;I&#39; in IaaS. &#39;Identity as a Service&#39; (IDaaS) is a real, distinct cloud service, making it a strong distractor. &#39;Information as a Service&#39; and &#39;Integrated as a Service&#39; use common IT terminology that could be confused with &#39;Infrastructure&#39;.",
      "analogy": "IaaS is like renting an empty apartment: you get the basic structure (walls, plumbing, electricity), but you&#39;re responsible for furnishing it (OS, applications, data)."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does MFA stand for in the context of cybersecurity, particularly for user authentication in cloud environments?",
    "correct_answer": "Multi-Factor Authentication",
    "distractors": [
      {
        "question_text": "Multi-Function Authorization",
        "misconception": "Targets word substitution: &#39;Function&#39; and &#39;Authorization&#39; are related security terms but incorrect in this context, confusing the method with the outcome."
      },
      {
        "question_text": "Managed Feature Access",
        "misconception": "Targets acronym letter confusion: &#39;MFA&#39; could be misconstrued as &#39;Managed Feature Access&#39; by someone unfamiliar with the exact term, especially in a cloud context."
      },
      {
        "question_text": "Multi-Form Application",
        "misconception": "Targets domain confusion: &#39;Multi-Form Application&#39; sounds like a software development term, distracting from the security authentication context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Multi-Factor Authentication (MFA) is a security system that requires more than one method of verification from independent categories of credentials to verify the user&#39;s identity for a login or other transaction. This typically involves something the user knows (password), something the user has (token, phone), and/or something the user is (biometrics).",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Multi-Function Authorization&#39; substitutes key words with plausible but incorrect security-related terms. &#39;Managed Feature Access&#39; attempts to confuse the &#39;M&#39; with &#39;Managed&#39; and &#39;A&#39; with &#39;Access&#39;, which are common in cloud management. &#39;Multi-Form Application&#39; is a plausible-sounding IT term but completely unrelated to authentication, testing if the student can distinguish between IT domains.",
      "analogy": "MFA is like needing both your key (something you have) and a secret code (something you know) to open a safe, rather than just one or the other."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "gh auth login",
        "context": "The &#39;gh auth login&#39; command in the document can prompt for a One-Time Password (OTP), which is a common form of MFA."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does PIP stand for in the context of Python package management?",
    "correct_answer": "PIP Installs Packages",
    "distractors": [
      {
        "question_text": "Python Installation Program",
        "misconception": "Targets functional description as expansion: While it&#39;s a Python installation program, that&#39;s not the recursive acronym&#39;s expansion."
      },
      {
        "question_text": "Package Installer for Python",
        "misconception": "Targets common misremembering: This is a very common and plausible but incorrect expansion, often confused with its purpose."
      },
      {
        "question_text": "Python Integrated Packages",
        "misconception": "Targets word substitution: &#39;Integrated&#39; sounds plausible in a software context but is incorrect."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PIP is a recursive acronym, meaning one of the letters in the acronym stands for the acronym itself. In this case, &#39;PIP&#39; stands for &#39;PIP Installs Packages&#39;, highlighting its primary function as a package installer for Python.",
      "distractor_analysis": "The distractors target common misunderstandings: one describes its function rather than its recursive name, another is a frequently cited but incorrect expansion, and the third uses a plausible but incorrect word substitution.",
      "analogy": "Think of PIP like a self-referential instruction manual: the manual itself tells you how to install manuals."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "pip install requests\npip freeze &gt; requirements.txt",
        "context": "PIP is used to install Python packages and manage project dependencies, often listed in a requirements.txt file."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "DEV_BASICS"
    ]
  },
  {
    "question_text": "What does GCP stand for in the context of cloud computing and penetration testing?",
    "correct_answer": "Google Cloud Platform",
    "distractors": [
      {
        "question_text": "Global Cloud Provider",
        "misconception": "Targets general term substitution: &#39;Global Cloud Provider&#39; describes a category, not the specific company/service."
      },
      {
        "question_text": "Google Compute Platform",
        "misconception": "Targets similar-sounding product: Google Compute Engine (GCE) is a specific service within GCP, but not the platform&#39;s full name."
      },
      {
        "question_text": "General Cloud Platform",
        "misconception": "Targets common word substitution: &#39;General&#39; is a plausible but incorrect adjective for a specific cloud service."
      }
    ],
    "detailed_explanation": {
      "core_logic": "GCP is the acronym for Google Cloud Platform, which is a suite of cloud computing services offered by Google. It provides a wide range of services including computing, storage, networking, big data, machine learning, and the Internet of Things (IoT).",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Global Cloud Provider&#39; is a descriptive term for companies like Google, but not the name. &#39;Google Compute Platform&#39; is close, but &#39;Compute Engine&#39; is a specific service, not the overarching platform. &#39;General Cloud Platform&#39; uses a common adjective that sounds plausible but is incorrect.",
      "analogy": "Think of GCP as Google&#39;s entire &#39;cloud city&#39; offering, where &#39;Google Compute Engine&#39; might be just one type of building within that city."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "gcloud config set account &lt;account&gt;",
        "context": "The `gcloud` command-line tool is used to interact with Google Cloud Platform services."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does DNS stand for in the context of network infrastructure and cybersecurity?",
    "correct_answer": "Domain Name System",
    "distractors": [
      {
        "question_text": "Dynamic Name Service",
        "misconception": "Targets word substitution: &#39;Dynamic&#39; is a common networking term (e.g., DHCP) and &#39;Service&#39; is often used interchangeably with &#39;System&#39; in IT contexts."
      },
      {
        "question_text": "Distributed Network System",
        "misconception": "Targets similar-sounding concepts: DNS is distributed, but &#39;Network&#39; is not part of its official name, and &#39;System&#39; is correct but paired with the wrong first word."
      },
      {
        "question_text": "Domain Naming Service",
        "misconception": "Targets minor word variation: &#39;Naming&#39; is very close to &#39;Name&#39; and &#39;Service&#39; is a common substitute for &#39;System&#39;, making it a plausible but incorrect expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Domain Name System (DNS) is a hierarchical and decentralized naming system for computers, services, or other resources connected to the Internet or a private network. It translates human-readable domain names (like example.com) into numerical IP addresses (like 192.0.2.1) required for locating and identifying computer services and devices with the underlying network protocols.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Dynamic Name Service&#39; uses a common networking adjective and a synonym for &#39;System&#39;. &#39;Distributed Network System&#39; uses a correct characteristic of DNS (distributed) but misplaces &#39;Network&#39;. &#39;Domain Naming Service&#39; is a very subtle change, substituting &#39;Name&#39; with &#39;Naming&#39; and &#39;System&#39; with &#39;Service&#39;, which are common errors.",
      "analogy": "DNS is like the phonebook of the internet. Instead of remembering everyone&#39;s phone number (IP address), you just remember their name (domain name), and the phonebook (DNS) tells you how to connect."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nslookup example.com\ndig example.com A",
        "context": "Command-line tools like `nslookup` and `dig` are used to query DNS servers for domain information, such as IP addresses."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does ccTLD stand for in the context of domain names?",
    "correct_answer": "Country Code Top Level Domain",
    "distractors": [
      {
        "question_text": "Country Code Top Level Directory",
        "misconception": "Targets word substitution: Directory is a common IT term but incorrect here, confusing it with file systems or LDAP."
      },
      {
        "question_text": "Country Code Technical Level Domain",
        "misconception": "Targets similar-sounding terms: Technical sounds plausible in an IT context but is not the correct term for this type of domain."
      },
      {
        "question_text": "Centralized Code Top Level Domain",
        "misconception": "Targets acronym letter confusion: Students might guess &#39;C&#39; stands for Centralized, which is a common concept in IT infrastructure."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A ccTLD is a Top Level Domain (TLD) that is primarily used or reserved for a country, sovereign state, or dependent territory. Examples include .us for the United States, .uk for the United Kingdom, or .de for Germany.",
      "distractor_analysis": "Distractors play on common misinterpretations of the &#39;D&#39; in TLD (Directory instead of Domain), substituting &#39;Code&#39; with &#39;Technical&#39; which sounds related, or misinterpreting the first &#39;C&#39; as &#39;Centralized&#39; due to common IT architectural patterns.",
      "analogy": "Think of ccTLD like the country code on an international phone number; it immediately tells you the geographical origin or association of the domain."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SaaS stand for in the context of cloud computing and software delivery?",
    "correct_answer": "Software as a Service",
    "distractors": [
      {
        "question_text": "Security as a Service",
        "misconception": "Targets similar-sounding terms: &#39;Security&#39; is a common &#39;as a Service&#39; offering, but not the correct expansion for SaaS."
      },
      {
        "question_text": "System as a Service",
        "misconception": "Targets word substitution: &#39;System&#39; is a plausible but incorrect substitute for &#39;Software&#39;, leading to a different concept."
      },
      {
        "question_text": "Software and a Service",
        "misconception": "Targets missing connector: The &#39;as a&#39; phrase is crucial for defining the delivery model, not just &#39;and a&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SaaS, or Software as a Service, is a software distribution model in which a third-party provider hosts applications and makes them available to customers over the Internet. It&#39;s one of the three main categories of cloud computing services, alongside IaaS and PaaS.",
      "distractor_analysis": "The distractors test the precise wording of the &#39;as a Service&#39; model. &#39;Security as a Service&#39; is a real concept but not SaaS. &#39;System as a Service&#39; incorrectly replaces &#39;Software&#39;. &#39;Software and a Service&#39; misses the &#39;as a&#39; which defines the delivery model.",
      "analogy": "Think of SaaS like renting a fully furnished apartment: you use the apartment (software) without owning or maintaining the building (infrastructure and platform)."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does DNS stand for in the context of network communication and web browsing?",
    "correct_answer": "Domain Name System",
    "distractors": [
      {
        "question_text": "Dynamic Network Service",
        "misconception": "Targets similar-sounding terms: &#39;Dynamic&#39; and &#39;Service&#39; are common networking terms but incorrect here."
      },
      {
        "question_text": "Distributed Naming System",
        "misconception": "Targets partial correctness: While DNS is distributed and deals with naming, &#39;Domain Name System&#39; is the precise expansion."
      },
      {
        "question_text": "Data Naming Server",
        "misconception": "Targets word substitution: &#39;Data&#39; and &#39;Server&#39; are related but not the correct terms in the expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Domain Name System (DNS) is a hierarchical and decentralized naming system for computers, services, or other resources connected to the Internet or a private network. It translates human-readable domain names (like www.example.com) into numerical IP addresses (like 192.0.2.1) that computers use to identify each other on the network.",
      "distractor_analysis": "Distractors are designed to catch those who have a general idea of DNS&#39;s function but don&#39;t know its exact expansion. &#39;Dynamic Network Service&#39; uses common networking jargon. &#39;Distributed Naming System&#39; is functionally descriptive but not the official name. &#39;Data Naming Server&#39; substitutes key terms with related but incorrect ones.",
      "analogy": "Think of DNS as the internet&#39;s phone book. You look up a person&#39;s name (domain name) to find their phone number (IP address) to connect with them."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nslookup www.google.com\ndig www.google.com",
        "context": "Common command-line tools (nslookup, dig) used to query DNS servers for domain name resolution."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does AAA stand for in the context of cybersecurity services?",
    "correct_answer": "Authentication, Authorization, Accounting",
    "distractors": [
      {
        "question_text": "Access, Authorization, Auditing",
        "misconception": "Targets term substitution: &#39;Access&#39; is a related concept but &#39;Authentication&#39; is the correct first component."
      },
      {
        "question_text": "Authentication, Authorization, Auditing",
        "misconception": "Targets similar-sounding terms: &#39;Auditing&#39; is a related security process but &#39;Accounting&#39; is the correct third component of AAA."
      },
      {
        "question_text": "Access, Authorization, Accounting",
        "misconception": "Targets dual term substitution: Replaces &#39;Authentication&#39; with &#39;Access&#39; and correctly identifies &#39;Accounting&#39;, leading to partial correctness."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AAA services are fundamental security services that control access to resources, track usage, and ensure accountability. Authentication verifies a user&#39;s identity, Authorization determines what an authenticated user can do, and Accounting tracks user activities.",
      "distractor_analysis": "Distractors replace one or more of the correct terms with closely related but incorrect security concepts. &#39;Access&#39; is a general term for what AAA controls, but &#39;Authentication&#39; is the specific first step. &#39;Auditing&#39; is a process that often uses accounting data but is not the &#39;A&#39; in AAA.",
      "analogy": "Think of AAA like a bouncer, a guest list, and a tab at a club: Authentication is showing your ID to the bouncer, Authorization is checking the guest list to see where you can go, and Accounting is keeping track of what you order at the bar."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does NDA stand for in the context of employment agreements?",
    "correct_answer": "Nondisclosure Agreement",
    "distractors": [
      {
        "question_text": "Non-Disclosure Authorization",
        "misconception": "Targets word substitution: &#39;Authorization&#39; is a related concept but not the correct term for the agreement type."
      },
      {
        "question_text": "National Data Agreement",
        "misconception": "Targets scope confusion: &#39;National Data&#39; implies a broader, governmental scope, whereas NDA is typically between private parties."
      },
      {
        "question_text": "Network Device Access",
        "misconception": "Targets domain confusion: &#39;Network Device Access&#39; is a completely different technical concept, exploiting the &#39;NDA&#39; initialism."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Nondisclosure Agreement (NDA) is a legally binding contract that establishes a confidential relationship. The party signing the agreement agrees that sensitive information they may obtain will not be made available to any unauthorized parties.",
      "distractor_analysis": "The distractors test for precise recall of the term &#39;Agreement&#39; and distinguish it from similar-sounding or unrelated technical terms. &#39;Authorization&#39; is a plausible but incorrect substitute for &#39;Agreement&#39;. &#39;National Data Agreement&#39; introduces a different scope, and &#39;Network Device Access&#39; is a common technical term that shares the same initialism but is entirely unrelated to employment contracts.",
      "analogy": "Think of an NDA as a legal &#39;secret keeper&#39;s promise&#39; where you agree not to share confidential information you learn."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does COTS stand for in the context of software acquisition?",
    "correct_answer": "Commercial Off-The-Shelf",
    "distractors": [
      {
        "question_text": "Common Off-The-Shelf",
        "misconception": "Targets similar-sounding terms: &#39;Common&#39; sounds plausible for widely used software but &#39;Commercial&#39; emphasizes its proprietary, purchased nature."
      },
      {
        "question_text": "Custom Off-The-Shelf",
        "misconception": "Targets antonym confusion: &#39;Custom&#39; is the opposite of &#39;Off-The-Shelf&#39;, which implies ready-made solutions."
      },
      {
        "question_text": "Centralized Off-The-Shelf",
        "misconception": "Targets unrelated concept: &#39;Centralized&#39; refers to architecture, not the commercial nature of the software."
      }
    ],
    "detailed_explanation": {
      "core_logic": "COTS refers to software products that are ready-made and available for purchase and use by the general public or businesses, rather than being custom-developed for a specific client. It implies a standardized product that can be integrated into existing systems.",
      "distractor_analysis": "The distractors play on common misinterpretations of the &#39;C&#39; in COTS. &#39;Common&#39; is close but misses the commercial aspect. &#39;Custom&#39; is the direct opposite of the &#39;Off-The-Shelf&#39; concept. &#39;Centralized&#39; introduces an architectural concept unrelated to the acquisition model.",
      "analogy": "COTS software is like buying a pre-built computer from a store, as opposed to building one from individual components or having one custom-made."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does OS stand for in the context of container image scanning?",
    "correct_answer": "Operating System",
    "distractors": [
      {
        "question_text": "Open Source",
        "misconception": "Targets similar-sounding terms: &#39;Open Source&#39; is a common term in software development and could be confused with &#39;Operating System&#39; due to context of software packages."
      },
      {
        "question_text": "Operational Security",
        "misconception": "Targets concept conflation: &#39;Operational Security&#39; is a valid cybersecurity concept, but not the correct expansion for OS in this technical context."
      },
      {
        "question_text": "Orchestration System",
        "misconception": "Targets domain confusion: &#39;Orchestration System&#39; relates to container management (like Kubernetes itself), but OS refers to the base layer of the container image."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In the context of container image scanning, OS refers to the Operating System. Container images are built upon a base operating system (like Alpine Linux, Ubuntu, or CentOS), and package managers (like yum or apt) are specific to these operating systems. Scanners inspect these OS-level packages for vulnerabilities.",
      "distractor_analysis": "The distractors leverage common cybersecurity and software development terms that share initial letters or are conceptually related to the broader domain. &#39;Open Source&#39; is a plausible guess given the mention of open-source tools. &#39;Operational Security&#39; is a valid security term. &#39;Orchestration System&#39; relates to the Kubernetes environment where containers run, but not the internal structure of the container image itself.",
      "analogy": "Think of a container image as a miniature computer. The OS is the fundamental software that makes that computer run, just like Windows or macOS on your personal computer."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does SMS stand for in the context of mobile communication and malware capabilities?",
    "correct_answer": "Short Message Service",
    "distractors": [
      {
        "question_text": "Secure Messaging System",
        "misconception": "Targets functional association: While SMS can be part of a messaging system, &#39;Secure&#39; is not part of its official expansion, and &#39;System&#39; is too broad."
      },
      {
        "question_text": "Simple Message Service",
        "misconception": "Targets descriptive substitution: &#39;Simple&#39; describes the nature of SMS but is not the correct word in its official expansion."
      },
      {
        "question_text": "Standard Messaging Service",
        "misconception": "Targets commonality: SMS is a standard, but &#39;Standard&#39; is not the correct word in its official expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SMS, or Short Message Service, is a text messaging service component of most telephone, Internet, and mobile device systems. It uses standardized communication protocols to allow mobile devices to exchange short text messages. In the context of malware, it refers to the ability of malicious software to send, intercept, or modify these text messages.",
      "distractor_analysis": "The distractors use words that are functionally or descriptively related to SMS (Secure, Simple, Standard) but are not part of its precise, official expansion. This tests the candidate&#39;s exact recall of the acronym versus a general understanding of its purpose.",
      "analogy": "Think of SMS as the basic postcard service for phones – short, simple messages. Malware exploiting SMS is like someone intercepting your postcards or sending them on your behalf without your knowledge."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does ML stand for in the context of AI algorithms and smart contracts?",
    "correct_answer": "Machine Learning",
    "distractors": [
      {
        "question_text": "Model Logic",
        "misconception": "Targets similar-sounding terms: &#39;Model&#39; and &#39;Logic&#39; are related to AI but not the correct expansion of ML."
      },
      {
        "question_text": "Managed Learning",
        "misconception": "Targets word substitution: &#39;Managed&#39; sounds plausible in a technical context but is not the correct term for the &#39;M&#39; in ML."
      },
      {
        "question_text": "Metric Learning",
        "misconception": "Targets specific sub-field confusion: Metric Learning is a real concept in AI but not the general expansion of ML."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ML, or Machine Learning, is a subset of Artificial Intelligence that enables systems to learn from data, identify patterns, and make decisions with minimal human intervention. In the context of smart contracts, ML algorithms can analyze data to trigger contract clauses or adapt terms dynamically.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Model Logic&#39; uses terms associated with AI but incorrectly expands ML. &#39;Managed Learning&#39; substitutes a common word that sounds technically relevant but is incorrect. &#39;Metric Learning&#39; is a specific, advanced concept within ML, but not the general expansion, thus testing if the student knows the foundational term versus a specialized one.",
      "analogy": "Think of ML as teaching a computer to recognize a cat by showing it thousands of cat pictures, rather than explicitly programming &#39;a cat has whiskers, four legs, and a tail&#39;. It learns the patterns itself."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "from sklearn.ensemble import RandomForestClassifier\n# Example of an ML model in Python\nmodel = RandomForestClassifier(n_estimators=100)\nmodel.fit(X_train, y_train)",
        "context": "This Python snippet shows the basic instantiation and training of a Machine Learning model using the scikit-learn library, a common tool for ML development."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "AI_BASICS"
    ]
  },
  {
    "question_text": "What does UI stand for in the context of web application security, particularly concerning attacks like clickjacking?",
    "correct_answer": "User Interface",
    "distractors": [
      {
        "question_text": "User Interaction",
        "misconception": "Targets functional confusion: While UI facilitates interaction, &#39;Interface&#39; is the correct term for the visual and interactive elements."
      },
      {
        "question_text": "Universal Identifier",
        "misconception": "Targets similar-sounding terms: &#39;Universal Identifier&#39; is a valid concept in computing but unrelated to the visual components of an application."
      },
      {
        "question_text": "Unified Integration",
        "misconception": "Targets acronym letter confusion: &#39;Unified Integration&#39; sounds plausible in a technical context but does not match the &#39;UI&#39; in this domain."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In web application security, UI refers to the User Interface, which encompasses all the visual and interactive elements of a software application or website that a user interacts with. Attacks like clickjacking manipulate the UI to trick users into performing unintended actions.",
      "distractor_analysis": "The distractors are designed to be plausible by using terms that are related to user experience or general computing but are not the precise expansion of UI. &#39;User Interaction&#39; describes the *purpose* of a UI, not what UI stands for. &#39;Universal Identifier&#39; and &#39;Unified Integration&#39; are valid technical terms but are completely unrelated to the visual components of an application.",
      "analogy": "Think of a car&#39;s dashboard and controls as its UI. Clickjacking is like someone putting a fake sticker over your &#39;Open Trunk&#39; button that actually says &#39;Turn on Wipers&#39; but still activates the trunk when you press it."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "WEB_BASICS"
    ]
  },
  {
    "question_text": "What does DNS stand for in the context of network protocols and web application attacks?",
    "correct_answer": "Domain Name System",
    "distractors": [
      {
        "question_text": "Dynamic Network Service",
        "misconception": "Targets word substitution: &#39;Dynamic&#39; and &#39;Service&#39; are common networking terms but incorrect for DNS."
      },
      {
        "question_text": "Distributed Naming System",
        "misconception": "Targets similar-sounding terms: &#39;Distributed&#39; and &#39;Naming&#39; are conceptually related but not the exact expansion."
      },
      {
        "question_text": "Data Naming Server",
        "misconception": "Targets functional confusion: While it involves data and naming, &#39;Server&#39; is a component, not the system itself, and &#39;Data&#39; is incorrect."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Domain Name System (DNS) is a hierarchical and decentralized naming system for computers, services, or other resources connected to the Internet or a private network. It translates human-readable domain names (like example.com) into numerical IP addresses (like 192.0.2.1) required for locating and identifying computer services and devices with the underlying network protocols.",
      "distractor_analysis": "Distractors are designed to confuse with plausible-sounding but incorrect combinations of networking terms. &#39;Dynamic Network Service&#39; uses common but wrong words. &#39;Distributed Naming System&#39; is conceptually close but not the precise expansion. &#39;Data Naming Server&#39; incorrectly uses &#39;Data&#39; and focuses on a component (&#39;Server&#39;) rather than the overall &#39;System&#39;.",
      "analogy": "DNS is like the internet&#39;s phonebook. You look up a website by its name (domain name), and DNS tells your computer the corresponding phone number (IP address) to connect to it."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nslookup example.com",
        "context": "The `nslookup` command is used to query DNS servers for domain name information."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does HTML stand for in web development and cybersecurity?",
    "correct_answer": "HyperText Markup Language",
    "distractors": [
      {
        "question_text": "Hyperlink and Text Markup Language",
        "misconception": "Targets word substitution: &#39;Hyperlink&#39; is a related concept but not the correct first word, and &#39;and&#39; is incorrectly inserted."
      },
      {
        "question_text": "High-level Text Management Language",
        "misconception": "Targets incorrect domain and function: &#39;High-level&#39; and &#39;Management&#39; are plausible but incorrect terms for a markup language."
      },
      {
        "question_text": "HyperText Markdown Language",
        "misconception": "Targets similar-sounding terms: &#39;Markdown&#39; is a different markup syntax, easily confused with &#39;Markup&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "HTML, or HyperText Markup Language, is the standard markup language for documents designed to be displayed in a web browser. It defines the structure and content of web pages, using a system of tags to describe elements like headings, paragraphs, links, and images.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Hyperlink and Text Markup Language&#39; incorrectly adds &#39;and&#39; and uses &#39;Hyperlink&#39; instead of &#39;HyperText&#39;. &#39;High-level Text Management Language&#39; uses plausible but incorrect terms for a markup language. &#39;HyperText Markdown Language&#39; confuses &#39;Markup&#39; with &#39;Markdown&#39;, a different, simpler markup syntax.",
      "analogy": "HTML is like the blueprint for a house: it defines where the walls, doors, and windows go, but doesn&#39;t dictate the paint color or furniture (that&#39;s CSS)."
    },
    "code_snippets": [
      {
        "language": "html",
        "code": "&lt;!-- Example HTML structure --&gt;\n&lt;!DOCTYPE html&gt;\n&lt;html&gt;\n&lt;head&gt;\n    &lt;title&gt;Page Title&lt;/title&gt;\n&lt;/head&gt;\n&lt;body&gt;\n    &lt;h1&gt;My First Heading&lt;/h1&gt;\n    &lt;p&gt;My first paragraph.&lt;/p&gt;\n    &lt;a href=&quot;https://example.com&quot;&gt;Visit Example&lt;/a&gt;\n&lt;/body&gt;\n&lt;/html&gt;",
        "context": "Basic HTML structure showing common tags like `&lt;html&gt;`, `&lt;head&gt;`, `&lt;body&gt;`, `&lt;h1&gt;`, `&lt;p&gt;`, and `&lt;a&gt;` for links."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "WEB_BASICS"
    ]
  },
  {
    "question_text": "What does JSON stand for in the context of web application communication?",
    "correct_answer": "JavaScript Object Notation",
    "distractors": [
      {
        "question_text": "Java Standard Object Notation",
        "misconception": "Targets language confusion: Students might associate &#39;J&#39; with Java due to its prevalence, rather than JavaScript."
      },
      {
        "question_text": "JavaScript Oriented Notation",
        "misconception": "Targets similar-sounding terms: &#39;Oriented&#39; sounds plausible in a programming context but is incorrect for the &#39;O&#39; in JSON."
      },
      {
        "question_text": "Joint System Object Notation",
        "misconception": "Targets general computing terms: &#39;Joint System&#39; sounds like a generic IT term but is not the specific origin of JSON."
      }
    ],
    "detailed_explanation": {
      "core_logic": "JSON, or JavaScript Object Notation, is a lightweight data-interchange format. It is human-readable and easy for machines to parse and generate. It is based on a subset of the JavaScript Programming Language Standard ECMA-262 3rd Edition - December 1999. JSON is a text format that is completely language independent but uses conventions that are familiar to programmers of the C-family of languages, including C, C++, C#, Java, JavaScript, Perl, Python, and many others. These properties make JSON an ideal data-interchange language.",
      "distractor_analysis": "The distractors play on common misassociations with the letter &#39;J&#39; (Java instead of JavaScript), plausible but incorrect programming terminology (&#39;Oriented&#39; instead of &#39;Object&#39;), and generic IT terms (&#39;Joint System&#39;) that lack specific meaning in this context.",
      "analogy": "Think of JSON as a universal language for computers to exchange information, much like English is a common language for people from different countries to communicate. It&#39;s structured in a way that&#39;s easy for both to understand."
    },
    "code_snippets": [
      {
        "language": "javascript",
        "code": "const user = {\n  &quot;name&quot;: &quot;Alice&quot;,\n  &quot;age&quot;: 30,\n  &quot;isAdmin&quot;: false\n};\nconsole.log(JSON.stringify(user));",
        "context": "Example of a JavaScript object being converted to a JSON string for transmission."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "WEB_BASICS"
    ]
  },
  {
    "question_text": "What does npm stand for in the context of JavaScript package management?",
    "correct_answer": "Node Package Manager",
    "distractors": [
      {
        "question_text": "Node Project Manager",
        "misconception": "Targets word substitution: &#39;Project&#39; sounds plausible as npm manages project dependencies, but &#39;Package&#39; is the correct term for software modules."
      },
      {
        "question_text": "Network Package Manager",
        "misconception": "Targets domain confusion: &#39;Network&#39; is a common computing term, but npm specifically refers to Node.js and its package ecosystem, not general network management."
      },
      {
        "question_text": "New Package Module",
        "misconception": "Targets letter confusion: &#39;New&#39; and &#39;Module&#39; are related to software development but are incorrect expansions for &#39;n&#39; and &#39;m&#39; in npm."
      }
    ],
    "detailed_explanation": {
      "core_logic": "npm stands for Node Package Manager. It is the default package manager for the JavaScript runtime environment Node.js, used for installing, sharing, and managing code packages (dependencies) for JavaScript projects.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Node Project Manager&#39; is incorrect because npm manages &#39;packages&#39; not &#39;projects&#39; directly. &#39;Network Package Manager&#39; is incorrect as npm is specific to Node.js, not a general network tool. &#39;New Package Module&#39; incorrectly expands the &#39;N&#39; and &#39;M&#39; letters.",
      "analogy": "Think of npm as a librarian for your JavaScript projects. It helps you find, download, and organize all the books (packages) your project needs to function, ensuring you have the right versions."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "npm install express\nnpm init\nnpm shrinkwrap",
        "context": "Common npm commands for installing a package, initializing a project, and creating a shrinkwrap file for dependency locking."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "DEV_BASICS",
      "WEB_APP_SEC"
    ]
  },
  {
    "question_text": "What does HTTPS stand for in the context of securing mobile browser communication?",
    "correct_answer": "Hypertext Transfer Protocol Secure",
    "distractors": [
      {
        "question_text": "Hypertext Transmission Protocol Secure",
        "misconception": "Targets word substitution: Transmission sounds similar to Transfer and is related to network communication, but is incorrect."
      },
      {
        "question_text": "Hyperlink Transfer Protocol Secure",
        "misconception": "Targets word substitution: Hyperlink is a related web concept but is not the correct term in the protocol&#39;s name."
      },
      {
        "question_text": "Hypertext Transport Protocol Secure",
        "misconception": "Targets word substitution: Transport is a common networking layer term, but Transfer is the correct word in this specific protocol name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "HTTPS is the secure version of HTTP, the protocol over which data is sent between your browser and the website that you are connecting to. The &#39;S&#39; at the end of HTTPS stands for &#39;Secure&#39;, meaning all communications between your browser and the website are encrypted, protecting sensitive data like credentials from eavesdropping.",
      "distractor_analysis": "Each distractor replaces a key word (&#39;Transfer&#39;) with a plausible but incorrect synonym or related term (&#39;Transmission&#39;, &#39;Hyperlink&#39;, &#39;Transport&#39;), testing precise recall of the protocol&#39;s full name.",
      "analogy": "Think of HTTP as sending a postcard (anyone can read it) and HTTPS as sending a sealed, encrypted letter (only the recipient can read it)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "curl -v https://example.com",
        "context": "Using `curl` with the `-v` (verbose) flag to see the SSL/TLS handshake details when connecting to an HTTPS site."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CRYPTO_BASICS"
    ]
  }
]