[
  {
    "question_text": "What is the significance of the Cook-Levin theorem in the context of NP-completeness?",
    "correct_answer": "It proves that Boolean satisfiability is the first NP-complete problem, serving as a base for proving other problems NP-complete through reduction.",
    "distractors": [
      {
        "question_text": "It provides a polynomial-time algorithm for solving all NP-complete problems.",
        "misconception": "Targets fundamental misunderstanding: Student confuses proving NP-completeness with solving NP-complete problems efficiently."
      },
      {
        "question_text": "It demonstrates that P = NP by showing an efficient solution for a known NP problem.",
        "misconception": "Targets P vs NP confusion: Student believes the theorem resolves P=NP in the affirmative."
      },
      {
        "question_text": "It establishes that all problems in P can be reduced to Boolean satisfiability.",
        "misconception": "Targets reduction direction confusion: Student reverses the direction of reduction for NP-completeness."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Cook-Levin theorem is foundational because it was the first to prove a specific problem, Boolean satisfiability, is NP-complete. This provided a starting point; once one problem is proven NP-complete, others can be shown to be NP-complete by demonstrating a poly-time reduction from the known NP-complete problem to the new one.",
      "distractor_analysis": "The Cook-Levin theorem does not provide efficient algorithms for NP-complete problems; rather, it classifies one as NP-complete. It also does not prove P=NP; in fact, it underpins the strong belief that P!=NP. The theorem shows that all problems in NP can be reduced to Boolean satisfiability, not the other way around.",
      "analogy": "The Cook-Levin theorem is like discovering the first &#39;master key&#39; that can unlock a specific type of complex lock. Once you have that master key, you can then prove other locks are equally complex by showing that if you could pick them, you could also pick the original master-key lock."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "ALGORITHM_ANALYSIS",
      "COMPLEXITY_THEORY"
    ]
  }
]