[
  {
    "question_text": "What does API stand for in the context of web application communication?",
    "correct_answer": "Application Programming Interface",
    "distractors": [
      {
        "question_text": "Application Protocol Interface",
        "misconception": "Targets term substitution: &#39;Protocol&#39; is a related concept in networking but &#39;Programming&#39; is the correct term for how applications interact."
      },
      {
        "question_text": "Automated Program Interface",
        "misconception": "Targets word substitution: &#39;Automated&#39; is a plausible descriptor for some API uses, but not part of the official expansion."
      },
      {
        "question_text": "Application Process Interface",
        "misconception": "Targets similar-sounding terms: &#39;Process&#39; is a general computing term, but &#39;Programming&#39; specifically refers to the code-level interaction."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An API (Application Programming Interface) defines a set of rules and protocols for building and interacting with software applications. It specifies how software components should interact, enabling different applications to communicate with each other.",
      "distractor_analysis": "The distractors replace &#39;Programming&#39; with related but incorrect terms like &#39;Protocol&#39;, &#39;Automated&#39;, or &#39;Process&#39;, which might seem plausible to someone with partial knowledge of software or networking concepts.",
      "analogy": "Think of an API as a menu in a restaurant. It lists what you can order (functions) and how to order it (parameters), without needing to know how the kitchen (application) prepares the food."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "curl -X GET &quot;https://api.example.com/data?param=value&quot; -H &quot;Authorization: Bearer YOUR_TOKEN&quot;",
        "context": "Example of a cURL command interacting with a RESTful API endpoint using a GET request and an Authorization header."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does &#39;pentesting&#39; stand for in the context of cybersecurity?",
    "correct_answer": "Penetration Testing",
    "distractors": [
      {
        "question_text": "Penetration Testing",
        "misconception": "Targets common abbreviation: While &#39;pentesting&#39; is a common abbreviation, the question asks for the full expansion, which is &#39;Penetration Testing&#39;."
      },
      {
        "question_text": "Penetration Test",
        "misconception": "Targets grammatical precision: &#39;Testing&#39; implies the ongoing process or methodology, whereas &#39;Test&#39; is a singular event or outcome, which is less accurate for the general practice."
      },
      {
        "question_text": "Penetration Technique",
        "misconception": "Targets word substitution: &#39;Technique&#39; is a method, but &#39;Testing&#39; refers to the overall process of evaluating security, which is the core meaning of pentesting."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Penetration Testing, often abbreviated as &#39;pentesting&#39;, is a simulated cyberattack against a computer system, network, or web application to check for exploitable vulnerabilities. It is a proactive security measure.",
      "distractor_analysis": "The distractors play on common ways the term is abbreviated or slightly altered. &#39;Penetration Testing&#39; is the full, formal expansion. &#39;Penetration Test&#39; is grammatically close but less encompassing than &#39;Testing&#39;. &#39;Penetration Technique&#39; refers to a method used within a penetration test, not the test itself.",
      "analogy": "Pentesting is like hiring a professional burglar to try and break into your house (with your permission) to find weaknesses before a real burglar does."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nmap -sV -p- --script vuln &lt;target_ip&gt;",
        "context": "A common command used in penetration testing for vulnerability scanning and service version detection."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does SQLi stand for in the context of database vulnerabilities?",
    "correct_answer": "SQL Injection",
    "distractors": [
      {
        "question_text": "Structured Query Language Interface",
        "misconception": "Targets similar-sounding terms: &#39;Interface&#39; is a common IT term and sounds plausible with SQL, but is incorrect."
      },
      {
        "question_text": "Secure Query Logic Integration",
        "misconception": "Targets word substitution: &#39;Secure&#39; and &#39;Logic&#39; are security-related terms that could be mistakenly associated with SQLi."
      },
      {
        "question_text": "System Query Language Interception",
        "misconception": "Targets concept confusion: &#39;Interception&#39; relates to network attacks, which SQLi can facilitate, but is not the direct meaning of the &#39;i&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQLi, or SQL Injection, is a code injection technique used to attack data-driven applications, in which malicious SQL statements are inserted into an entry field for execution (e.g., to dump database contents to the attacker).",
      "distractor_analysis": "The distractors use words that are either common in IT (&#39;Interface&#39;), sound security-related (&#39;Secure&#39;, &#39;Logic&#39;), or describe a related attack concept (&#39;Interception&#39;), but none accurately represent the &#39;Injection&#39; aspect of the vulnerability.",
      "analogy": "Think of SQLi like giving a chef a recipe (your query) but secretly adding a note that tells them to also steal ingredients from the pantry (the database) while they&#39;re cooking."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; OR 1=1 --&#39;;",
        "context": "A classic example of a SQL Injection payload used to bypass authentication."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of database management and cybersecurity vulnerabilities?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a plausible descriptor for a widely used language, but &#39;Structured&#39; is the correct term."
      },
      {
        "question_text": "Sequential Query Language",
        "misconception": "Targets similar-sounding terms: &#39;Sequential&#39; relates to order, which can be part of database operations, but it&#39;s not the correct first word."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets concept confusion: &#39;Logic&#39; and &#39;System&#39; are related to how databases work, but &#39;Language&#39; is the correct term for SQL."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is fundamental for interacting with databases, including querying, updating, and deleting data.",
      "distractor_analysis": "The distractors play on common misrememberings or plausible-sounding alternatives for the words &#39;Structured&#39; and &#39;Language&#39;. &#39;Standard&#39; is a common mistake because SQL is a standard, but not its name. &#39;Sequential&#39; sounds technical but is incorrect. &#39;System Query Logic&#39; replaces &#39;Language&#39; with &#39;Logic&#39; and &#39;Structured&#39; with &#39;System&#39;, which are related concepts but not the correct expansion.",
      "analogy": "Think of SQL as the universal language you use to &#39;talk&#39; to a database. Just like you use English to ask questions and give commands to a person, you use SQL to ask questions and give commands to a database."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; AND password = &#39;password&#39;;",
        "context": "A basic SQL query to select data from a table."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does DBMS stand for in the context of database management and cybersecurity?",
    "correct_answer": "Database Management System",
    "distractors": [
      {
        "question_text": "Database Monitoring System",
        "misconception": "Targets word substitution: &#39;Monitoring&#39; is a related function but &#39;Management&#39; is the correct term for the overall system."
      },
      {
        "question_text": "Data Backup Management System",
        "misconception": "Targets scope confusion: While backup is a DBMS function, the &#39;B&#39; specifically stands for &#39;Database&#39;, not &#39;Backup&#39;."
      },
      {
        "question_text": "Distributed Database Management System",
        "misconception": "Targets specific type vs. general term: &#39;Distributed&#39; is a type of DBMS, but not the general expansion of the acronym itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Database Management System (DBMS) is software that interacts with end-users, applications, and the database itself to capture and analyze data. It provides a systematic way to create, retrieve, update, and manage data.",
      "distractor_analysis": "The distractors play on common misunderstandings or related concepts. &#39;Monitoring&#39; is a function of a DBMS but not its full name. &#39;Backup&#39; is a critical aspect of database operations but not what the &#39;B&#39; stands for. &#39;Distributed&#39; describes a specific architecture of a DBMS, not the general acronym.",
      "analogy": "Think of a DBMS as the librarian for a vast library (the database). It doesn&#39;t just store books; it organizes them, helps you find them, allows you to check them out and return them, and ensures they are kept in good condition."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT student_name, average FROM students WHERE kardex=&#39; UNION SELECT @@version,NULL,NULL--",
        "context": "This SQL injection example demonstrates how an attacker might interact with the underlying DBMS to extract system information, such as its version."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does VPC stand for in cloud networking?",
    "correct_answer": "Virtual Private Cloud",
    "distractors": [
      {
        "question_text": "Virtual Private Connection",
        "misconception": "Targets term substitution: &#39;Connection&#39; is a related networking concept but not the correct term for the isolated network environment."
      },
      {
        "question_text": "Virtualized Private Cloud",
        "misconception": "Targets word substitution: &#39;Virtualized&#39; is a common concept in cloud computing, but &#39;Virtual&#39; is the precise term in this acronym."
      },
      {
        "question_text": "Volume Private Cloud",
        "misconception": "Targets similar-sounding terms: &#39;Volume&#39; is a storage concept in cloud, which can be confused with network terms."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Virtual Private Cloud (VPC) is a virtual network dedicated to your AWS account (or similar in other cloud providers). It is logically isolated from other virtual networks in the AWS Cloud, allowing you to launch AWS resources into a virtual network that you&#39;ve defined.",
      "distractor_analysis": "The distractors test the precise wording of the acronym. &#39;Virtual Private Connection&#39; is incorrect as VPC defines an entire network, not just a connection. &#39;Virtualized Private Cloud&#39; uses a synonym that is not the exact term. &#39;Volume Private Cloud&#39; incorrectly substitutes a storage term for a networking term.",
      "analogy": "Think of a VPC as your own private, customizable section of a large apartment building (the cloud). You get to decide the layout, who can enter, and what services are available within your section, completely separate from other tenants."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "gcloud compute networks create my-vpc --subnet-mode=auto",
        "context": "Example command to create a VPC in Google Cloud Platform (GCP)."
      },
      {
        "language": "python",
        "code": "import boto3\nec2 = boto3.client(&#39;ec2&#39;)\nresponse = ec2.create_vpc(CidrBlock=&#39;10.0.0.0/16&#39;)",
        "context": "Example Python code using Boto3 to create a VPC in AWS."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does YAML stand for in the context of container configuration?",
    "correct_answer": "YAML Ain&#39;t Markup Language",
    "distractors": [
      {
        "question_text": "Yet Another Markup Language",
        "misconception": "Targets historical confusion: This was the original expansion, but it was changed to reflect its recursive nature and focus on data serialization over document markup."
      },
      {
        "question_text": "YAML Abstract Markup Language",
        "misconception": "Targets similar-sounding but incorrect terms: &#39;Abstract&#39; sounds plausible for a configuration language but is not part of the official expansion."
      },
      {
        "question_text": "YAML Application Markup Language",
        "misconception": "Targets functional association: While used for applications, &#39;Application&#39; is not part of the official recursive acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "YAML is a human-friendly data serialization standard for all programming languages. Its name is a recursive acronym, originally &#39;Yet Another Markup Language&#39;, but later changed to &#39;YAML Ain&#39;t Markup Language&#39; to emphasize its data-oriented purpose rather than document markup.",
      "distractor_analysis": "The distractors target common misunderstandings: the original expansion (&#39;Yet Another Markup Language&#39;), plausible but incorrect descriptive terms (&#39;Abstract&#39;, &#39;Application&#39;), and the subtle nature of recursive acronyms.",
      "analogy": "Think of YAML as a structured way to write down instructions or data, like a very organized shopping list, but its name is a bit of a self-referential joke, saying &#39;I&#39;m not just another way to write documents, I&#39;m for data!&#39;"
    },
    "code_snippets": [
      {
        "language": "yaml",
        "code": "apiVersion: v1\nkind: Pod\nmetadata:\n  name: my-pod\nspec:\n  containers:\n  - name: my-container\n    image: nginx:latest",
        "context": "Example of a Kubernetes Pod definition in YAML, demonstrating its use for configuration."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which expansion correctly defines SQL in the context of injection attacks?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; sounds plausible but &#39;Structured&#39; is the correct term for the database language."
      },
      {
        "question_text": "Secure Query Logic",
        "misconception": "Targets concept conflation: &#39;Secure&#39; and &#39;Logic&#39; are related to security but not part of the SQL acronym."
      },
      {
        "question_text": "System Query Language",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; starts with &#39;S&#39; and relates to computing but is incorrect for SQL."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). SQL injection is a common attack vector that uses malicious SQL code for backend database manipulation to access information that was not intended to be displayed.",
      "distractor_analysis": "Distractors are designed to test precise recall of the &#39;S&#39; in SQL, offering plausible but incorrect alternatives like &#39;Standard,&#39; &#39;Secure,&#39; or &#39;System&#39; that relate to computing or security but are not the exact term.",
      "analogy": "Think of SQL as the specific language you use to ask a database for information. SQL injection is like someone whispering a malicious command in that language to the database, making it do something it shouldn&#39;t."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; AND password = &#39;&#39; OR &#39;1&#39;=&#39;1&#39;;",
        "context": "A classic SQL injection payload demonstrating how an attacker can bypass authentication by manipulating the query logic."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does REGEX stand for in the context of input validation for security?",
    "correct_answer": "Regular Expression",
    "distractors": [
      {
        "question_text": "Registered Expression",
        "misconception": "Targets word substitution: &#39;Registered&#39; sounds plausible but is incorrect, confusing it with official registration."
      },
      {
        "question_text": "Recursive Expression",
        "misconception": "Targets similar-sounding terms: &#39;Recursive&#39; is a programming concept but not the correct expansion for REGEX."
      },
      {
        "question_text": "Regional Expression",
        "misconception": "Targets incorrect domain association: &#39;Regional&#39; implies geographical context, which is unrelated to the technical meaning of REGEX."
      }
    ],
    "detailed_explanation": {
      "core_logic": "REGEX, or Regular Expression, is a sequence of characters that defines a search pattern. It is widely used in programming languages and text editors for pattern matching, input validation, and data extraction. In cybersecurity, REGEX is crucial for validating user input to prevent injection attacks, ensure data integrity, and enforce specific data formats.",
      "distractor_analysis": "The distractors replace &#39;Regular&#39; with words that sound similar or are related to computing but do not form the correct expansion. &#39;Registered&#39; might imply a formal definition, &#39;Recursive&#39; is a programming paradigm, and &#39;Regional&#39; is a geographical term, none of which accurately describe REGEX.",
      "analogy": "Think of REGEX as a highly specific search warrant for data. Instead of looking for a single word, it looks for a pattern of characters, like &#39;any 3 digits followed by a hyphen and then 4 more digits&#39; for a phone number."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "import re\n\n# Example of a regex for email validation\nemail_regex = r&quot;^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$&quot;;\n\nif re.match(email_regex, &quot;test@example.com&quot;):\n    print(&quot;Valid email&quot;)\nelse:\n    print(&quot;Invalid email&quot;)",
        "context": "Python&#39;s &#39;re&#39; module is commonly used to apply Regular Expressions for input validation, such as checking email formats."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "WEB_APP_SEC"
    ]
  },
  {
    "question_text": "What does the acronym AV stand for in the context of cybersecurity tools?",
    "correct_answer": "Antivirus",
    "distractors": [
      {
        "question_text": "Advanced Verification",
        "misconception": "Targets similar-sounding terms: &#39;Advanced&#39; and &#39;Verification&#39; are common tech terms, but not the correct expansion for AV."
      },
      {
        "question_text": "Automated Vulnerability",
        "misconception": "Targets concept conflation: Vulnerability scanning is a related security concept, but AV refers to a specific type of software."
      },
      {
        "question_text": "Application Validation",
        "misconception": "Targets word substitution: &#39;Application&#39; and &#39;Validation&#39; are plausible but incorrect terms in this specific context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AV stands for Antivirus, which refers to software used to prevent, detect, and remove malicious software, including viruses, worms, and Trojans. It typically works by scanning files and comparing them against a database of known malware signatures or by detecting suspicious behavior.",
      "distractor_analysis": "The distractors use words that are common in cybersecurity or technology but do not form the correct, widely recognized expansion of AV. &#39;Advanced Verification&#39; sounds technical but is not the term. &#39;Automated Vulnerability&#39; conflates AV with vulnerability management. &#39;Application Validation&#39; is a general software concept, not specific to malware defense.",
      "analogy": "Think of AV software as a digital immune system for your computer, constantly scanning for and neutralizing threats before they can cause harm."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "clamscan -r --bell -i /home/user",
        "context": "Example command-line usage of ClamAV, an open-source antivirus engine, to recursively scan a directory and report infected files."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does FTP stand for in the context of network protocols and file transfer?",
    "correct_answer": "File Transfer Protocol",
    "distractors": [
      {
        "question_text": "Fast Transfer Protocol",
        "misconception": "Targets word substitution: &#39;Fast&#39; is a common, but incorrect, assumption for network speed-related protocols."
      },
      {
        "question_text": "File Transmission Protocol",
        "misconception": "Targets synonym substitution: &#39;Transmission&#39; is similar to &#39;Transfer&#39; but not the exact term used in the official protocol name."
      },
      {
        "question_text": "Folder Transfer Protocol",
        "misconception": "Targets scope confusion: While FTP can transfer folders, its name specifically refers to &#39;Files&#39;, which is a broader and more accurate term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "FTP, or File Transfer Protocol, is a standard network protocol used for the transfer of computer files between a client and server on a computer network. It is built on a client-server model architecture using separate control and data connections between the client and the server.",
      "distractor_analysis": "The distractors test precise recall of the protocol&#39;s name. &#39;Fast Transfer Protocol&#39; incorrectly implies a speed characteristic. &#39;File Transmission Protocol&#39; uses a synonym that is not the official term. &#39;Folder Transfer Protocol&#39; narrows the scope incorrectly, as FTP handles individual files primarily, even when transferring directories.",
      "analogy": "Think of FTP as a digital postal service specifically for files. You send a file from your computer (client) to a server, and FTP handles the rules and process for that delivery."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "ftp user@ftp.example.com\nput local_file.txt remote_file.txt\nget remote_report.pdf",
        "context": "Basic command-line FTP client usage for uploading and downloading files."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of database queries and SQL injection attacks?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a plausible but incorrect adjective for the query language."
      },
      {
        "question_text": "Sequential Query Language",
        "misconception": "Targets similar-sounding terms: &#39;Sequential&#39; relates to order but is not the correct descriptor for SQL."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets concept confusion: &#39;Logic&#39; and &#39;System&#39; are related to computing but fundamentally change the meaning of the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is primarily used for querying, inserting, updating, and modifying data.",
      "distractor_analysis": "The distractors replace &#39;Structured&#39; with plausible but incorrect words like &#39;Standard&#39; or &#39;Sequential&#39;, or entirely different concepts like &#39;System Query Logic&#39;, testing the precise recall of the acronym&#39;s expansion.",
      "analogy": "Think of SQL as the specific grammar and vocabulary you use to &#39;talk&#39; to a database and ask it for information or tell it to do something."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; AND password = &#39;password&#39;;",
        "context": "A basic SQL query to select data from a &#39;users&#39; table."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does AI stand for in the context of computer networking and cybersecurity?",
    "correct_answer": "Artificial Intelligence",
    "distractors": [
      {
        "question_text": "Automated Intelligence",
        "misconception": "Targets word substitution: &#39;Automated&#39; is a common characteristic of AI but not part of its formal expansion."
      },
      {
        "question_text": "Advanced Intelligence",
        "misconception": "Targets descriptive substitution: &#39;Advanced&#39; describes AI capabilities but is not the correct first word of the acronym."
      },
      {
        "question_text": "Algorithmic Intelligence",
        "misconception": "Targets technical association: AI heavily relies on algorithms, but this is not the correct expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AI, or Artificial Intelligence, refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions. In networking and cybersecurity, AI is used for tasks like automation, anomaly detection, and predictive analysis.",
      "distractor_analysis": "The distractors use words that are closely associated with AI&#39;s function or characteristics (Automated, Advanced, Algorithmic) but are not part of its precise expansion, testing for exact recall versus conceptual understanding.",
      "analogy": "Think of AI as a digital brain that can learn and make decisions, much like a human brain, but within a computer system."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of database interaction and web application vulnerabilities?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a plausible descriptor for a widely used language but &#39;Structured&#39; is the correct term."
      },
      {
        "question_text": "Sequential Query Language",
        "misconception": "Targets similar-sounding terms: &#39;Sequential&#39; relates to order but does not accurately describe the language&#39;s primary function or name."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets concept confusion: &#39;Logic&#39; and &#39;System&#39; are related to programming but not part of the official acronym expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is particularly relevant in web application security due to vulnerabilities like SQL injection, where malicious SQL statements are inserted into an entry field for execution.",
      "distractor_analysis": "The distractors play on common misrememberings or plausible-sounding alternatives. &#39;Standard&#39; is often associated with widely adopted technologies, &#39;Sequential&#39; might be confused with data processing order, and &#39;System Query Logic&#39; attempts to create a plausible but incorrect technical-sounding phrase.",
      "analogy": "Think of SQL as the specific language you use to ask a librarian (the database) for very precise information from their vast collection of books (the data). If you ask in a malicious way (SQL injection), you might get access to books you shouldn&#39;t see or even damage the library&#39;s catalog."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; AND password = &#39;password&#39;;",
        "context": "A basic SQL query to retrieve user data, often targeted by injection attacks."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does OS stand for in the context of computing and application accessibility?",
    "correct_answer": "Operating System",
    "distractors": [
      {
        "question_text": "Operational Security",
        "misconception": "Targets similar-sounding terms: Operational Security (OpSec) is a cybersecurity concept but unrelated to software platforms."
      },
      {
        "question_text": "Open Source",
        "misconception": "Targets acronym letter confusion: &#39;OS&#39; can also stand for Open Source, which describes software licensing, not the underlying platform."
      },
      {
        "question_text": "Output Stream",
        "misconception": "Targets technical term confusion: Output Stream is a programming concept but not the platform on which applications run."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In computing, OS refers to the Operating System, which is the fundamental software that manages computer hardware and software resources and provides common services for computer programs. Applications are designed to run on specific operating systems.",
      "distractor_analysis": "The distractors leverage other common &#39;OS&#39; acronyms or technical terms that sound plausible but are incorrect in this context. Operational Security is a security discipline, Open Source refers to a software development model, and Output Stream is a programming construct.",
      "analogy": "Think of an OS as the foundation of a house. Different houses (applications) can be built on it, but they need that specific foundation to stand. A web application, however, is like a house built on a cloud, accessible from many different foundations (OSes)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "uname -a",
        "context": "The &#39;uname -a&#39; command in Linux/Unix-like systems displays detailed information about the operating system kernel."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does IoT stand for in the context of cybersecurity and bug bounties?",
    "correct_answer": "Internet of Things",
    "distractors": [
      {
        "question_text": "Integrated of Things",
        "misconception": "Targets word substitution: &#39;Integrated&#39; is a plausible but incorrect substitute for &#39;Internet&#39;, often confused due to the interconnected nature of IoT devices."
      },
      {
        "question_text": "Internal of Things",
        "misconception": "Targets similar-sounding terms: &#39;Internal&#39; sounds similar to &#39;Internet&#39; but implies a private network, which is not the defining characteristic of IoT."
      },
      {
        "question_text": "Information of Things",
        "misconception": "Targets concept conflation: While IoT devices deal with information, &#39;Information&#39; is not the correct first word of the acronym, confusing the data aspect with the network aspect."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IoT refers to the vast network of physical objects embedded with sensors, software, and other technologies for the purpose of connecting and exchanging data with other devices and systems over the internet. In cybersecurity, it represents a significant attack surface due to the sheer number and often insecure nature of these devices.",
      "distractor_analysis": "The distractors play on common misrememberings or plausible-sounding alternatives for the first word of the acronym. &#39;Integrated&#39; and &#39;Internal&#39; are close phonetically or conceptually but are incorrect. &#39;Information&#39; focuses on the data aspect rather than the connectivity aspect that &#39;Internet&#39; emphasizes.",
      "analogy": "Think of IoT as every &#39;thing&#39; in your house (thermostat, fridge, light bulbs) suddenly having its own tiny internet connection and talking to each other and the outside world."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of database queries and web application attacks?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; sounds plausible for a widely adopted language but &#39;Structured&#39; is the correct term."
      },
      {
        "question_text": "Sequential Query Language",
        "misconception": "Targets similar-sounding terms: &#39;Sequential&#39; relates to data processing but does not accurately describe the language&#39;s structure."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets concept confusion: &#39;Logic&#39; and &#39;System&#39; are related to databases but are not part of the official acronym expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is primarily used for querying, inserting, updating, and modifying data.",
      "distractor_analysis": "Each distractor replaces a key word in the acronym with a plausible but incorrect alternative. &#39;Standard&#39; is a common guess due to SQL&#39;s widespread use. &#39;Sequential&#39; might be chosen by those thinking about data processing order. &#39;System Query Logic&#39; attempts to combine database-related terms that do not form the correct expansion.",
      "analogy": "SQL is like the universal language for talking to databases. If you want to ask a database for information, or tell it to change something, you use SQL commands."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT author,title,year FROM books WHERE publisher = &#39;Wiley&#39;",
        "context": "A basic SQL query to retrieve data from a &#39;books&#39; table based on a condition."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of database queries and web application security?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a plausible but incorrect synonym for &#39;Structured&#39; in this context."
      },
      {
        "question_text": "Sequential Query Language",
        "misconception": "Targets similar-sounding terms: &#39;Sequential&#39; relates to order but is not the correct term for SQL&#39;s structure."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets concept confusion: &#39;System&#39; and &#39;Logic&#39; are general computing terms but do not accurately describe the &#39;S&#39; and &#39;L&#39; in SQL."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is particularly relevant in web application security due to vulnerabilities like SQL injection, where malicious SQL statements are inserted into an entry field for execution.",
      "distractor_analysis": "The distractors replace &#39;Structured&#39; with similar-sounding or related but incorrect terms like &#39;Standard&#39; or &#39;Sequential&#39;, or substitute &#39;Language&#39; with &#39;Logic&#39;, testing the precise recall of the acronym&#39;s expansion. &#39;Standard&#39; is a common guess because SQL is a standard, but &#39;Structured&#39; refers to its design paradigm.",
      "analogy": "Think of SQL as the specific grammar and vocabulary you use to &#39;talk&#39; to a database. Just like you need to use correct grammar to be understood, SQL provides a structured way to ask the database for information or to make changes."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT ename, sal FROM EMP WHERE ename = &#39;John Doe&#39;;",
        "context": "A basic SQL query to select employee name and salary from the EMP table where the employee name is &#39;John Doe&#39;."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does DBA stand for in the context of database administration?",
    "correct_answer": "Database Administrator",
    "distractors": [
      {
        "question_text": "Database Access",
        "misconception": "Targets term substitution: &#39;Access&#39; is related to database permissions but not the role itself."
      },
      {
        "question_text": "Data Backup Agent",
        "misconception": "Targets similar-sounding terms: &#39;Backup Agent&#39; is a plausible IT role but incorrect for DBA."
      },
      {
        "question_text": "Distributed Business Application",
        "misconception": "Targets acronym letter confusion: &#39;DBA&#39; can stand for other things in different contexts, but not in database administration."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DBA refers to the Database Administrator, a role responsible for the management, maintenance, performance, and security of a database system. This includes tasks like setting up user privileges, ensuring data integrity, and applying patches.",
      "distractor_analysis": "The distractors test whether the student knows the specific role &#39;Administrator&#39; versus related concepts like &#39;Access&#39; or other plausible but incorrect IT roles like &#39;Backup Agent&#39;. The &#39;Distributed Business Application&#39; distractor tests for confusion with other common acronyms that share the same letters.",
      "analogy": "Think of a DBA as the chief librarian for a vast digital library. They don&#39;t just read books (data access); they organize, maintain, secure, and manage the entire library system and its users."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of database queries and injection attacks?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a plausible but incorrect substitute for &#39;Structured&#39;, which is the precise term."
      },
      {
        "question_text": "Sequential Query Language",
        "misconception": "Targets similar-sounding terms: &#39;Sequential&#39; relates to order but is not the correct descriptor for the language&#39;s structure."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets concept confusion: &#39;Logic&#39; and &#39;System&#39; are too generic and do not accurately describe the nature of the language."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is particularly relevant in cybersecurity due to SQL injection vulnerabilities, where attackers manipulate SQL queries.",
      "distractor_analysis": "The distractors test the precise recall of the first word &#39;Structured&#39;. &#39;Standard&#39; is a common misremembering, &#39;Sequential&#39; is a plausible but incorrect descriptor, and &#39;System Query Logic&#39; is a broad, incorrect guess.",
      "analogy": "SQL is like the specific grammar and vocabulary you use to ask a librarian (the database) for very specific books (data) from their collection (the database tables)."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; AND password = &#39;password&#39;;",
        "context": "A basic SQL query to select user data, often targeted in SQL injection attacks."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does LAMP stand for in the context of web application architecture?",
    "correct_answer": "Linux, Apache, MySQL, PHP",
    "distractors": [
      {
        "question_text": "Linux, Apache, MongoDB, Python",
        "misconception": "Targets technology substitution: MongoDB and Python are common web technologies but not part of the classic LAMP stack."
      },
      {
        "question_text": "Local, Apache, MySQL, Perl",
        "misconception": "Targets initialism confusion: &#39;Local&#39; is incorrect for &#39;L&#39;, and &#39;Perl&#39; is a common scripting language but PHP is the standard for LAMP."
      },
      {
        "question_text": "Linux, Application, Middleware, PHP",
        "misconception": "Targets conceptual misunderstanding: &#39;Application&#39; and &#39;Middleware&#39; are generic terms, not specific components of this stack."
      }
    ],
    "detailed_explanation": {
      "core_logic": "LAMP is a popular open-source web stack used for hosting dynamic websites and web applications. It is an acronym for its four core components: Linux (the operating system), Apache (the web server), MySQL (the database management system), and PHP (the scripting language).",
      "distractor_analysis": "Distractors replace one or more components with other common but incorrect technologies (MongoDB, Python, Perl) or generic terms (Application, Middleware), testing precise recall of the specific technologies that constitute the LAMP stack.",
      "analogy": "LAMP is like a pre-built, ready-to-use toolkit for building and running a website, where each tool (OS, web server, database, scripting language) has a specific, essential job."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sudo apt update\nsudo apt install apache2 mysql-server php libapache2-mod-php php-mysql",
        "context": "This command sequence demonstrates how to install the core components of a LAMP stack on a Debian-based Linux distribution."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "WEB_APP_BASICS"
    ]
  },
  {
    "question_text": "In networking and cybersecurity, what does DNS stand for?",
    "correct_answer": "Domain Name System",
    "distractors": [
      {
        "question_text": "Dynamic Network Service",
        "misconception": "Targets similar-sounding terms: Dynamic and Network are common networking terms, but incorrect for DNS."
      },
      {
        "question_text": "Distributed Name Server",
        "misconception": "Targets partial understanding: DNS involves distributed servers, but &#39;System&#39; is the correct final word."
      },
      {
        "question_text": "Domain Naming Standard",
        "misconception": "Targets word substitution: Standard is a related concept, but System accurately describes the overall infrastructure."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Domain Name System (DNS) is a hierarchical and decentralized naming system for computers, services, or any resource connected to the Internet or a private network. It translates human-readable domain names (like example.com) into numerical IP addresses (like 192.0.2.1) that computers use to identify each other.",
      "distractor_analysis": "Distractors are designed to catch those who have a general understanding of DNS&#39;s function but don&#39;t recall its precise expansion. &#39;Dynamic Network Service&#39; uses common networking terms. &#39;Distributed Name Server&#39; captures a key architectural aspect but misses the &#39;System&#39; part. &#39;Domain Naming Standard&#39; substitutes &#39;System&#39; with &#39;Standard&#39;, which is a related but incorrect term.",
      "analogy": "DNS is like the internet&#39;s phonebook. Instead of remembering a phone number (IP address) for every person (website) you want to call, you just look up their name (domain name) and the phonebook gives you the number."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nslookup example.com",
        "context": "Command-line tool to query DNS servers for domain information."
      },
      {
        "language": "javascript",
        "code": "const dns = require(&#39;dns&#39;);\ndns.resolve(&#39;example.com&#39;, (err, addresses) =&gt; {\n  if (err) throw err;\n  console.log(`IP addresses: ${JSON.stringify(addresses)}`);\n});",
        "context": "Node.js code snippet demonstrating how to programmatically resolve a domain name to an IP address using the built-in DNS module."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SQL stand for in the context of client-side injection attacks?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a common synonym for &#39;Structured&#39; but is incorrect in this specific acronym."
      },
      {
        "question_text": "Secure Query Language",
        "misconception": "Targets functional assumption: Students might assume &#39;Secure&#39; due to the security context, but it&#39;s not part of the official expansion."
      },
      {
        "question_text": "System Query Logic",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; and &#39;Logic&#39; are related to databases but are incorrect substitutions for &#39;Structured&#39; and &#39;Language&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). SQL injection is a common attack vector that uses malicious SQL code for backend database manipulation.",
      "distractor_analysis": "The distractors test precise recall of the &#39;S&#39; and &#39;L&#39; terms. &#39;Standard&#39; is a plausible but incorrect synonym for &#39;Structured&#39;. &#39;Secure&#39; incorrectly implies a security function within the name itself. &#39;System Query Logic&#39; uses terms related to databases but incorrectly substitutes the core words.",
      "analogy": "Think of SQL as the specific language you use to talk to a database. SQL injection is like whispering a malicious command in that language to trick the database into doing something it shouldn&#39;t."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT * FROM users WHERE username = &#39;admin&#39; AND password = &#39;&#39; OR &#39;1&#39;=&#39;1&#39;;",
        "context": "A classic SQL injection payload that bypasses authentication by always evaluating to true."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "NET_BASICS"
    ]
  }
]