[
  {
    "question_text": "What does POLA stand for in the context of cybersecurity and access control?",
    "correct_answer": "Principle of Least Authority",
    "distractors": [
      {
        "question_text": "Principle of Limited Access",
        "misconception": "Targets similar concept, different term: &#39;Limited Access&#39; conveys a similar idea but is not the exact, recognized acronym expansion."
      },
      {
        "question_text": "Policy of Least Authority",
        "misconception": "Targets word substitution: &#39;Policy&#39; is a related governance term but &#39;Principle&#39; is the correct foundational concept."
      },
      {
        "question_text": "Protection of Local Assets",
        "misconception": "Targets letter confusion: &#39;P&#39; and &#39;L&#39; are correct, but &#39;O&#39; and &#39;A&#39; are completely different, leading to a plausible but incorrect security concept."
      }
    ],
    "detailed_explanation": {
      "core_logic": "POLA, or Principle of Least Authority (also known as Principle of Least Privilege), is a fundamental security concept dictating that users, programs, or processes should be granted only the minimum necessary permissions to perform their intended function, and no more. This minimizes the potential damage if an entity is compromised.",
      "distractor_analysis": "The distractors test the precise recall of the acronym&#39;s expansion. &#39;Principle of Limited Access&#39; uses a synonym for &#39;Least Authority&#39; but is not the standard term. &#39;Policy of Least Authority&#39; substitutes &#39;Principle&#39; with &#39;Policy,&#39; which is a related but distinct concept in security governance. &#39;Protection of Local Assets&#39; completely changes the meaning of &#39;O&#39; and &#39;A&#39; while still sounding like a security-related concept.",
      "analogy": "Think of POLA like giving someone a key: you only give them the key to the specific room they need to enter, not a master key to the entire building."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "CREATE USER natter_api_user PASSWORD &#39;password&#39;;\nGRANT SELECT, INSERT ON spaces, messages TO natter_api_user;",
        "context": "This SQL snippet demonstrates applying POLA by creating a user with only SELECT and INSERT permissions, preventing them from performing more destructive actions like DROP TABLE."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does PSK stand for in the context of device authentication for APIs?",
    "correct_answer": "Pre-Shared Key",
    "distractors": [
      {
        "question_text": "Private Session Key",
        "misconception": "Targets similar-sounding terms: &#39;Private&#39; and &#39;Session&#39; are common in cryptography but incorrect here."
      },
      {
        "question_text": "Public Secret Key",
        "misconception": "Targets contradictory terms: &#39;Public&#39; and &#39;Secret&#39; are generally opposing concepts in key management."
      },
      {
        "question_text": "Persistent Security Key",
        "misconception": "Targets plausible but incorrect functionality: &#39;Persistent&#39; and &#39;Security&#39; sound relevant but don&#39;t form the correct acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Pre-Shared Key (PSK) is a secret cryptographic key that has been previously shared between two parties (e.g., a device and an API server) using a secure channel before it needs to be used. It&#39;s used for authentication and often for encrypting communications.",
      "distractor_analysis": "The distractors use words commonly associated with cryptography (Private, Public, Secret, Session, Persistent, Security) to create plausible but incorrect expansions, testing for precise recall of the &#39;Pre-Shared&#39; component.",
      "analogy": "Think of a PSK like a secret handshake or a password that two people agree upon in advance, so they can recognize each other later without needing a third party."
    },
    "code_snippets": [
      {
        "language": "java",
        "code": "final byte[] encryptedPsk;",
        "context": "The `encryptedPsk` field in the `Device` class stores the encrypted Pre-Shared Key, which is central to device authentication."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "CRYPTO_BASICS",
      "API_SECURITY"
    ]
  },
  {
    "question_text": "What does MobSF stand for in the context of mobile application security analysis?",
    "correct_answer": "Mobile Security Framework",
    "distractors": [
      {
        "question_text": "Mobile System Framework",
        "misconception": "Targets word substitution: &#39;System&#39; is a plausible but incorrect substitute for &#39;Security&#39;, which is the core focus."
      },
      {
        "question_text": "Mobile Software Framework",
        "misconception": "Targets word substitution: &#39;Software&#39; is a common term in application development but &#39;Security&#39; is the specific domain of MobSF."
      },
      {
        "question_text": "Modular Security Framework",
        "misconception": "Targets letter confusion: &#39;M&#39; for Modular instead of Mobile, which is a common misinterpretation for acronyms."
      }
    ],
    "detailed_explanation": {
      "core_logic": "MobSF, or Mobile Security Framework, is an automated, all-in-one mobile application (Android/iOS/Windows) pen-testing, malware analysis, and security assessment framework capable of performing static and dynamic analysis.",
      "distractor_analysis": "The distractors replace &#39;Security&#39; with similar-sounding or related terms like &#39;System&#39; or &#39;Software&#39;, or misinterpret the &#39;M&#39; as &#39;Modular&#39; instead of &#39;Mobile&#39;, testing the precise recall of the acronym&#39;s expansion.",
      "analogy": "MobSF is like a multi-tool for mobile app security, combining many different functions into one framework to help find vulnerabilities."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git clone https://github.com/MobSF/MobSF.git\ncd MobSF\n./setup.sh\npython manage.py runserver",
        "context": "Basic commands to set up and run MobSF for mobile application analysis."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "In the context of web security, what does XSS stand for?",
    "correct_answer": "Cross-Site Scripting",
    "distractors": [
      {
        "question_text": "Cross-Site Session",
        "misconception": "Targets similar-sounding terms: &#39;Session&#39; is a related web concept but not the correct expansion for XSS."
      },
      {
        "question_text": "Cross-System Scripting",
        "misconception": "Targets scope confusion: &#39;System&#39; is too broad; XSS specifically targets &#39;Site&#39; (web applications)."
      },
      {
        "question_text": "External Style Sheet",
        "misconception": "Targets acronym letter confusion: &#39;XSS&#39; is used instead of &#39;CSS&#39; to avoid confusion with Cascading Style Sheets, but this distractor incorrectly uses a CSS-related term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XSS, or Cross-Site Scripting, is a type of security vulnerability typically found in web applications. XSS attacks enable attackers to inject client-side scripts into web pages viewed by other users. An XSS vulnerability may be used by attackers to bypass access controls such as the same-origin policy.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Cross-Site Session&#39; uses a related web security term. &#39;Cross-System Scripting&#39; broadens the scope incorrectly. &#39;External Style Sheet&#39; plays on the &#39;XSS&#39; vs &#39;CSS&#39; naming convention, which is a common point of confusion.",
      "analogy": "Think of XSS as a malicious graffiti artist who sneaks a message onto a public billboard. When people look at the billboard, they unknowingly execute the artist&#39;s hidden instructions, which could be to steal their wallet or redirect them to a dangerous place."
    },
    "code_snippets": [
      {
        "language": "html",
        "code": "&lt;!-- Example of a reflected XSS payload --&gt;\n&lt;script&gt;alert(&#39;You are hacked!&#39;);&lt;/script&gt;",
        "context": "An attacker might inject this script into a vulnerable web page, which then executes in the victim&#39;s browser."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "WEB_BASICS"
    ]
  },
  {
    "question_text": "What does DOM stand for in the context of web technologies and XSS attacks?",
    "correct_answer": "Document Object Model",
    "distractors": [
      {
        "question_text": "Dynamic Object Model",
        "misconception": "Targets similar-sounding terms: &#39;Dynamic&#39; is a common term in web development and sounds plausible for a model that changes."
      },
      {
        "question_text": "Document Order Model",
        "misconception": "Targets word substitution: &#39;Order&#39; relates to structure, which is part of DOM&#39;s function, but is not the correct term."
      },
      {
        "question_text": "Data Object Model",
        "misconception": "Targets concept conflation: &#39;Data&#39; is processed by the DOM, but it&#39;s the &#39;Document&#39; itself that is modeled."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Document Object Model (DOM) is a programming interface for web documents. It represents the page so that programs can change the document structure, style, and content. It&#39;s crucial for understanding DOM-based XSS because these attacks manipulate the DOM directly on the client-side without server interaction.",
      "distractor_analysis": "Distractors use words that are common in web development (&#39;Dynamic&#39;, &#39;Data&#39;) or relate to the DOM&#39;s function (&#39;Order&#39;) to create plausible but incorrect expansions, testing for precise recall of the acronym&#39;s meaning.",
      "analogy": "Think of the DOM as a tree-like map of a web page. Each element (like a paragraph, image, or button) is a &#39;node&#39; on this map. JavaScript can use this map to find any element and change it, just like you might use a map to find a location and then draw something new on it."
    },
    "code_snippets": [
      {
        "language": "javascript",
        "code": "document.getElementById(&#39;myElement&#39;).innerHTML = &#39;New Content&#39;;",
        "context": "This JavaScript snippet demonstrates how the DOM is used to access and modify an HTML element&#39;s content directly in the browser."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does CSRF stand for in the context of web security vulnerabilities?",
    "correct_answer": "Cross-Site Request Forgery",
    "distractors": [
      {
        "question_text": "Cross-Site Remote Forgery",
        "misconception": "Targets word substitution: &#39;Remote&#39; sounds plausible in a network context but is incorrect for this specific attack type."
      },
      {
        "question_text": "Client-Side Request Forgery",
        "misconception": "Targets initialism confusion: &#39;Client-Side&#39; is a common web term, but the &#39;C&#39; in CSRF refers to &#39;Cross-Site&#39;."
      },
      {
        "question_text": "Content-Sensitive Request Forgery",
        "misconception": "Targets similar-sounding terms: &#39;Content-Sensitive&#39; relates to web data but is not the correct expansion for CSRF."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CSRF, or Cross-Site Request Forgery, is a type of malicious exploit of a website where unauthorized commands are transmitted from a user that the web application trusts. It tricks the victim into submitting a malicious request without their knowledge or consent.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Remote&#39; is a common term in security but incorrect here. &#39;Client-Side&#39; is a plausible misinterpretation of the &#39;C&#39;. &#39;Content-Sensitive&#39; uses a similar-sounding adjective that is not part of the correct expansion.",
      "analogy": "Imagine you&#39;re logged into your bank. A malicious website tricks your browser into sending a request to your bank (e.g., &#39;transfer money&#39;) that looks legitimate because your browser automatically includes your session cookies. You didn&#39;t intend to send it, but your browser did, on your behalf."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "WEB_SECURITY"
    ]
  },
  {
    "question_text": "What does OSCP stand for in the context of Offensive Security certifications?",
    "correct_answer": "Offensive Security Certified Professional",
    "distractors": [
      {
        "question_text": "Offensive Security Certified Practitioner",
        "misconception": "Targets word substitution: &#39;Practitioner&#39; sounds similar to &#39;Professional&#39; and is a common term in certification names, but is incorrect here."
      },
      {
        "question_text": "Offensive Security Certified Penetration Tester",
        "misconception": "Targets functional confusion: While the certification is for penetration testing, &#39;Penetration Tester&#39; is not part of the official acronym expansion."
      },
      {
        "question_text": "Offensive System Certified Professional",
        "misconception": "Targets initial word confusion: &#39;System&#39; is a plausible alternative for &#39;Security&#39; in a technical context, but &#39;Offensive Security&#39; is the company name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "OSCP stands for Offensive Security Certified Professional. It is a well-known certification in the cybersecurity industry, particularly for penetration testing, and is offered by Offensive Security.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Practitioner&#39; is a common substitute for &#39;Professional&#39; in certification titles. &#39;Penetration Tester&#39; describes the role the certification prepares one for, but isn&#39;t in the acronym itself. &#39;System&#39; for &#39;Security&#39; is a plausible misremembering of the company&#39;s full name.",
      "analogy": "Think of OSCP as a specific job title on a business card. You might know what the person does, but the card itself has a precise title."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does CSPM stand for in the context of cloud security?",
    "correct_answer": "Cloud Security Posture Management",
    "distractors": [
      {
        "question_text": "Cloud Security Policy Management",
        "misconception": "Targets word substitution: Policy is a related concept but Posture refers to the overall security state and configuration."
      },
      {
        "question_text": "Container Security Posture Management",
        "misconception": "Targets scope confusion: While relevant to containers in the cloud, the &#39;C&#39; specifically stands for Cloud, not Container."
      },
      {
        "question_text": "Cloud Service Posture Management",
        "misconception": "Targets word substitution: Service is a component of cloud, but Security is the direct focus of the &#39;S&#39; in CSPM."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CSPM (Cloud Security Posture Management) refers to a set of tools and practices designed to identify and remediate misconfigurations and compliance risks in cloud environments. It continuously monitors cloud infrastructure for security vulnerabilities and policy violations.",
      "distractor_analysis": "Distractors test the precise meaning of each letter. &#39;Policy&#39; is related but less encompassing than &#39;Posture&#39;. &#39;Container&#39; is a specific workload type within the broader &#39;Cloud&#39; context. &#39;Service&#39; is a component, but &#39;Security&#39; is the direct focus of the &#39;S&#39;.",
      "analogy": "Think of CSPM as a continuous auditor for your cloud environment, constantly checking if everything is set up correctly and securely, like a building inspector ensuring all safety codes are met."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE",
      "CLOUD_SECURITY"
    ]
  },
  {
    "question_text": "What does SSRF stand for in the context of web security?",
    "correct_answer": "Server-Side Request Forgery",
    "distractors": [
      {
        "question_text": "Site-Side Request Forgery",
        "misconception": "Targets similar-sounding terms: &#39;Site&#39; is a common web term but &#39;Server&#39; is specific to the attack vector"
      },
      {
        "question_text": "Server-Side Resource Forgery",
        "misconception": "Targets word substitution: &#39;Resource&#39; is related but &#39;Request&#39; accurately describes the forged action"
      },
      {
        "question_text": "System-Side Request Forgery",
        "misconception": "Targets scope confusion: &#39;System&#39; is too broad; the attack specifically targets the server&#39;s ability to make requests"
      }
    ],
    "detailed_explanation": {
      "core_logic": "SSRF (Server-Side Request Forgery) is a web security vulnerability that allows an attacker to induce the server-side application to make HTTP requests to an arbitrary domain of the attacker&#39;s choosing. This can lead to the server making requests to internal resources, other internal systems, or external systems, potentially exposing sensitive information or enabling further attacks.",
      "distractor_analysis": "Distractors are designed to be plausible by using terms commonly associated with web or system security. &#39;Site-Side&#39; attempts to confuse with client-side concepts. &#39;Resource Forgery&#39; misidentifies the forged action as a resource rather than a request. &#39;System-Side&#39; broadens the scope incorrectly, as the attack specifically leverages the server&#39;s request-making capability.",
      "analogy": "Imagine a server as a trusted employee who can access various internal departments. An SSRF attack is like tricking that employee into fetching sensitive documents from a restricted internal department, or even making purchases from an external vendor, all under the guise of a legitimate request from their manager (the attacker)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "curl &#39;http://example.com/vulnerable_endpoint?url=http://127.0.0.1/admin&#39;",
        "context": "A common SSRF exploit involves manipulating a URL parameter to make the server request an internal resource like an admin panel."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does DAST stand for in cybersecurity?",
    "correct_answer": "Dynamic Application Security Testing",
    "distractors": [
      {
        "question_text": "Dynamic Application Static Testing",
        "misconception": "Targets term confusion: Static Testing (SAST) is a distinct methodology, often confused with Dynamic Testing (DAST)."
      },
      {
        "question_text": "Delivery Application Server Testing",
        "misconception": "Targets similar-sounding words: &#39;Delivery&#39; and &#39;Server&#39; are plausible but incorrect substitutions for &#39;Dynamic&#39; and &#39;Security&#39;."
      },
      {
        "question_text": "Dynamic Application Server Takeover",
        "misconception": "Targets outcome vs. method: &#39;Server Takeover&#39; is a potential outcome of a vulnerability, not the testing methodology itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DAST, or Dynamic Application Security Testing, is a black-box testing methodology that analyzes a running application from the outside to find vulnerabilities. It simulates real-world attacks to identify issues like SQL injection, XSS, and misconfigurations that might not be apparent from static code analysis.",
      "distractor_analysis": "The distractors play on common confusions: &#39;Static Testing&#39; refers to SAST, a different approach. &#39;Delivery&#39; and &#39;Server&#39; are plausible but incorrect word choices. &#39;Server Takeover&#39; describes an attack outcome, not the testing process itself.",
      "analogy": "DAST is like a penetration tester trying to break into a house while it&#39;s occupied and running, looking for unlocked windows or weak doors, without having the blueprints (source code)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nikto -h http://example.com",
        "context": "Nikto is a common open-source DAST tool used for scanning web servers for known vulnerabilities and misconfigurations."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does the acronym IOC stand for in cybersecurity?",
    "correct_answer": "Indicator of Compromise",
    "distractors": [
      {
        "question_text": "Indicator of Concern",
        "misconception": "Targets word substitution: &#39;Concern&#39; is a plausible but incorrect synonym for &#39;Compromise&#39; in this context."
      },
      {
        "question_text": "Incident of Compromise",
        "misconception": "Targets word substitution: &#39;Incident&#39; is a related concept in incident response but &#39;Indicator&#39; is the correct term."
      },
      {
        "question_text": "Information of Compromise",
        "misconception": "Targets word substitution: &#39;Information&#39; is too generic and does not convey the specific meaning of a sign of compromise."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Indicator of Compromise (IOC) is forensic data, such as data found in system or network log entries or files, that identifies potentially malicious activity on a system or network. IOCs are crucial for detecting, identifying, and responding to security incidents.",
      "distractor_analysis": "The distractors play on common misrememberings or substitutions of the key words &#39;Indicator&#39; and &#39;Compromise&#39;. &#39;Indicator of Concern&#39; uses a synonym that doesn&#39;t quite fit the technical meaning. &#39;Incident of Compromise&#39; confuses the &#39;Indicator&#39; (a sign) with the &#39;Incident&#39; itself. &#39;Information of Compromise&#39; is too broad and lacks the specific meaning of a detectable sign.",
      "analogy": "Think of an IOC like a symptom of an illness. A fever (IOC) indicates a potential infection (compromise), prompting further investigation."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "grep -r &#39;malicious_domain.com&#39; /var/log/\nfind / -name &#39;evil_file.exe&#39;",
        "context": "IOCs like malicious domains or file names can be used in command-line tools to search for signs of compromise on systems."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does XSS stand for in the context of cybersecurity?",
    "correct_answer": "Cross-site scripting",
    "distractors": [
      {
        "question_text": "Cross-system scripting",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; sounds plausible but &#39;site&#39; refers to web contexts where XSS is prevalent."
      },
      {
        "question_text": "Cross-service scripting",
        "misconception": "Targets word substitution: &#39;Service&#39; is a related concept but &#39;site&#39; specifically refers to the web application context."
      },
      {
        "question_text": "External-site scripting",
        "misconception": "Targets acronym letter confusion: &#39;E&#39; for External instead of &#39;X&#39; for Cross, which is a common mistake for non-standard acronyms."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XSS, or Cross-site scripting, is a type of security vulnerability typically found in web applications. It enables attackers to inject client-side scripts into web pages viewed by other users. This can be used to bypass access controls, impersonate users, or steal sensitive data.",
      "distractor_analysis": "The distractors use words that are semantically close or phonetically similar to &#39;site&#39; or &#39;cross&#39;, such as &#39;system&#39;, &#39;service&#39;, or &#39;external&#39;, to test precise recall of the acronym&#39;s expansion. These terms are plausible in a general computing context but incorrect for the specific XSS vulnerability.",
      "analogy": "Think of XSS like a malicious graffiti artist who sneaks into a public forum (a website) and paints a hidden message (malicious script) that everyone who visits the forum will unknowingly &#39;read&#39; and execute in their own browser."
    },
    "code_snippets": [
      {
        "language": "html",
        "code": "&lt;!-- Example of a simple XSS payload --&gt;\n&lt;script&gt;alert(&#39;You are hacked!&#39;);&lt;/script&gt;",
        "context": "An attacker might inject this script into a vulnerable web application, causing a pop-up on a victim&#39;s browser."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does XSS stand for in the context of web and application security?",
    "correct_answer": "Cross-Site Scripting",
    "distractors": [
      {
        "question_text": "Cross-System Scripting",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; sounds plausible but &#39;Site&#39; specifically refers to web domains or applications."
      },
      {
        "question_text": "XML Site Scripting",
        "misconception": "Targets acronym letter confusion: &#39;X&#39; is often associated with XML, but in XSS it&#39;s a stylistic choice for &#39;Cross&#39;."
      },
      {
        "question_text": "External System Security",
        "misconception": "Targets concept conflation: &#39;External System Security&#39; is a general security concern, but XSS is a specific type of injection attack."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XSS, or Cross-Site Scripting, is a type of security vulnerability typically found in web applications. XSS enables attackers to inject client-side scripts into web pages viewed by other users. An XSS vulnerability may be used by attackers to bypass access controls such as the same-origin policy.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Cross-System Scripting&#39; is close but misses the &#39;Site&#39; specificity. &#39;XML Site Scripting&#39; incorrectly links the &#39;X&#39; to XML. &#39;External System Security&#39; is a broad concept, not the specific attack type.",
      "analogy": "Think of XSS like a malicious graffiti artist who sneaks a hidden message onto a public billboard. When unsuspecting people view the billboard, they also &#39;read&#39; the hidden message, which can then trick them into doing something harmful, like revealing their secrets."
    },
    "code_snippets": [
      {
        "language": "html",
        "code": "&lt;script&gt;alert(&#39;You are hacked!&#39;);&lt;/script&gt;",
        "context": "A basic XSS payload injected into a web page, executing JavaScript in the victim&#39;s browser."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "WEB_BASICS"
    ]
  },
  {
    "question_text": "What does DTD stand for in the context of XML parsing and security?",
    "correct_answer": "Document Type Definition",
    "distractors": [
      {
        "question_text": "Data Type Definition",
        "misconception": "Targets word substitution: &#39;Data&#39; is a common term in computing, but &#39;Document&#39; is specific to XML structure definition."
      },
      {
        "question_text": "Document Type Descriptor",
        "misconception": "Targets similar-sounding terms: &#39;Descriptor&#39; sounds plausible for defining a document&#39;s type but is not the correct standard term."
      },
      {
        "question_text": "Dynamic Type Definition",
        "misconception": "Targets concept conflation: &#39;Dynamic&#39; implies runtime flexibility, which is not the primary characteristic of DTDs, which are static definitions."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DTD, or Document Type Definition, is a set of markup declarations that define the legal building blocks of an XML document. It defines the document structure with a list of legal elements and attributes. In the context of security, DTDs can define external entities, which, if not handled securely, can lead to XML External Entity (XXE) injection vulnerabilities.",
      "distractor_analysis": "The distractors test precise recall of the &#39;Document Type Definition&#39; expansion. &#39;Data Type Definition&#39; substitutes &#39;Document&#39; with &#39;Data&#39;, a common mistake. &#39;Document Type Descriptor&#39; uses a plausible but incorrect synonym for &#39;Definition&#39;. &#39;Dynamic Type Definition&#39; introduces a concept (dynamic) that is not relevant to the static nature of DTDs.",
      "analogy": "Think of a DTD as a blueprint or a schema for an XML document. It dictates what elements and attributes are allowed and how they should be structured, much like a grammar defines the rules for a language."
    },
    "code_snippets": [
      {
        "language": "xml",
        "code": "&lt;!DOCTYPE note [\n  &lt;!ELEMENT note (to,from,heading,body)&gt;\n  &lt;!ELEMENT to (#PCDATA)&gt;\n  &lt;!ELEMENT from (#PCDATA)&gt;\n  &lt;!ELEMENT heading (#PCDATA)&gt;\n  &lt;!ELEMENT body (#PCDATA)&gt;\n]&gt;",
        "context": "An example of a simple DTD defining the structure of a &#39;note&#39; XML document."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does XPath stand for in the context of XML processing and security?",
    "correct_answer": "XML Path Language",
    "distractors": [
      {
        "question_text": "XML Parsing and Hashing",
        "misconception": "Targets functional confusion: Hashing is a cryptographic operation, not directly related to path selection in XML."
      },
      {
        "question_text": "Extensible Path Language",
        "misconception": "Targets similar-sounding terms: &#39;Extensible&#39; is common in XML-related acronyms (like XML itself), but &#39;XML&#39; is the correct first word."
      },
      {
        "question_text": "XML Processing and Handling",
        "misconception": "Targets general processing terms: &#39;Processing and Handling&#39; are too generic and don&#39;t capture the &#39;Path&#39; aspect of the language."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XPath, or XML Path Language, is a query language for selecting nodes from an XML document. It is used to navigate through elements and attributes in an XML document, often for data extraction or manipulation. In a security context, unsanitized external input in XPath queries can lead to injection vulnerabilities, similar to SQL injection.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;XML Parsing and Hashing&#39; introduces an unrelated cryptographic concept. &#39;Extensible Path Language&#39; uses a plausible but incorrect first word, confusing it with other &#39;Extensible&#39; technologies. &#39;XML Processing and Handling&#39; is too broad and misses the specific &#39;Path&#39; aspect of the language&#39;s function.",
      "analogy": "Think of XPath as a GPS for your XML document. You give it a &#39;path&#39; (like /bookstore/book[1]/title) and it tells you exactly where to find that specific piece of information within the document."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "import xml.etree.ElementTree as ET\n\nroot = ET.fromstring(&#39;&lt;data&gt;&lt;item id=&quot;1&quot;&gt;Value1&lt;/item&gt;&lt;item id=&quot;2&quot;&gt;Value2&lt;/item&gt;&lt;/data&gt;&#39;)\n\n# Select all &#39;item&#39; elements\nitems = root.findall(&#39;.//item&#39;)\nfor item in items:\n    print(item.get(&#39;id&#39;))\n\n# XPath equivalent (conceptual, using lxml for actual XPath)\n# from lxml import etree\n# tree = etree.fromstring(&#39;&lt;data&gt;&lt;item id=&quot;1&quot;&gt;Value1&lt;/item&gt;&lt;item id=&quot;2&quot;&gt;Value2&lt;/item&gt;&lt;/data&gt;&#39;)\n# result = tree.xpath(&#39;//item/@id&#39;)",
        "context": "This Python example demonstrates how to select elements in an XML structure, conceptually similar to what XPath achieves. The commented lxml part shows actual XPath usage."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does MCM stand for in the context of mobile device security?",
    "correct_answer": "Mobile Content Management",
    "distractors": [
      {
        "question_text": "Mobile Configuration Management",
        "misconception": "Targets similar-sounding terms: Configuration is a common management term, but Content is specific to what MCM manages."
      },
      {
        "question_text": "Managed Content Management",
        "misconception": "Targets word substitution: &#39;Managed&#39; seems plausible as content is managed, but &#39;Mobile&#39; specifies the domain."
      },
      {
        "question_text": "Mobile Control Management",
        "misconception": "Targets synonym substitution: &#39;Control&#39; is a function of management, but &#39;Content&#39; is the specific object being managed."
      }
    ],
    "detailed_explanation": {
      "core_logic": "MCM, or Mobile Content Management, refers to systems and processes designed to control access to and distribution of company content on mobile devices. It ensures that sensitive data is securely delivered, stored, and accessed by authorized users on their mobile devices.",
      "distractor_analysis": "The distractors use words that are closely related to the concept of managing mobile devices or content (Configuration, Managed, Control) but do not form the precise, recognized acronym. This tests the exact recall of the acronym&#39;s expansion.",
      "analogy": "Think of MCM as a secure digital library for your company&#39;s mobile users, ensuring they can only access approved books (content) on their personal e-readers (mobile devices) and that those books are protected."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does the acronym XSRF stand for in the context of web application security?",
    "correct_answer": "Cross-Site Request Forgery",
    "distractors": [
      {
        "question_text": "Cross-Site Scripting Request Forgery",
        "misconception": "Targets conflation with XSS: Students might combine XSS and XSRF due to their similar names and web attack context."
      },
      {
        "question_text": "Cross-System Resource Forgery",
        "misconception": "Targets word substitution: &#39;System&#39; and &#39;Resource&#39; sound plausible but are incorrect, changing the attack&#39;s scope."
      },
      {
        "question_text": "Cross-Session Request Forgery",
        "misconception": "Targets similar-sounding terms: &#39;Session&#39; is related to web security but &#39;Site&#39; is the correct term for this attack type."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XSRF, or Cross-Site Request Forgery, is a type of malicious exploit of a website where unauthorized commands are transmitted from a user that the web application trusts. Unlike XSS, which exploits trust in a website to execute code on a user&#39;s machine, XSRF exploits the trust a website has in a user&#39;s browser to execute actions on the user&#39;s behalf.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Cross-Site Scripting Request Forgery&#39; incorrectly merges XSRF with XSS, a distinct attack. &#39;Cross-System Resource Forgery&#39; uses plausible but incorrect words (&#39;System&#39;, &#39;Resource&#39;) that alter the attack&#39;s fundamental nature. &#39;Cross-Session Request Forgery&#39; uses &#39;Session&#39; which is a related concept in web security but &#39;Site&#39; is the correct term for this specific attack.",
      "analogy": "Imagine you&#39;re logged into your bank. An XSRF attack is like someone tricking you into signing a blank check (by clicking a malicious link) that they then fill out to transfer money from your account, all while your bank still thinks it&#39;s you authorizing the transaction."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SNMP stand for in the context of network management and enumeration?",
    "correct_answer": "Simple Network Management Protocol",
    "distractors": [
      {
        "question_text": "Secure Network Management Protocol",
        "misconception": "Targets word substitution: &#39;Secure&#39; is a common security term, but &#39;Simple&#39; accurately reflects the protocol&#39;s design philosophy."
      },
      {
        "question_text": "System Network Monitoring Protocol",
        "misconception": "Targets word substitution and function confusion: &#39;Monitoring&#39; is related to SNMP&#39;s use, but &#39;Management&#39; is the core function, and &#39;System&#39; is less precise than &#39;Simple&#39;."
      },
      {
        "question_text": "Standard Network Messaging Protocol",
        "misconception": "Targets similar-sounding words: &#39;Standard&#39; and &#39;Messaging&#39; are plausible but incorrect, as the protocol is specifically for management."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SNMP, or Simple Network Management Protocol, is an application-layer protocol used for managing and monitoring network devices. It allows network administrators to monitor network performance, find and solve network problems, and plan for network growth.",
      "distractor_analysis": "The distractors play on common misinterpretations of the &#39;S&#39; and &#39;M&#39; in SNMP. &#39;Secure&#39; is a plausible but incorrect adjective, as SNMP has had security vulnerabilities, and its name refers to its design simplicity. &#39;Monitoring&#39; is a function of SNMP but not part of its name, and &#39;System&#39; is too generic. &#39;Standard&#39; and &#39;Messaging&#39; are also plausible but do not accurately reflect the protocol&#39;s full name or primary purpose.",
      "analogy": "Think of SNMP as a universal remote control for all your network devices. It uses a simple language to ask devices for their status or to change their settings."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "snmpwalk -v 2c -c public 192.168.1.100 1.3.6.1.2.1.1.1.0",
        "context": "An example of using &#39;snmpwalk&#39; to query a device for its system description using SNMPv2c and the &#39;public&#39; community string."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does HIDS stand for in the context of network security?",
    "correct_answer": "Host-based Intrusion Detection System",
    "distractors": [
      {
        "question_text": "Host Intrusion Detection System",
        "misconception": "Targets missing hyphenated term: Omitting &#39;based&#39; can lead to a less precise understanding of its deployment location."
      },
      {
        "question_text": "Hybrid Intrusion Detection System",
        "misconception": "Targets similar-sounding initialism: &#39;Hybrid&#39; is a common term in IT, but &#39;Host&#39; specifies the system&#39;s scope."
      },
      {
        "question_text": "Host-based Intrusion Defense System",
        "misconception": "Targets word substitution: &#39;Defense&#39; implies prevention, whereas &#39;Detection&#39; is the primary function of HIDS."
      }
    ],
    "detailed_explanation": {
      "core_logic": "HIDS refers to a security system deployed on individual hosts (servers, workstations) that monitors system calls, file system modifications, and other host-specific activities for suspicious patterns. Its primary function is to detect, not prevent, intrusions.",
      "distractor_analysis": "The distractors test precision in the acronym&#39;s expansion. &#39;Host Intrusion Detection System&#39; misses the &#39;based&#39; which clarifies its deployment. &#39;Hybrid Intrusion Detection System&#39; uses a plausible but incorrect word for &#39;H&#39;. &#39;Host-based Intrusion Defense System&#39; incorrectly substitutes &#39;Detection&#39; with &#39;Defense&#39;, confusing its role with an IPS (Intrusion Prevention System).",
      "analogy": "Think of HIDS as a security guard stationed inside a specific building, watching for unauthorized activity within that building, rather than at the perimeter."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of a HIDS rule (conceptual)\nALERT if file /etc/passwd is modified by non-root user\nALERT if more than 5 failed login attempts in 60 seconds",
        "context": "HIDS rules define patterns of suspicious activity to monitor on a host."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does INetSim stand for in the context of malware analysis?",
    "correct_answer": "Internet Services Simulation",
    "distractors": [
      {
        "question_text": "Internet Network Simulator",
        "misconception": "Targets word substitution: &#39;Network&#39; is a common term in this domain, but &#39;Services&#39; is the correct term for what INetSim simulates."
      },
      {
        "question_text": "Integrated Network Simulation",
        "misconception": "Targets initial letter confusion: &#39;Integrated&#39; starts with &#39;I&#39; and sounds plausible, but &#39;Internet&#39; is correct."
      },
      {
        "question_text": "Internal Network Services",
        "misconception": "Targets scope confusion: &#39;Internal&#39; implies a private network, but INetSim simulates public internet services."
      }
    ],
    "detailed_explanation": {
      "core_logic": "INetSim is a software suite designed to simulate common internet services (like HTTP, DNS, SMTP, etc.) for malware analysis. It allows analysts to observe malware&#39;s network behavior in a controlled environment without connecting to actual external servers, facilitating dynamic analysis and signature generation.",
      "distractor_analysis": "The distractors play on common misinterpretations of the &#39;I&#39; and &#39;S&#39; in INetSim. &#39;Internet Network Simulator&#39; incorrectly uses &#39;Network&#39; instead of &#39;Services&#39;. &#39;Integrated Network Simulation&#39; misinterprets the &#39;I&#39; and &#39;S&#39;. &#39;Internal Network Services&#39; incorrectly implies a private scope rather than public internet services.",
      "analogy": "Think of INetSim as a virtual puppet show for malware. Instead of letting the malware interact with the real internet, INetSim pretends to be all the internet services the malware expects, allowing you to see exactly what it tries to do without any real-world consequences."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sudo inetsim",
        "context": "Basic command to start the INetSim service on a Linux system, typically used in a malware analysis lab environment."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "MALWARE_ANALYSIS",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "In the context of malware analysis, what does IDA stand for?",
    "correct_answer": "Interactive Disassembler",
    "distractors": [
      {
        "question_text": "Integrated Disassembly Analyzer",
        "misconception": "Targets word substitution: &#39;Integrated&#39; and &#39;Analyzer&#39; are plausible but incorrect, as &#39;Interactive&#39; and &#39;Disassembler&#39; are the precise terms."
      },
      {
        "question_text": "Instruction Decoding Assistant",
        "misconception": "Targets functional description as expansion: This describes what a disassembler does, but is not the exact acronym expansion."
      },
      {
        "question_text": "Intelligent Debugging Application",
        "misconception": "Targets similar-sounding terms and related functionality: &#39;Intelligent&#39; and &#39;Debugging&#39; are related to analysis tools but are not part of IDA&#39;s name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IDA Pro is a widely used commercial disassembler for reverse engineering software, particularly malware. It translates machine code into assembly language, making it human-readable and interactive for analysis.",
      "distractor_analysis": "The distractors play on common misunderstandings of the tool&#39;s name. &#39;Integrated Disassembly Analyzer&#39; uses similar words but changes the core meaning. &#39;Instruction Decoding Assistant&#39; describes the tool&#39;s function rather than its name. &#39;Intelligent Debugging Application&#39; uses terms related to the field but not the specific acronym.",
      "analogy": "IDA is like a universal translator for computer programs, taking the machine&#39;s language and converting it into a language humans can understand and interact with, allowing us to see how the program truly works."
    },
    "code_snippets": [
      {
        "language": "assembly",
        "code": "00401248 loc_401248\n00401248 mov [ebp+var_C], 0\n0040124F jmp short loc_40125A",
        "context": "IDA Pro displays machine code in assembly language, as shown in this snippet from the provided text, allowing analysts to understand program flow."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "MALWARE_ANALYSIS",
      "REVERSE_ENGINEERING"
    ]
  },
  {
    "question_text": "In the context of reverse engineering, what does CALL refer to?",
    "correct_answer": "A machine instruction used to invoke a function or subroutine",
    "distractors": [
      {
        "question_text": "A command to allocate memory on the heap",
        "misconception": "Targets functional confusion: CALL is for control flow, not memory management, though memory allocation might occur within a called function."
      },
      {
        "question_text": "A system call to the operating system kernel",
        "misconception": "Targets scope confusion: While a function invoked by CALL might make a system call, CALL itself is a CPU instruction for local control transfer, not directly a system call."
      },
      {
        "question_text": "A data structure used for function arguments",
        "misconception": "Targets type confusion: CALL is an instruction, not a data structure, though it interacts with the stack for arguments and return addresses."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In assembly language and machine code, a CALL instruction is a fundamental control flow mechanism. It pushes the address of the instruction immediately following the CALL onto the stack (the return address) and then transfers control to the specified target address, which is typically the entry point of a function or subroutine. This allows the program to execute a block of code and then return to the original execution path.",
      "distractor_analysis": "The distractors present plausible but incorrect functions or interpretations. &#39;A command to allocate memory on the heap&#39; confuses CALL with memory management functions (like malloc/new). &#39;A system call to the operating system kernel&#39; conflates a general CPU instruction with a specific type of privileged function call. &#39;A data structure used for function arguments&#39; misidentifies CALL as a data structure rather than an instruction, despite its role in managing function arguments via the stack.",
      "analogy": "Think of CALL like pressing a &#39;Go to Sub-Task&#39; button on a complex machine. The machine remembers where it was (the return address), goes to perform the sub-task, and then comes back to continue its main operation."
    },
    "code_snippets": [
      {
        "language": "assembly",
        "code": "MOV EAX, 10\nCALL MyFunction\nADD EBX, EAX\n\nMyFunction:\n  PUSH EBP\n  MOV EBP, ESP\n  ; Function body\n  POP EBP\n  RET",
        "context": "Example of a CALL instruction in x86 assembly, invoking &#39;MyFunction&#39; and then returning to the instruction after CALL."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "RE_BASICS",
      "ASSEMBLY_X86"
    ]
  },
  {
    "question_text": "In the context of program analysis and reverse engineering, what does the acronym &#39;APT&#39; stand for?",
    "correct_answer": "Advanced Persistent Threat",
    "distractors": [
      {
        "question_text": "Advanced Program Technique",
        "misconception": "Targets domain confusion: &#39;Program Technique&#39; sounds plausible in a reverse engineering context but is not the correct security term."
      },
      {
        "question_text": "Automated Persistent Threat",
        "misconception": "Targets word substitution: &#39;Automated&#39; is a common term in security but &#39;Advanced&#39; is the correct descriptor for this type of threat."
      },
      {
        "question_text": "Active Persistent Threat",
        "misconception": "Targets similar-sounding words: &#39;Active&#39; is close to &#39;Advanced&#39; but lacks the specific nuance of sophistication implied by &#39;Advanced&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "APT (Advanced Persistent Threat) refers to a stealthy and continuous computer hacking process, often orchestrated by a nation-state or state-sponsored group, targeting a specific entity. It is characterized by its advanced techniques, persistence in maintaining access, and focus on specific objectives rather than opportunistic attacks.",
      "distractor_analysis": "The distractors are designed to test precise recall of the &#39;Advanced&#39; and &#39;Threat&#39; components. &#39;Advanced Program Technique&#39; attempts to tie it to the document&#39;s theme of reverse engineering, but APT is a threat actor classification. &#39;Automated&#39; and &#39;Active&#39; are plausible but incorrect adjectives for &#39;Persistent Threat&#39;, aiming to catch those who don&#39;t recall the exact first word.",
      "analogy": "Think of an APT as a highly skilled, patient, and well-funded spy agency trying to infiltrate a specific target, rather than a common burglar trying to break into any house."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "FRAMEWORK_MITRE"
    ]
  },
  {
    "question_text": "What does MBR stand for in the context of boot processes and malware analysis?",
    "correct_answer": "Master Boot Record",
    "distractors": [
      {
        "question_text": "Main Boot Routine",
        "misconception": "Targets similar-sounding terms: &#39;Main&#39; and &#39;Routine&#39; are plausible but incorrect substitutions for &#39;Master&#39; and &#39;Record&#39;."
      },
      {
        "question_text": "Memory Boot Region",
        "misconception": "Targets concept confusion: &#39;Memory&#39; and &#39;Region&#39; relate to system architecture but do not accurately describe the MBR&#39;s function."
      },
      {
        "question_text": "Malicious Boot Record",
        "misconception": "Targets functional association: While MBRs can be malicious, the acronym itself describes the legitimate system component, not its potential compromise."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Master Boot Record (MBR) is a special type of boot sector at the very beginning of partitioned computer storage devices like hard disks. It holds the boot loader for the installed operating system and information about the disk&#39;s logical partitions. It&#39;s a critical component targeted by bootkits.",
      "distractor_analysis": "The distractors play on common misunderstandings or associations. &#39;Main Boot Routine&#39; sounds functionally similar but uses incorrect terminology. &#39;Memory Boot Region&#39; conflates the MBR&#39;s location with general memory concepts. &#39;Malicious Boot Record&#39; describes a potential state or type of MBR, not the fundamental component itself, which is a common confusion point in malware analysis.",
      "analogy": "Think of the MBR as the table of contents and the first page of instructions for a book. It tells the computer where to find the operating system and how to start reading it. If this &#39;table of contents&#39; is tampered with, the computer won&#39;t know how to boot correctly."
    },
    "code_snippets": [
      {
        "language": "assembly",
        "code": "ORG 0x7C00\n\nxor ax, ax\nmov ss, ax\nmov sp, 0x7C00\n\n; MBR code typically starts here",
        "context": "This assembly snippet shows the typical starting address (0x7C00) and initial instructions for an MBR, as referenced in the Bochs debugger output."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does DAST stand for in the context of application security testing?",
    "correct_answer": "Dynamic Application Security Testing",
    "distractors": [
      {
        "question_text": "Distributed Application Security Testing",
        "misconception": "Targets similar-sounding terms: &#39;Distributed&#39; is a common term in computing but not the correct &#39;D&#39; for DAST, which focuses on runtime analysis."
      },
      {
        "question_text": "Deep Application Security Testing",
        "misconception": "Targets descriptive but incorrect terms: &#39;Deep&#39; might seem appropriate for thorough analysis but is not the official expansion of DAST."
      },
      {
        "question_text": "Dynamic Application System Testing",
        "misconception": "Targets word substitution: &#39;System&#39; is related to applications but &#39;Security&#39; is the critical component being tested in DAST."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DAST (Dynamic Application Security Testing) is a black-box testing method that analyzes an application while it is running to find vulnerabilities. It simulates real-world attacks to identify security weaknesses that might be exploited by malicious actors.",
      "distractor_analysis": "The distractors play on common misinterpretations of the &#39;D&#39; and &#39;S&#39; in DAST. &#39;Distributed&#39; and &#39;Deep&#39; are plausible but incorrect adjectives for &#39;Dynamic&#39;. &#39;System&#39; replaces &#39;Security&#39;, which fundamentally changes the purpose of the testing from security to general system functionality.",
      "analogy": "DAST is like a penetration tester actively trying to break into a running application from the outside, without access to its internal code, to see how it behaves under attack."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example DAST tool command (conceptual)\nnikto -h https://example.com",
        "context": "DAST tools often operate by sending various requests to a running web application to probe for vulnerabilities, similar to how an attacker would."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does PE stand for in the context of executable files in Windows operating systems?",
    "correct_answer": "Portable Executable",
    "distractors": [
      {
        "question_text": "Program Executable",
        "misconception": "Targets common sense substitution: &#39;Program&#39; seems logical for an executable file, but &#39;Portable&#39; refers to its structure."
      },
      {
        "question_text": "Process Environment",
        "misconception": "Targets similar-sounding acronyms/terms: &#39;Process Environment Block&#39; (PEB) is a related memory forensics concept, causing confusion."
      },
      {
        "question_text": "Primary Executable",
        "misconception": "Targets word substitution: &#39;Primary&#39; implies importance but is not part of the official expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PE stands for Portable Executable. It is a file format for executables, object code, DLLs, and font files used in 32-bit and 64-bit versions of Windows operating systems. The &#39;Portable&#39; aspect refers to its structure, which allows it to be executed across different versions of Windows.",
      "distractor_analysis": "The distractors are designed to catch those who have a general idea of what PE files are but don&#39;t know the precise expansion. &#39;Program Executable&#39; is a plausible guess. &#39;Process Environment&#39; attempts to confuse with the related &#39;Process Environment Block&#39; (PEB) which is also relevant in memory forensics. &#39;Primary Executable&#39; is a plausible but incorrect adjective.",
      "analogy": "Think of PE as the &#39;blueprint&#39; for how Windows applications are built and run. Just like a portable house can be moved and set up in different locations, a Portable Executable file can run on different Windows systems because of its standardized structure."
    },
    "code_snippets": [
      {
        "language": "powershell",
        "code": "$pe_file = Get-Item &#39;C:\\Windows\\System32\\notepad.exe&#39;\n$pe_file.Length",
        "context": "In PowerShell, you can interact with PE files like any other file, though specialized tools are needed for parsing their internal structure."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "OS_WINDOWS",
      "MALWARE_ANALYSIS"
    ]
  },
  {
    "question_text": "In the context of software security assessment, what does SAST stand for?",
    "correct_answer": "Static Application Security Testing",
    "distractors": [
      {
        "question_text": "Systematic Application Security Testing",
        "misconception": "Targets word substitution: &#39;Systematic&#39; sounds plausible as security testing should be systematic, but &#39;Static&#39; refers to the method of analysis."
      },
      {
        "question_text": "Software Application Security Testing",
        "misconception": "Targets redundancy/misdirection: &#39;Software&#39; is implied by &#39;Application&#39; and doesn&#39;t add specific meaning to the &#39;S&#39; in SAST, which refers to the analysis type."
      },
      {
        "question_text": "Static Analysis Security Tool",
        "misconception": "Targets functional vs. process confusion: While SAST often involves tools, the acronym describes the testing methodology (&#39;Testing&#39;) rather than just the tool itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SAST refers to Static Application Security Testing, a method of analyzing an application&#39;s source code, bytecode, or binary code without actually executing it. It&#39;s used to find security vulnerabilities early in the software development lifecycle.",
      "distractor_analysis": "The distractors are designed to test the precise meaning of each word in SAST. &#39;Systematic&#39; is a general quality of good testing, not the specific &#39;S&#39;. &#39;Software&#39; is redundant with &#39;Application&#39;. &#39;Tool&#39; describes an instrument, whereas &#39;Testing&#39; describes the process.",
      "analogy": "SAST is like a spell-checker for code; it examines the text (code) for potential errors (vulnerabilities) without running the program."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sast_tool scan --source-code /app/src --output-format sarif",
        "context": "Command-line execution of a hypothetical SAST tool scanning source code."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does AppID stand for in the context of COM applications?",
    "correct_answer": "Application ID",
    "distractors": [
      {
        "question_text": "Application Identifier",
        "misconception": "Targets synonym substitution: &#39;Identifier&#39; is a common synonym for &#39;ID&#39; but the precise expansion uses &#39;ID&#39;."
      },
      {
        "question_text": "Application Interface Definition",
        "misconception": "Targets similar-sounding terms: &#39;Interface Definition&#39; relates to application structure but is not the correct expansion for AppID."
      },
      {
        "question_text": "Application Instance Descriptor",
        "misconception": "Targets plausible but incorrect technical term: &#39;Instance Descriptor&#39; sounds like a valid technical concept but is not what AppID stands for."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In Component Object Model (COM) technology, an AppID, or Application ID, is a unique identifier assigned to a collection of COM objects, referred to as a COM application or component. It is used by the operating system to manage security settings and other properties for that specific application.",
      "distractor_analysis": "The distractors test the precision of recall. &#39;Application Identifier&#39; is a very close synonym but not the exact expansion. &#39;Application Interface Definition&#39; and &#39;Application Instance Descriptor&#39; are plausible-sounding technical terms that could be confused with an identifier for an application.",
      "analogy": "Think of an AppID like a unique serial number for a specific software application on your computer, allowing the system to track and apply specific rules to it."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "reg query HKLM\\SOFTWARE\\Classes\\AppId /s",
        "context": "Command to query the Windows Registry for all registered AppIDs, demonstrating their storage location."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "OS_WINDOWS"
    ]
  },
  {
    "question_text": "What does MASPT stand for in the context of cybersecurity certifications?",
    "correct_answer": "Mobile Application Security and Penetration Testing",
    "distractors": [
      {
        "question_text": "Mobile Application Security and Penetration Tools",
        "misconception": "Targets word substitution: &#39;Tools&#39; is a common concept in pentesting, but &#39;Testing&#39; is the correct term for the certification&#39;s focus."
      },
      {
        "question_text": "Mobile Advanced Security and Penetration Testing",
        "misconception": "Targets letter confusion: &#39;Advanced&#39; starts with &#39;A&#39; and sounds plausible for a security certification, but &#39;Application&#39; is correct."
      },
      {
        "question_text": "Managed Application Security and Penetration Testing",
        "misconception": "Targets similar-sounding terms: &#39;Managed&#39; is a common term in IT services, but &#39;Mobile&#39; is the specific domain of this certification."
      }
    ],
    "detailed_explanation": {
      "core_logic": "MASPT specifically refers to &#39;Mobile Application Security and Penetration Testing,&#39; a certification focused on the security assessment of mobile applications. The full expansion clearly defines its scope.",
      "distractor_analysis": "Distractors replace key words with plausible but incorrect alternatives. &#39;Tools&#39; instead of &#39;Testing&#39; changes the focus from the act of assessment to the instruments. &#39;Advanced&#39; instead of &#39;Application&#39; misidentifies the &#39;A&#39; in the acronym. &#39;Managed&#39; instead of &#39;Mobile&#39; shifts the domain from mobile devices to a service delivery model.",
      "analogy": "Think of MASPT as a specialized driving test for mobile apps. It&#39;s not just about general driving (security), but specifically how well you can drive a mobile app securely (application security) and find its weaknesses (penetration testing)."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does GIAC stand for in the context of cybersecurity certifications?",
    "correct_answer": "Global Information Assurance Certification",
    "distractors": [
      {
        "question_text": "Global Information Access Certification",
        "misconception": "Targets word substitution: &#39;Access&#39; is a common security term but incorrect here; &#39;Assurance&#39; refers to the confidence in security measures."
      },
      {
        "question_text": "Government Information Assurance Certification",
        "misconception": "Targets scope confusion: &#39;Government&#39; is a plausible but incorrect modifier, as GIAC is a global, not government-specific, entity."
      },
      {
        "question_text": "General Information Assurance Certification",
        "misconception": "Targets word substitution: &#39;General&#39; is a common adjective but &#39;Global&#39; correctly identifies the worldwide scope of the certification body."
      }
    ],
    "detailed_explanation": {
      "core_logic": "GIAC, or Global Information Assurance Certification, is a certification body that provides a wide range of information security certifications. These certifications validate practical skills in various cybersecurity domains, including penetration testing, incident response, and forensics.",
      "distractor_analysis": "The distractors test precise recall of the &#39;G&#39; and &#39;A&#39; in GIAC. Substituting &#39;Assurance&#39; with &#39;Access&#39; or &#39;General&#39; changes the fundamental meaning of the certification&#39;s focus. Replacing &#39;Global&#39; with &#39;Government&#39; incorrectly narrows the scope of the organization.",
      "analogy": "Think of GIAC as a global standards body for cybersecurity skills, much like ISO sets global standards for quality management. Their certifications assure employers of a candidate&#39;s practical knowledge."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does XSRF stand for in the context of web application security?",
    "correct_answer": "Cross-Site Request Forgery",
    "distractors": [
      {
        "question_text": "Cross-Site Resource Forgery",
        "misconception": "Targets word substitution: &#39;Resource&#39; is a common web term but &#39;Request&#39; is specific to this attack type."
      },
      {
        "question_text": "Cross-Site Remote Forgery",
        "misconception": "Targets similar-sounding terms: &#39;Remote&#39; sounds plausible for an attack but &#39;Request&#39; is the correct action being forged."
      },
      {
        "question_text": "Cross-Service Request Forgery",
        "misconception": "Targets scope confusion: &#39;Service&#39; is broader than &#39;Site&#39; and doesn&#39;t accurately reflect the browser-based nature of the attack."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XSRF, or Cross-Site Request Forgery, is a web security vulnerability that allows an attacker to induce authenticated users to perform actions on a web application without their explicit consent. It exploits the trust a web application has in a user&#39;s browser.",
      "distractor_analysis": "The distractors replace &#39;Request&#39; with other plausible-sounding words like &#39;Resource&#39; or &#39;Remote&#39;, or substitute &#39;Site&#39; with &#39;Service&#39;, which are related to web concepts but do not precisely describe the nature of the attack where a legitimate HTTP request is forged.",
      "analogy": "Imagine you&#39;re logged into your bank. An attacker tricks you into clicking a link on another site. If the bank&#39;s website isn&#39;t protected against XSRF, that link could make your browser send a request to your bank to transfer money, and the bank would think it&#39;s a legitimate request from you because you&#39;re logged in."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT",
      "WEB_VULN"
    ]
  },
  {
    "question_text": "What does ECMAScript stand for?",
    "correct_answer": "European Computer Manufacturers Association Script",
    "distractors": [
      {
        "question_text": "Extended Computer Markup Association Script",
        "misconception": "Targets word substitution: &#39;Extended&#39; and &#39;Markup&#39; are common terms in web development but incorrect here."
      },
      {
        "question_text": "Electronic Computer Management Association Script",
        "misconception": "Targets word substitution: &#39;Electronic&#39; and &#39;Management&#39; are plausible but incorrect, confusing the &#39;ECMA&#39; part."
      },
      {
        "question_text": "European Common Market Association Script",
        "misconception": "Targets domain confusion: &#39;Common Market&#39; relates to economics, not computer standards, despite &#39;European&#39; being correct."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ECMAScript is a trademarked name for the JavaScript language standard. It is standardized by Ecma International, an industry association for standardizing information and communication systems. The name reflects its origin from the European Computer Manufacturers Association.",
      "distractor_analysis": "Distractors replace key words in the expansion with plausible but incorrect terms that might be associated with computing or European entities, testing precise recall of the standardization body&#39;s name.",
      "analogy": "ECMAScript is to JavaScript what a blueprint is to a house. It&#39;s the standard specification that different implementations (like JavaScript engines in browsers) must follow."
    },
    "code_snippets": [
      {
        "language": "javascript",
        "code": "// ECMAScript 2015 (ES6) feature: Arrow function\nconst add = (a, b) =&gt; a + b;\n\n// ECMAScript 2015 (ES6) feature: Template literals\nconst name = &#39;World&#39;;\nconsole.log(`Hello, ${name}!`);",
        "context": "ECMAScript defines the syntax and semantics of JavaScript, introducing new features in each edition."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "WEB_BASICS",
      "PROGRAMMING_CONCEPTS"
    ]
  },
  {
    "question_text": "What does XUL stand for in the context of web technologies?",
    "correct_answer": "XML User Interface Language",
    "distractors": [
      {
        "question_text": "Extensible User Interface Language",
        "misconception": "Targets similar-sounding terms: &#39;Extensible&#39; is a common prefix for XML-related technologies, leading to confusion with &#39;XML&#39; itself."
      },
      {
        "question_text": "XML Universal Interface Language",
        "misconception": "Targets word substitution: &#39;Universal&#39; sounds plausible for a general-purpose language but is incorrect."
      },
      {
        "question_text": "XML User Interaction Language",
        "misconception": "Targets word substitution: &#39;Interaction&#39; is closely related to &#39;Interface&#39; and could be mistaken for the correct term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "XUL, or XML User Interface Language, is a markup language developed by Mozilla for creating graphical user interfaces, particularly for browser-based applications like Firefox itself. It leverages XML syntax to define UI elements.",
      "distractor_analysis": "The distractors play on common misinterpretations of XML-related acronyms. &#39;Extensible&#39; is a frequent association with XML, &#39;Universal&#39; suggests broad applicability, and &#39;Interaction&#39; is a synonym for &#39;Interface&#39;, all designed to mislead those with partial knowledge.",
      "analogy": "Think of XUL as a specialized blueprint language for building the dashboard and controls of a web browser, whereas HTML is more like a blueprint for the content displayed within that browser."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "WEB_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does ASP stand for in the context of web application hosting?",
    "correct_answer": "Application Service Provider",
    "distractors": [
      {
        "question_text": "Active Server Pages",
        "misconception": "Targets technology confusion: Active Server Pages is a related web technology but not the hosting model itself."
      },
      {
        "question_text": "Application Security Protocol",
        "misconception": "Targets domain confusion: Protocol implies a communication standard, not a service provider model."
      },
      {
        "question_text": "Automated Service Platform",
        "misconception": "Targets similar-sounding terms: Automated and Platform sound plausible but miss the &#39;Provider&#39; aspect of the service model."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Application Service Provider (ASP) is a business that provides computer-based services to customers over a network, typically the internet. In the context of web applications, an ASP hosts and manages applications for multiple customers, often in a shared environment.",
      "distractor_analysis": "The distractors target common confusions: &#39;Active Server Pages&#39; is a Microsoft web development technology often associated with web applications, but it&#39;s not the service model. &#39;Application Security Protocol&#39; sounds like a security-related term but is not the correct expansion. &#39;Automated Service Platform&#39; uses plausible words but misrepresents the &#39;Provider&#39; aspect of the business model.",
      "analogy": "Think of an ASP like a landlord who provides apartments (applications) to multiple tenants (customers) in a single building (shared environment)."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does ZAP stand for in the context of web application security testing?",
    "correct_answer": "Zed Attack Proxy",
    "distractors": [
      {
        "question_text": "Zero-day Attack Prevention",
        "misconception": "Targets similar-sounding security concepts: Prevention is a common security goal, but ZAP is a proxy tool, not primarily a prevention system."
      },
      {
        "question_text": "Zone Access Protocol",
        "misconception": "Targets network protocol confusion: ZAP is an application-layer tool, not a network protocol, and &#39;Zone Access&#39; is a plausible but incorrect term."
      },
      {
        "question_text": "Zonal Application Proxy",
        "misconception": "Targets word substitution: &#39;Zonal&#39; sounds similar to &#39;Zed&#39; and &#39;Application Proxy&#39; is close to the tool&#39;s function, but misses the specific name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ZAP, or Zed Attack Proxy, is a free and open-source web application security scanner. It is one of the most popular tools used for finding vulnerabilities in web applications during penetration testing. It functions as an intercepting proxy, allowing users to inspect and modify traffic between their browser and the web application.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Zero-day Attack Prevention&#39; sounds like a security function but is not the name of the tool. &#39;Zone Access Protocol&#39; incorrectly identifies ZAP as a network protocol. &#39;Zonal Application Proxy&#39; is close in function but uses an incorrect first word, testing the exact naming convention.",
      "analogy": "Think of ZAP as a detective&#39;s magnifying glass and notepad for web traffic. It lets you see exactly what&#39;s happening between your browser and a website, and even lets you change things on the fly to see how the website reacts."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "docker run -p 8080:8080 -i owasp/zap2docker-stable zap.sh -daemon -port 8080 -host 0.0.0.0 -config api.disablekey=true",
        "context": "Example command to run OWASP ZAP as a daemon in a Docker container, often used for automated scanning."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does SOAP stand for in the context of web application vulnerabilities?",
    "correct_answer": "Simple Object Access Protocol",
    "distractors": [
      {
        "question_text": "Secure Object Access Protocol",
        "misconception": "Targets word substitution: &#39;Secure&#39; is a common security term, making it a plausible but incorrect replacement for &#39;Simple&#39;."
      },
      {
        "question_text": "Standard Object Access Protocol",
        "misconception": "Targets word substitution: &#39;Standard&#39; implies a widely adopted protocol, which SOAP is, but it&#39;s not the correct first word."
      },
      {
        "question_text": "Service-Oriented Access Protocol",
        "misconception": "Targets concept conflation: SOAP is used in Service-Oriented Architectures, leading to confusion with the &#39;Service-Oriented&#39; term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SOAP, or Simple Object Access Protocol, is a messaging protocol specification for exchanging structured information in the implementation of web services. It relies on XML for its message format and usually relies on other application layer protocols, most notably HTTP or SMTP, for message negotiation and transmission. SOAP injection vulnerabilities arise when an attacker can manipulate the XML structure of a SOAP message.",
      "distractor_analysis": "The distractors play on common associations with web protocols and security. &#39;Secure&#39; is a natural fit for a security context, &#39;Standard&#39; reflects SOAP&#39;s widespread use, and &#39;Service-Oriented&#39; directly relates to the architectural style where SOAP is often employed. However, none of these accurately reflect the &#39;Simple&#39; in its official expansion.",
      "analogy": "Think of SOAP as a specific type of envelope and letter format (XML) used to send instructions between different computer programs over the internet. &#39;Simple&#39; refers to its original design goal of being straightforward for data exchange, even though its implementation can be complex."
    },
    "code_snippets": [
      {
        "language": "xml",
        "code": "&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:web=&quot;http://www.example.com/webservice&quot;&gt;\n   &lt;soapenv:Header/&gt;\n   &lt;soapenv:Body&gt;\n      &lt;web:getUserDetails&gt;\n         &lt;web:userId&gt;123&lt;/web:userId&gt;\n      &lt;/web:getUserDetails&gt;\n   &lt;/soapenv:Body&gt;\n&lt;/soapenv:Envelope&gt;",
        "context": "A basic SOAP message structure for requesting user details. Injection attacks would modify elements like &#39;userId&#39;."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does SSDL stand for in the context of secure software development?",
    "correct_answer": "Secure Software Development Life Cycle",
    "distractors": [
      {
        "question_text": "Secure Software Design Life Cycle",
        "misconception": "Targets word substitution: Design is a phase within development, but &#39;Development&#39; encompasses the entire process."
      },
      {
        "question_text": "Standard Software Development Life Cycle",
        "misconception": "Targets initial letter confusion: &#39;S&#39; stands for Secure, not Standard, which is a critical distinction in security contexts."
      },
      {
        "question_text": "System Software Development Life Cycle",
        "misconception": "Targets scope confusion: &#39;System&#39; is too broad; SSDL specifically refers to &#39;Software&#39; development."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SSDL, or Secure Software Development Life Cycle, integrates security practices into every phase of software development, from design and requirements gathering to testing, deployment, and maintenance. Its goal is to identify and mitigate security vulnerabilities early in the development process, reducing the cost and risk associated with fixing them later.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Design&#39; is a component but not the full &#39;Development&#39;. &#39;Standard&#39; misses the crucial &#39;Secure&#39; aspect. &#39;System&#39; is a broader term that doesn&#39;t specifically refer to &#39;Software&#39; in this context.",
      "analogy": "Think of SSDL like building a house with security in mind from the ground up: instead of adding locks and alarms after it&#39;s built, you design secure foundations, walls, and windows from the start."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "procedure",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does CORS stand for in web application security?",
    "correct_answer": "Cross-Origin Resource Sharing",
    "distractors": [
      {
        "question_text": "Cross-Origin Request Security",
        "misconception": "Targets word substitution: &#39;Security&#39; is a related concept but &#39;Sharing&#39; is the correct term for how resources are handled."
      },
      {
        "question_text": "Content-Origin Resource Sharing",
        "misconception": "Targets similar-sounding terms: &#39;Content-Origin&#39; sounds plausible but &#39;Cross-Origin&#39; correctly describes the interaction between different origins."
      },
      {
        "question_text": "Client-Origin Resource Sharing",
        "misconception": "Targets acronym letter confusion: &#39;Client&#39; is a common term in web development, but &#39;Cross&#39; is the correct &#39;C&#39; in this context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CORS, or Cross-Origin Resource Sharing, is a browser-implemented security mechanism that allows web applications running at one origin to access selected resources from a different origin. It&#39;s a crucial part of web security, working in conjunction with the Same-Origin Policy (SOP) to prevent unauthorized cross-origin requests while enabling legitimate ones.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Request Security&#39; substitutes &#39;Sharing&#39; with a related but incorrect concept. &#39;Content-Origin&#39; and &#39;Client-Origin&#39; replace &#39;Cross-Origin&#39; with plausible but incorrect terms, targeting confusion around the &#39;C&#39; in CORS.",
      "analogy": "Think of CORS as a bouncer at a club (your web browser). By default, only people from the same party (same origin) are allowed to interact. CORS is the special guest list that lets specific people from other parties (different origins) in, but only if they&#39;re on the list and follow certain rules."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "curl -v -H &quot;Origin: http://example.com&quot; http://api.example.org/data",
        "context": "Example of a cURL request with an &#39;Origin&#39; header, simulating a cross-origin request that a browser would send."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "In the context of secure software development, what does SDLC stand for?",
    "correct_answer": "Software Development Life Cycle",
    "distractors": [
      {
        "question_text": "Secure Development Life Cycle",
        "misconception": "Targets word substitution: &#39;Secure&#39; is a related concept but &#39;Software&#39; is the correct term for the overall process."
      },
      {
        "question_text": "System Development Life Cycle",
        "misconception": "Targets scope confusion: &#39;System&#39; is broader and can refer to hardware, but SDLC specifically refers to software."
      },
      {
        "question_text": "Software Design Life Cycle",
        "misconception": "Targets process stage confusion: &#39;Design&#39; is a stage within the life cycle, not the name of the entire cycle itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Software Development Life Cycle (SDLC) is a structured process that outlines the stages involved in developing, deploying, and maintaining software. It typically includes planning, analysis, design, implementation, testing, and maintenance phases. Integrating security practices throughout the SDLC is crucial for building secure applications.",
      "distractor_analysis": "Distractors target common misunderstandings: substituting &#39;Software&#39; with &#39;Secure&#39; (a desired outcome, not the name), &#39;System&#39; (a broader term), or &#39;Design&#39; (a specific phase within the cycle).",
      "analogy": "Think of SDLC like building a house: it&#39;s the entire process from drawing blueprints (design) to laying bricks (implementation) to final inspection (testing) and ongoing repairs (maintenance)."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "In the context of web application security, what does SAST stand for?",
    "correct_answer": "Static Application Security Testing",
    "distractors": [
      {
        "question_text": "Systematic Application Security Testing",
        "misconception": "Targets word substitution: &#39;Systematic&#39; sounds plausible but &#39;Static&#39; refers to the analysis method without running the code."
      },
      {
        "question_text": "Software Application Security Testing",
        "misconception": "Targets scope confusion: &#39;Software&#39; is too broad; &#39;Static&#39; specifies the type of analysis performed on the application code."
      },
      {
        "question_text": "Static Analysis Security Tool",
        "misconception": "Targets term substitution: &#39;Tool&#39; is a component, but &#39;Testing&#39; describes the overall process and methodology."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SAST, or Static Application Security Testing, is a white-box testing method that analyzes an application&#39;s source code, bytecode, or binary code for security vulnerabilities without actually executing the application. It&#39;s performed early in the Software Development Life Cycle (SDLC).",
      "distractor_analysis": "Distractors play on common misunderstandings of the &#39;S&#39; in SAST, substituting &#39;Static&#39; with similar-sounding or related but incorrect terms like &#39;Systematic&#39; or &#39;Software&#39;. Another distractor confuses &#39;Testing&#39; with &#39;Tool&#39;, which is a common misinterpretation of the acronym&#39;s scope.",
      "analogy": "SAST is like a spell-checker for your code&#39;s security. It scans the text (code) for errors without needing to run the program, catching potential issues early."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sast_tool scan --project-path ./my_webapp --output-format sarif",
        "context": "Example command-line usage for a SAST tool to scan a web application project."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "defense",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "SDLC_SEC"
    ]
  },
  {
    "question_text": "What does SOQL stand for in the context of database query languages?",
    "correct_answer": "Salesforce Object Query Language",
    "distractors": [
      {
        "question_text": "Standard Object Query Language",
        "misconception": "Targets term substitution: &#39;Standard&#39; is a common prefix for query languages (e.g., SQL) but incorrect here."
      },
      {
        "question_text": "Secure Object Query Language",
        "misconception": "Targets keyword association: &#39;Secure&#39; is a common cybersecurity term, leading to plausible but incorrect substitution."
      },
      {
        "question_text": "System Object Query Language",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; is a general computing term that could be confused with &#39;Salesforce&#39; in a database context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SOQL is a proprietary query language developed by Salesforce.com for querying data stored in the Salesforce platform. It is similar to SQL but specifically designed for the Salesforce object model.",
      "distractor_analysis": "The distractors replace &#39;Salesforce&#39; with other plausible-sounding words like &#39;Standard&#39;, &#39;Secure&#39;, or &#39;System&#39;, which are common in technology but do not accurately represent the specific origin and context of SOQL.",
      "analogy": "Think of SOQL as the &#39;Salesforce dialect&#39; of SQL. Just as different regions have their own dialects, different platforms (like Salesforce) have their own query languages tailored to their specific data structures."
    },
    "code_snippets": [
      {
        "language": "java",
        "code": "List&lt;Account&gt; accounts = [SELECT Id, Name FROM Account WHERE Industry = &#39;Technology&#39;];",
        "context": "Example of a SOQL query embedded in Apex (Salesforce&#39;s proprietary programming language) to retrieve Account records."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  }
]