[
  {
    "question_text": "In theoretical computer science, what does NP stand for?",
    "correct_answer": "Nondeterministic Polynomial time",
    "distractors": [
      {
        "question_text": "Non-Probabilistic Polynomial time",
        "misconception": "Targets similar-sounding terms: &#39;Non-Probabilistic&#39; sounds related to &#39;Nondeterministic&#39; but is incorrect in this context."
      },
      {
        "question_text": "Naturally Probable",
        "misconception": "Targets complete misunderstanding of the &#39;N&#39; and &#39;P&#39; components, suggesting a non-technical interpretation."
      },
      {
        "question_text": "New Problem",
        "misconception": "Targets a simplistic interpretation of &#39;NP&#39; as a category for novel or unsolved problems, rather than a complexity class."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In computational complexity theory, NP refers to the class of decision problems for which a given solution can be verified in polynomial time by a deterministic Turing machine. The &#39;N&#39; stands for Nondeterministic, referring to a hypothetical Nondeterministic Turing Machine that can &#39;guess&#39; the correct path to a solution, and then verify it in polynomial time.",
      "distractor_analysis": "The distractors play on common misinterpretations or phonetic similarities. &#39;Non-Probabilistic&#39; is a plausible guess for someone who knows &#39;Nondeterministic&#39; but not its exact meaning. &#39;Naturally Probable&#39; and &#39;New Problem&#39; are designed to catch those with very limited or no prior exposure to the concept, leading them to guess based on common English usage rather than technical definitions.",
      "analogy": "Think of NP as problems where, if someone hands you the answer, you can quickly check if it&#39;s right, even if finding that answer in the first place might have been incredibly hard. The &#39;Nondeterministic&#39; part is like having a magical computer that can try all possible solutions simultaneously and pick the right one instantly, then verify it."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "ALGORITHM_THEORY",
      "COMPLEXITY_THEORY"
    ]
  },
  {
    "question_text": "What does HCCA stand for, as part of the 802.11e QoS mechanisms?",
    "correct_answer": "Hybrid Coordination Function Controlled Access",
    "distractors": [
      {
        "question_text": "Hybrid Coordination Function Contention Access",
        "misconception": "Targets confusion between controlled and contention access: HCCA is the contention-free part of HCF, not contention-based."
      },
      {
        "question_text": "High-throughput Coordination Function Controlled Access",
        "misconception": "Targets word substitution: &#39;High-throughput&#39; is a goal, but &#39;Hybrid&#39; is the correct first word of HCF."
      },
      {
        "question_text": "Hybrid Channel Coordination Access",
        "misconception": "Targets word substitution: &#39;Channel&#39; is related, but &#39;Function&#39; is the correct term for the coordination mechanism."
      }
    ],
    "detailed_explanation": {
      "core_logic": "HCCA (Hybrid Coordination Function Controlled Access) is the contention-free component of HCF, defined in 802.11e. It allows a Hybrid Coordinator (HC) to schedule transmissions for stations, providing guaranteed bandwidth and latency for QoS-sensitive applications like voice and video.",
      "distractor_analysis": "Distractors test the precise recall of the full expansion, particularly distinguishing &#39;Controlled Access&#39; from &#39;Contention Access&#39; and ensuring the correct &#39;Hybrid Coordination Function&#39; prefix.",
      "analogy": "HCCA is the &#39;reservation&#39; system within the flexible meeting (HCF). If you have a critical presentation, the moderator (HC) will explicitly give you a time slot, ensuring you get uninterrupted speaking time."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "WLAN_STANDARDS"
    ]
  },
  {
    "question_text": "What does TXOP stand for in 802.11 wireless communication?",
    "correct_answer": "Transmission Opportunity",
    "distractors": [
      {
        "question_text": "Transmit Opportunity",
        "misconception": "Targets word substitution: &#39;Transmit&#39; is a verb, but &#39;Transmission&#39; is the noun used in the standard."
      },
      {
        "question_text": "Time-slot Opportunity",
        "misconception": "Targets concept conflation: TXOP grants a time period, but &#39;Time-slot&#39; is not the correct term in the expansion."
      },
      {
        "question_text": "Traffic Opportunity",
        "misconception": "Targets word substitution: &#39;Traffic&#39; is what is transmitted, but &#39;Transmission&#39; refers to the act itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "TXOP (Transmission Opportunity) is a concept introduced with 802.11e (WMM). It defines a bounded time interval during which a station has the right to send multiple frames without contending for the medium again, reducing overhead and improving efficiency for QoS-sensitive traffic.",
      "distractor_analysis": "Distractors include substituting &#39;Transmission&#39; with the verb &#39;Transmit&#39; or related concepts like &#39;Time-slot&#39; or &#39;Traffic&#39;, testing the precise recall of the standard&#39;s terminology.",
      "analogy": "TXOP is like getting a &#39;fast pass&#39; at an amusement park. Once you have it, you can go on multiple rides (send multiple frames) within a certain time period without having to wait in the general line each time."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "WLAN_STANDARDS"
    ]
  },
  {
    "question_text": "What does SHT stand for in the context of digital image forensics and file reassembly?",
    "correct_answer": "Sequential Hypothesis Testing",
    "distractors": [
      {
        "question_text": "Statistical Hypothesis Testing",
        "misconception": "Targets word substitution: &#39;Statistical&#39; is a related concept but &#39;Sequential&#39; refers to the iterative nature of the test."
      },
      {
        "question_text": "Systematic Heuristic Technique",
        "misconception": "Targets similar-sounding terms: &#39;Systematic&#39; and &#39;Heuristic&#39; are general problem-solving terms but not the specific statistical method."
      },
      {
        "question_text": "Sequential Heuristic Testing",
        "misconception": "Targets word substitution: &#39;Heuristic&#39; is a general problem-solving approach, but the method is specifically &#39;Hypothesis Testing&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SHT, or Sequential Hypothesis Testing, is a statistical analysis method where a hypothesis is tested using an increasing number of samples. In file reassembly, it&#39;s applied to determine if consecutive data clusters belong together, continuing the test with more clusters until a conclusive decision is reached.",
      "distractor_analysis": "The distractors replace &#39;Sequential&#39; with &#39;Statistical&#39; or &#39;Systematic&#39;, or &#39;Hypothesis&#39; with &#39;Heuristic&#39;, which are related but incorrect terms. This tests the precise recall of the acronym&#39;s components, especially the &#39;Sequential&#39; aspect which is key to its application in fragmentation point detection.",
      "analogy": "Think of SHT like a detective gathering clues one by one. Instead of making a decision after a fixed number of clues, the detective keeps gathering more evidence (clusters) until there&#39;s enough to confidently say &#39;this belongs&#39; or &#39;this doesn&#39;t belong&#39; to the case (file)."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "def sequential_hypothesis_test(weights, threshold_H0, threshold_H1):\n    likelihood_ratio = 1.0\n    for w in weights:\n        # In a real scenario, Pr[W|H0] and Pr[W|H1] would be pre-calculated\n        pr_w_H0 = get_pr_w_H0(w) # Probability of weight &#39;w&#39; under H0\n        pr_w_H1 = get_pr_w_H1(w) # Probability of weight &#39;w&#39; under H1\n\n        if pr_w_H0 == 0: # Avoid division by zero\n            return &#39;H1&#39; # Strong evidence against H0\n\n        likelihood_ratio *= (pr_w_H1 / pr_w_H0)\n\n        if likelihood_ratio &gt; threshold_H1:\n            return &#39;H1&#39; # Fragmentation detected\n        elif likelihood_ratio &lt; threshold_H0:\n            return &#39;H0&#39; # Clusters belong together\n    return &#39;Inconclusive&#39; # Need more data\n\n# Example usage (simplified)\n# weights_sequence = [w1, w2, w3, ...]\n# result = sequential_hypothesis_test(weights_sequence, tau_minus, tau_plus)",
        "context": "This Python-like pseudocode illustrates the core logic of SHT, where a likelihood ratio is updated sequentially with new weights (evidence) until it crosses predefined thresholds, indicating acceptance of either hypothesis $H_0$ (clusters belong) or $H_1$ (fragmentation)."
      }
    ],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DIGITAL_FORENSICS",
      "STAT_BASICS"
    ]
  },
  {
    "question_text": "What does DTE stand for in the context of operating system security?",
    "correct_answer": "Domain and Type Enforcement",
    "distractors": [
      {
        "question_text": "Data and Threat Evaluation",
        "misconception": "Targets similar-sounding terms: &#39;Data&#39; and &#39;Threat&#39; are common security terms that could be confused with &#39;Domain&#39; and &#39;Type&#39;."
      },
      {
        "question_text": "Distributed Trust Environment",
        "misconception": "Targets concept conflation: &#39;Distributed Trust&#39; is a security concept, but not the correct expansion for DTE, and &#39;Environment&#39; is a common suffix."
      },
      {
        "question_text": "Dynamic Threat Evasion",
        "misconception": "Targets word substitution: &#39;Dynamic&#39; and &#39;Evasion&#39; are active security terms, but do not match the specific control mechanism of DTE."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DTE, or Domain and Type Enforcement, is a security model used in operating systems to specify and control the privileges a program has. It defines domains for processes and types for objects, enforcing rules on how processes in certain domains can interact with objects of certain types, thereby providing fine-grained access control.",
      "distractor_analysis": "The distractors leverage common security terminology to create plausible but incorrect expansions. &#39;Data and Threat Evaluation&#39; uses familiar security terms. &#39;Distributed Trust Environment&#39; combines a known security concept with a common suffix. &#39;Dynamic Threat Evasion&#39; uses active security verbs that might seem relevant to advanced security controls.",
      "analogy": "Think of DTE like a highly structured office building where different departments (domains) have specific keys (privileges) that only work on certain types of doors (types of objects), ensuring that only authorized personnel can access sensitive areas."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "OS_SECURITY"
    ]
  },
  {
    "question_text": "What does OAT stand for in the context of remote attestation in network infrastructures?",
    "correct_answer": "Open Attestation",
    "distractors": [
      {
        "question_text": "Open Authentication Technology",
        "misconception": "Targets similar-sounding terms: &#39;Authentication&#39; is a related security concept, but &#39;Attestation&#39; is the core function here."
      },
      {
        "question_text": "Operational Attestation Tool",
        "misconception": "Targets word substitution: &#39;Operational&#39; and &#39;Tool&#39; are plausible but incorrect, missing the &#39;Open&#39; and specific &#39;Attestation&#39; context."
      },
      {
        "question_text": "Orchestrated Attestation Technique",
        "misconception": "Targets concept conflation: &#39;Orchestrated&#39; and &#39;Technique&#39; relate to management and methods, but not the specific name of the framework."
      }
    ],
    "detailed_explanation": {
      "core_logic": "OAT, or Open Attestation, is a framework designed to enable remote attestation, allowing for the verification of the integrity of computing platforms. It provides a mechanism for collecting and analyzing integrity measurements from various components within a system.",
      "distractor_analysis": "The distractors leverage common security terminology (Authentication, Operational, Orchestrated) that might seem plausible in a network security context but do not accurately reflect the specific &#39;Open Attestation&#39; framework. They test the precise recall of the acronym&#39;s expansion.",
      "analogy": "Think of OAT as an open-source, standardized &#39;integrity check&#39; system for computers, like a public health inspector for software, ensuring everything is as it should be."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "TRUST_ATTESTATION"
    ]
  },
  {
    "question_text": "What does AST stand for in the context of operating system thread management?",
    "correct_answer": "Asynchronous Software Trap",
    "distractors": [
      {
        "question_text": "Asynchronous System Task",
        "misconception": "Targets term substitution: &#39;Task&#39; is a related OS concept but &#39;Trap&#39; is specific to the mechanism described."
      },
      {
        "question_text": "Advanced Software Trigger",
        "misconception": "Targets similar-sounding terms: &#39;Advanced&#39; and &#39;Trigger&#39; sound plausible but are incorrect for the specific OS mechanism."
      },
      {
        "question_text": "Asynchronous Service Thread",
        "misconception": "Targets concept conflation: &#39;Service Thread&#39; is a valid OS concept but not what AST refers to in this context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In operating system internals, an Asynchronous Software Trap (AST) is a mechanism used to defer procedure calls. It allows the kernel to signal a thread to perform an action at a later, safer point, typically upon returning to user mode or at a specific kernel execution point, without interrupting critical kernel operations immediately.",
      "distractor_analysis": "The distractors replace &#39;Trap&#39; with other OS-related terms like &#39;Task&#39; or &#39;Trigger&#39;, which are plausible but do not precisely describe the interrupt-like, deferred execution nature of an AST. &#39;Service Thread&#39; is a valid concept but unrelated to the &#39;Trap&#39; mechanism.",
      "analogy": "Think of an AST like a sticky note left on a door. The kernel leaves the note (signals the AST), and the thread only acts on it (executes the deferred procedure) when it next passes through that door (returns to user mode or reaches a safe point)."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "OS_INTERNALS",
      "KERNEL_MECHANISMS"
    ]
  },
  {
    "question_text": "What does KSCB stand for in the context of Windows group-based scheduling?",
    "correct_answer": "Kernel Scheduling Control Block",
    "distractors": [
      {
        "question_text": "Kernel System Control Block",
        "misconception": "Targets word substitution: &#39;System&#39; is a plausible but incorrect substitute for &#39;Scheduling&#39;, which is the core function."
      },
      {
        "question_text": "Key Scheduling Control Block",
        "misconception": "Targets letter confusion: &#39;Key&#39; sounds similar to &#39;Kernel&#39; but is incorrect and shifts the meaning to cryptography or access control."
      },
      {
        "question_text": "Kernel Security Control Block",
        "misconception": "Targets domain confusion: &#39;Security&#39; is a common Windows internal component, but KSCB is specifically for scheduling, not general security."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In Windows group-based scheduling, a KSCB (Kernel Scheduling Control Block) is a data structure maintained per processor within a scheduling group. It holds CPU-related information pertinent to scheduling decisions, such as cycle usage, control flags, and ready queues for threads.",
      "distractor_analysis": "The distractors test precise recall of the &#39;S&#39; in KSCB. &#39;System&#39; is a general term that could apply to many kernel structures. &#39;Key&#39; is a phonetic similarity that leads to a different concept. &#39;Security&#39; is a common domain in Windows internals, making it a plausible but incorrect guess for a control block.",
      "analogy": "Think of a KSCB as a specific &#39;scorecard&#39; for each CPU within a team (scheduling group), tracking how much CPU time its assigned players (threads) have used and what rules apply to their play."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "OS_INTERNALS",
      "SCHEDULING_CONCEPTS"
    ]
  }
]