[
  {
    "question_text": "A critical server has been compromised by a sophisticated attacker who has established multiple persistence mechanisms and is actively exfiltrating sensitive data. The security team has identified the compromised server but needs to maintain forensic integrity for a post-incident legal review. What is the MOST appropriate containment strategy?",
    "correct_answer": "Implement network segmentation to isolate the server to a quarantine VLAN, block all outbound connections except to a forensic collection server, and monitor for further activity.",
    "distractors": [
      {
        "question_text": "Immediately power off the server to prevent further data exfiltration and preserve its current state.",
        "misconception": "Targets evidence destruction: Student prioritizes stopping exfiltration over preserving volatile memory, which is crucial for sophisticated attacks and forensic analysis."
      },
      {
        "question_text": "Remove all identified persistence mechanisms and block the attacker&#39;s known C2 IP addresses at the firewall.",
        "misconception": "Targets premature eradication: Student attempts to eradicate before full containment, risking alerting the attacker who may have unknown persistence or pivot to other systems."
      },
      {
        "question_text": "Perform a full system reimage of the compromised server to ensure all malicious code is removed.",
        "misconception": "Targets phase confusion: Student jumps directly to recovery/eradication, destroying all forensic evidence and missing the opportunity to understand the full scope of the compromise."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Isolating the server to a quarantine VLAN and blocking most outbound connections effectively contains the threat by preventing further data exfiltration and lateral movement, while allowing controlled access for forensic collection. Keeping the server powered on preserves volatile memory, which is critical for understanding sophisticated attacker TTPs and maintaining forensic integrity for legal review. Monitoring allows for continued observation of attacker behavior within the contained environment.",
      "distractor_analysis": "Powering off the server destroys volatile evidence. Removing persistence mechanisms without full containment risks alerting the attacker and missing other backdoors. Reimaging destroys all forensic evidence, making a legal review impossible.",
      "analogy": "Imagine a patient with a highly contagious and complex illness. You wouldn&#39;t immediately sedate them (power off) or discharge them (reimage). Instead, you&#39;d move them to an isolation ward (quarantine VLAN), limit their contact with others (block outbound), and carefully observe them (monitor) to understand the disease and collect samples for diagnosis (forensic collection)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example firewall rules for a quarantined server\niptables -A INPUT -s &lt;FORENSIC_SERVER_IP&gt; -j ACCEPT\niptables -A INPUT -j DROP\niptables -A OUTPUT -d &lt;FORENSIC_SERVER_IP&gt; -j ACCEPT\niptables -A OUTPUT -j DROP",
        "context": "Illustrative iptables commands to allow only forensic collection traffic while blocking all other inbound and outbound connections on a Linux server."
      }
    ],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "NETWORK_SECURITY",
      "EVIDENCE_PRESERVATION",
      "LEGAL_REQUIREMENTS"
    ]
  },
  {
    "question_text": "An API is experiencing a suspected data exfiltration incident where sensitive customer PII might be compromised. Forensic investigation is critical, and the attacker&#39;s activity needs to be tracked without alerting them. What containment strategy is MOST appropriate?",
    "correct_answer": "Implement covert network monitoring and traffic shaping to slow down exfiltration, while ensuring audit logs are securely collected and preserved.",
    "distractors": [
      {
        "question_text": "Immediately block all API traffic to prevent further data loss and take the API offline.",
        "misconception": "Targets over-containment/alerting attacker: Student prioritizes immediate cessation of data loss over covert monitoring and evidence collection, potentially alerting the attacker and losing forensic visibility."
      },
      {
        "question_text": "Reset all API keys and user credentials associated with the compromised API.",
        "misconception": "Targets premature overt action: Student jumps to an overt action that would alert the attacker, potentially causing them to destroy evidence or pivot to other access methods before full understanding of the compromise."
      },
      {
        "question_text": "Deploy an Intrusion Prevention System (IPS) to automatically block suspicious API requests.",
        "misconception": "Targets detection/prevention vs. containment: Student confuses a preventative/detection measure with a containment strategy, and an IPS might alert the attacker or block legitimate traffic without forensic value."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Covert network monitoring allows the incident response team to observe the attacker&#39;s methods, scope of compromise, and exfiltration targets without alerting them. Traffic shaping (like rate-limiting) can slow down data exfiltration, buying time for investigation and preparation of a coordinated, overt containment. Securely collecting and preserving audit logs is paramount for forensic investigation and accountability, as they provide crucial details about &#39;who, what, when, where, and how&#39;.",
      "distractor_analysis": "Immediately blocking all traffic or taking the API offline would alert the attacker, potentially causing them to cease activity, destroy evidence, or pivot to other systems, hindering forensic efforts. Resetting credentials is an overt action that would also alert the attacker. Deploying an IPS is a preventative measure that might block traffic but doesn&#39;t focus on covert observation or forensic preservation in an active exfiltration scenario.",
      "analogy": "This is akin to a detective observing a suspect committing a crime from a hidden vantage point, gathering evidence, and perhaps subtly slowing their escape, rather than immediately blowing their cover with a loud arrest. The goal is to understand the full scope and gather irrefutable evidence before making a move."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "NETWORK_FORENSICS",
      "API_SECURITY",
      "EVIDENCE_PRESERVATION"
    ]
  },
  {
    "question_text": "A digital image under investigation has undergone scaling and cropping. You have a known sensor fingerprint for a suspect camera. What is the MOST effective method to determine if the image was taken by that camera, while accounting for the geometrical transformations?",
    "correct_answer": "Utilize the Peak to Correlation Energy (PCE) measure, maximizing it over a grid search of possible scaling ratios and spatial shifts, then compare the maximum PCE to a predefined threshold.",
    "distractors": [
      {
        "question_text": "Directly compare the image&#39;s noise residual with the known sensor fingerprint using a simple cross-correlation.",
        "misconception": "Targets ignoring transformation: Student overlooks the impact of geometrical transformations (scaling, cropping) which desynchronize the image and fingerprint, making direct comparison ineffective."
      },
      {
        "question_text": "Apply an inverse geometrical transformation to the known sensor fingerprint to match the image&#39;s current state, then perform a correlation.",
        "misconception": "Targets incorrect transformation application: Student attempts to transform the fingerprint instead of the image&#39;s noise residual, which is less advantageous, especially for downgrading transformations like downsampling."
      },
      {
        "question_text": "Perform a pixel-by-pixel comparison of the image with a database of known camera images to find a match.",
        "misconception": "Targets inefficient and incorrect method: Student suggests a brute-force, non-forensic method that doesn&#39;t leverage sensor fingerprints and is computationally impractical for attribution."
      }
    ],
    "detailed_explanation": {
      "core_logic": "When an image has undergone geometrical transformations like scaling and cropping, direct comparison with a sensor fingerprint is ineffective due to desynchronization. The PCE measure, derived from Normalized Cross-Correlation (NCC), is designed to account for these transformations by searching for the optimal scaling ratio and spatial shifts that maximize the correlation between the image&#39;s noise residual (after inverse transformation) and the known sensor fingerprint. A grid search is necessary because gradient methods are not applicable due to the noise-like nature of the statistic for incorrect parameters. Comparing the maximum PCE to a threshold helps determine the likelihood of a match while controlling the false alarm rate.",
      "distractor_analysis": "Direct comparison fails because transformations desynchronize the signals. Transforming the fingerprint is less effective than inversely transforming the image&#39;s noise residual, especially for downgrading transformations. Pixel-by-pixel comparison is not a valid or efficient forensic technique for sensor fingerprint attribution.",
      "analogy": "Imagine trying to match a torn and shrunken piece of a map to a full, untorn map. You wouldn&#39;t just lay the small piece on top; you&#39;d have to try scaling it up and moving it around until you find the perfect fit, and then decide if the fit is strong enough to confirm it&#39;s from the same original map."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "procedure",
    "prerequisites": [
      "DIGITAL_IMAGE_FORENSICS",
      "SENSOR_FINGERPRINTING",
      "IMAGE_PROCESSING_BASICS",
      "STATISTICAL_HYPOTHESIS_TESTING"
    ]
  },
  {
    "question_text": "A Security Operations Center (SOC) detects a novel, zero-day malware variant spreading rapidly through the internal network, infecting Windows workstations. The malware establishes C2 communication over non-standard ports. What is the MOST effective immediate containment strategy to prevent further spread while preserving forensic evidence?",
    "correct_answer": "Implement host-based firewall rules on infected and critical uninfected workstations to block all outbound connections except to known-good internal services, and segment affected subnets.",
    "distractors": [
      {
        "question_text": "Immediately power off all infected workstations to stop malware execution.",
        "misconception": "Targets evidence destruction: Student prioritizes stopping execution over preserving volatile memory, which contains critical C2 and infection vector data."
      },
      {
        "question_text": "Deploy a new network-based IPS signature to block the observed C2 traffic.",
        "misconception": "Targets delayed response/ineffective containment: Student relies on a signature that doesn&#39;t exist for a zero-day, and even if created, it&#39;s reactive and may not stop lateral movement already underway."
      },
      {
        "question_text": "Isolate the entire internal network from the internet to prevent C2 communication.",
        "misconception": "Targets over-containment/business impact: Student applies an overly broad measure that severely impacts business operations, when more surgical containment is possible and preferable."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Implementing host-based firewall rules provides granular control to stop C2 and lateral movement at the endpoint, while allowing essential internal services to function, minimizing business impact. Segmenting affected subnets adds a layer of network-level containment. Keeping systems powered on preserves volatile memory for forensic analysis, which is crucial for zero-day incidents.",
      "distractor_analysis": "Powering off destroys volatile evidence. Deploying a new IPS signature for a zero-day is reactive and time-consuming, and doesn&#39;t address internal lateral movement. Isolating the entire internal network is an extreme measure that causes significant business disruption and may not be necessary if more surgical options are available.",
      "analogy": "Imagine a fire in a building. You wouldn&#39;t immediately evacuate the entire city (isolating the whole network). Instead, you&#39;d contain the fire to the affected rooms/floors (host-based rules, subnet segmentation) while allowing other parts of the building to function safely, and you wouldn&#39;t just hope a new sprinkler system gets installed (IPS signature) after the fire started."
    },
    "code_snippets": [
      {
        "language": "powershell",
        "code": "New-NetFirewallRule -DisplayName &quot;Block All Outbound Except Internal&quot; -Direction Outbound -Action Block -Profile Any\nNew-NetFirewallRule -DisplayName &quot;Allow Internal DNS&quot; -Direction Outbound -Action Allow -RemoteAddress 10.0.0.10 -Protocol UDP -LocalPort Any -RemotePort 53\nNew-NetFirewallRule -DisplayName &quot;Allow Internal AD&quot; -Direction Outbound -Action Allow -RemoteAddress 10.0.0.20 -Protocol TCP -LocalPort Any -RemotePort 389,636",
        "context": "Example PowerShell commands to create host-based firewall rules for outbound blocking with specific internal service exceptions on Windows."
      }
    ],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "NETWORK_SECURITY",
      "ENDPOINT_SECURITY",
      "EVIDENCE_PRESERVATION"
    ]
  },
  {
    "question_text": "A sophisticated, deep learning-based Intrusion Detection System (IDS) in a Software-Defined Network (SDN) environment has just flagged a high-confidence anomaly indicating a potential zero-day attack. The IDS uses a CNN-LSTM model. What is the MOST critical immediate containment action to prevent lateral movement and data exfiltration, given the advanced nature of the threat and the SDN architecture?",
    "correct_answer": "Leverage SDN controller capabilities to dynamically reconfigure network flows, isolating the suspected compromised host(s) to a quarantine VLAN or micro-segment",
    "distractors": [
      {
        "question_text": "Immediately power off the suspected compromised host(s) to stop all activity",
        "misconception": "Targets evidence destruction/over-containment: Student prioritizes immediate shutdown, destroying volatile memory and potentially alerting the attacker, when SDN allows for more surgical, less disruptive isolation."
      },
      {
        "question_text": "Initiate a full network scan and deploy updated signatures to all IDSs and endpoints",
        "misconception": "Targets phase confusion/delayed response: Student confuses containment with detection/eradication, and a full scan is too slow and reactive for an active zero-day threat, potentially allowing further spread."
      },
      {
        "question_text": "Reset all user and service account credentials associated with the suspected compromised host(s)",
        "misconception": "Targets premature action/alerting attacker: Student jumps to credential reset, which is an eradication step, potentially alerting a sophisticated attacker who may have other persistence mechanisms or trigger destructive actions before full containment is achieved."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In an SDN environment, the controller provides centralized control over network devices, enabling rapid and dynamic reconfiguration of network policies. Isolating the compromised host(s) to a quarantine VLAN or micro-segment using these capabilities is the most effective and surgical containment method. This prevents lateral movement and data exfiltration while preserving the system&#39;s state for forensic analysis, without alerting the attacker through a complete shutdown.",
      "distractor_analysis": "Powering off destroys volatile evidence and is an overly blunt instrument for an SDN environment. A full network scan and signature deployment are detection/eradication activities, not immediate containment. Resetting credentials is an eradication step that could alert a sophisticated attacker prematurely.",
      "analogy": "Imagine a smart building with a central control system. If a specific room is compromised, you don&#39;t shut down the entire building&#39;s power. Instead, you use the central system to immediately seal off that room, reroute all traffic away from it, and monitor it, while the rest of the building continues to function."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "# Example (conceptual) SDN controller API call for host isolation\ndef isolate_host(controller_ip, host_mac, quarantine_vlan_id):\n    # This would interact with the SDN controller&#39;s API\n    print(f&quot;Connecting to SDN controller at {controller_ip}&quot;)\n    print(f&quot;Creating flow rules to move host {host_mac} to VLAN {quarantine_vlan_id}&quot;)\n    print(&quot;Blocking all traffic to/from host except for forensic access&quot;)\n    # Actual API calls would be more complex and vendor-specific\n\n# Example usage:\nisolate_host(&#39;192.168.1.1&#39;, &#39;00:1A:2B:3C:4D:5E&#39;, 666)",
        "context": "Conceptual Python code demonstrating how an SDN controller&#39;s API could be used to programmatically isolate a compromised host to a quarantine VLAN or micro-segment by modifying network flow rules."
      }
    ],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "SDN_ARCHITECTURE",
      "NETWORK_SECURITY",
      "IDS_CONCEPTS"
    ]
  },
  {
    "question_text": "A critical system is suspected of being compromised by an attacker using advanced anti-forensic techniques, including debugger detection. You need to contain the threat while preserving the system state for later forensic analysis. Which containment action is MOST appropriate given the attacker&#39;s likely awareness of debugging tools?",
    "correct_answer": "Isolate the system from the network and create a full disk image while it remains powered on",
    "distractors": [
      {
        "question_text": "Immediately power off the system to prevent further compromise and preserve RAM contents",
        "misconception": "Targets evidence destruction: Student believes powering off preserves RAM, but it destroys volatile memory contents crucial for advanced analysis, especially if the attacker is using memory-resident malware."
      },
      {
        "question_text": "Attempt to attach a kernel debugger to analyze the system&#39;s state in real-time",
        "misconception": "Targets alerting the attacker: Student ignores the attacker&#39;s anti-debugging capabilities, which could trigger destructive payloads or cause the attacker to erase traces upon debugger detection."
      },
      {
        "question_text": "Perform a live memory dump and then reboot the system into a clean environment",
        "misconception": "Targets premature eradication/disruption: Student prioritizes memory dump over full system state preservation and risks alerting the attacker or losing context by rebooting before full containment."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Isolating the system from the network prevents further attacker control or data exfiltration. Creating a full disk image while powered on preserves the entire system state, including disk contents and volatile memory (if the imaging tool supports it or a separate memory dump is taken concurrently), without alerting the attacker via debugger attachment. This balances containment with comprehensive evidence preservation.",
      "distractor_analysis": "Powering off destroys volatile memory. Attaching a debugger risks detection and counter-measures by the attacker. A live memory dump is good, but rebooting before full disk imaging and comprehensive containment risks losing critical disk-based evidence and alerting the attacker.",
      "analogy": "Imagine a booby-trapped package. You wouldn&#39;t try to open it immediately (attach debugger) or throw it in the trash (power off). You&#39;d carefully move it to a safe, isolated location (network isolation) and then use specialized tools to examine it without triggering the trap (disk imaging while powered on)."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "ANTI_FORENSICS",
      "EVIDENCE_PRESERVATION",
      "NETWORK_SECURITY"
    ]
  },
  {
    "question_text": "A critical quantum computing experiment is experiencing high qubit decoherence rates, threatening the integrity of the results. Traditional error correction methods are proving insufficient. What containment strategy, leveraging AI, would be MOST effective in mitigating this issue without halting the experiment?",
    "correct_answer": "Deploy AI-driven anomaly detection to identify unconventional qubit behavior and dynamically adjust error-correction codes in real-time",
    "distractors": [
      {
        "question_text": "Immediately power down the quantum computer to prevent further data corruption",
        "misconception": "Targets over-containment/destruction of evidence: Student prioritizes immediate shutdown, which halts the experiment and loses potential real-time data on decoherence patterns that AI could analyze."
      },
      {
        "question_text": "Isolate the quantum computer from the network to prevent external interference",
        "misconception": "Targets misdirected containment: Student focuses on network isolation, which is irrelevant to internal qubit decoherence issues and doesn&#39;t address the core problem."
      },
      {
        "question_text": "Manually recalibrate all physical parameters of the quantum computer based on historical data",
        "misconception": "Targets inefficiency/human limitation: Student relies on manual, time-consuming methods that AI is specifically designed to automate and optimize, especially in high-dimensional parameter spaces."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AI&#39;s ability to model error patterns, fine-tune error-correction codes, and perform anomaly detection in real-time is crucial for mitigating qubit decoherence without stopping the experiment. This allows for continuous operation while improving reliability and performance by adapting to the dynamic quantum environment.",
      "distractor_analysis": "Powering down would stop the experiment and lose valuable real-time data. Network isolation is not relevant to internal qubit decoherence. Manual recalibration is inefficient and unlikely to find optimal parameters in a complex system compared to AI.",
      "analogy": "Imagine a self-driving car encountering unexpected road conditions. Instead of stopping or relying on a human to manually adjust every setting, an AI system dynamically adapts steering, braking, and acceleration in real-time to maintain control and continue the journey safely."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "AI_ML_BASICS",
      "QUANTUM_COMPUTING_BASICS",
      "IR_CONTAINMENT"
    ]
  },
  {
    "question_text": "A critical internal server is suspected of being compromised by a sophisticated attacker who has established a covert C2 channel. You are using Security Onion with Sguil for network monitoring. To prevent further data exfiltration and lateral movement while preserving forensic evidence, what is the MOST appropriate initial containment action?",
    "correct_answer": "Implement a host-based firewall rule on the compromised server to block all outbound connections except to a designated forensic collection server, then monitor Sguil for changes in C2 activity.",
    "distractors": [
      {
        "question_text": "Immediately power off the compromised server to stop all activity and preserve its current state.",
        "misconception": "Targets evidence destruction/loss of visibility: Student prioritizes immediate cessation of activity, but powering off destroys volatile memory and prevents monitoring of attacker TTPs, which is crucial for sophisticated threats."
      },
      {
        "question_text": "Disconnect the server&#39;s network cable to physically isolate it, then begin a full disk image.",
        "misconception": "Targets over-containment/loss of visibility: Student applies a broad isolation method that prevents any further monitoring of the attacker&#39;s actions and may alert them, potentially triggering destructive payloads."
      },
      {
        "question_text": "Reset all user and service account passwords on the server and domain to revoke attacker access.",
        "misconception": "Targets premature eradication/alerting attacker: Student confuses containment with eradication and takes an action that will immediately alert a sophisticated attacker, potentially causing them to activate destructive payloads or pivot to other systems."
      }
    ],
    "detailed_explanation": {
      "core_logic": "For a sophisticated attacker with a covert C2, a surgical host-based firewall rule allows for controlled containment. Blocking all outbound connections except to a forensic collection server limits data exfiltration and C2 communication without immediately alerting the attacker or destroying volatile evidence. Monitoring Sguil for changes in C2 activity provides insight into the attacker&#39;s response, helping to plan subsequent, more aggressive containment or eradication steps. This approach balances containment with intelligence gathering and evidence preservation.",
      "distractor_analysis": "Powering off destroys volatile memory and stops all monitoring. Physical disconnection also stops monitoring and alerts the attacker. Resetting passwords is an eradication step that alerts the attacker and risks triggering destructive actions before full understanding of the compromise.",
      "analogy": "Imagine a sniper in a building. You don&#39;t immediately storm the building (power off/disconnect) or yell &#39;We know you&#39;re there!&#39; (reset passwords). Instead, you might cut off their escape routes and communication (host-based firewall) while observing their movements to plan a precise, effective takedown."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example Linux host-based firewall rule for containment\nsudo iptables -A OUTPUT -d &lt;forensic_server_IP&gt; -j ACCEPT\nsudo iptables -A OUTPUT -j DROP",
        "context": "This example demonstrates how to allow only necessary outbound traffic to a forensic server while blocking all other outbound connections on a Linux host."
      }
    ],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "NETWORK_SECURITY",
      "HOST_SECURITY",
      "EVIDENCE_PRESERVATION",
      "NSM_CONCEPTS"
    ]
  },
  {
    "question_text": "An attacker is actively using a custom Scapy script to generate a high volume of false-positive alerts on your network&#39;s IDS, attempting to mask a legitimate, low-volume data exfiltration. Your primary goal is to contain the exfiltration without immediately alerting the attacker to detection. What is the MOST appropriate containment strategy?",
    "correct_answer": "Implement covert network traffic shaping or rate-limiting on suspected exfiltration channels while maintaining full network visibility for forensic collection.",
    "distractors": [
      {
        "question_text": "Immediately block all traffic from the attacker&#39;s spoofed IP address at the perimeter firewall.",
        "misconception": "Targets overt containment: Student prioritizes immediate blocking, which would alert the attacker and potentially cause them to switch tactics or destroy evidence before full understanding."
      },
      {
        "question_text": "Disable the IDS system temporarily to reduce alert fatigue and focus on manual packet analysis.",
        "misconception": "Targets security degradation: Student removes a critical security control, potentially missing other threats and making the environment more vulnerable."
      },
      {
        "question_text": "Deploy an EDR solution to all endpoints to identify the source of the data exfiltration.",
        "misconception": "Targets detection vs. containment confusion: Student focuses on expanding detection capabilities rather than limiting damage, and EDR deployment might alert a sophisticated attacker to detection."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Covert containment is crucial when the attacker is unaware of detection. Traffic shaping or rate-limiting on suspected exfiltration channels can slow or stop data loss without immediately alerting the attacker. This buys time for further investigation, evidence collection, and preparation for a coordinated, overt containment action. Maintaining full network visibility is essential for forensic analysis.",
      "distractor_analysis": "Immediately blocking the spoofed IP is an overt action that would alert the attacker. Disabling the IDS removes a valuable detection tool. Deploying EDR is a detection activity, not containment, and could also alert a sophisticated attacker.",
      "analogy": "Imagine a thief trying to sneak out a small item in a crowded store while creating a diversion. You wouldn&#39;t immediately shout &#39;Thief!&#39; and tackle them, as they might drop the item or run. Instead, you&#39;d subtly block their exit or slow them down while calling security to apprehend them discreetly and recover the item."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "tc qdisc add dev eth0 root tbf rate 100kbit burst 10kb latency 50ms",
        "context": "Example of using Linux traffic control (tc) to rate-limit outbound traffic on an interface (eth0) to 100 kilobits per second, which can covertly slow down exfiltration."
      }
    ],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "IR_ADVANCED",
      "NETWORK_SECURITY",
      "COVERT_OPERATIONS",
      "TRAFFIC_SHAPING"
    ]
  }
]