[
  {
    "question_text": "What does RMT stand for in the context of programmable network hardware?",
    "correct_answer": "Reconfigurable Match Tables",
    "distractors": [
      {
        "question_text": "Real-time Management Technology",
        "misconception": "Targets similar-sounding terms: &#39;Real-time&#39; and &#39;Management&#39; are common in networking but incorrect here."
      },
      {
        "question_text": "Router Management Toolkit",
        "misconception": "Targets domain confusion: &#39;Router&#39; is a network device, but RMT refers to a specific architecture, not a general toolkit."
      },
      {
        "question_text": "Resource Management Tables",
        "misconception": "Targets word substitution: &#39;Resource&#39; is a plausible but incorrect substitute for &#39;Reconfigurable&#39; in this specific context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RMT, or Reconfigurable Match Tables, refers to a pipeline architecture used in programmable network hardware, particularly in Software-Defined Networking (SDN). It allows for flexible packet processing by defining stages where packets are matched against rules and actions are performed, inspired by RISC architectures.",
      "distractor_analysis": "The distractors use terms that are common in networking or sound plausible, such as &#39;Real-time Management Technology&#39; or &#39;Router Management Toolkit&#39;, to mislead those with partial knowledge. &#39;Resource Management Tables&#39; substitutes a key word, &#39;Reconfigurable&#39;, with a related but incorrect concept.",
      "analogy": "Think of RMT like a customizable assembly line for network packets. Each station (stage) on the line has a specific set of instructions (match tables) that can be changed on the fly to process packets in different ways, rather than being stuck with a fixed, unchangeable process."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SDN_CONCEPTS"
    ]
  },
  {
    "question_text": "What does PAWS stand for in the context of TCP connection management?",
    "correct_answer": "Protection Against Wrapped Sequence Numbers",
    "distractors": [
      {
        "question_text": "Protocol for Advanced Window Scaling",
        "misconception": "Targets similar-sounding concepts: Window Scaling is a related TCP option, but PAWS addresses sequence number wrapping."
      },
      {
        "question_text": "Protection Against Weak Security",
        "misconception": "Targets general security terms: &#39;Weak Security&#39; is a common security concern, but not what PAWS specifically addresses."
      },
      {
        "question_text": "Packet Acknowledgment and Window Synchronization",
        "misconception": "Targets functional confusion: Acknowledgment and Window Synchronization are TCP functions, but not the specific problem PAWS solves."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PAWS (Protection Against Wrapped Sequence Numbers) is a TCP mechanism that uses the Timestamps option to prevent old, duplicate segments from being accepted by a receiver after the 32-bit sequence number has wrapped around. By comparing the timestamp of an incoming segment with the most recently accepted timestamp, PAWS can correctly discard stale segments, especially critical in high-bandwidth, high-latency networks where sequence numbers can wrap quickly.",
      "distractor_analysis": "Distractors are designed to confuse PAWS with other TCP features or general security concepts. &#39;Protocol for Advanced Window Scaling&#39; links to another TCP option (Window Scaling) that is often used in conjunction with PAWS but is not its purpose. &#39;Protection Against Weak Security&#39; is a generic security term. &#39;Packet Acknowledgment and Window Synchronization&#39; describes general TCP functions but misses the specific problem of sequence number wrapping.",
      "analogy": "Imagine a library where books are cataloged with a 3-digit number. If the library gets so many books that the numbers wrap around (e.g., 999 then 001 again), PAWS is like adding a date stamp to each book. If an old book with number 001 and an old date stamp reappears, it&#39;s discarded because a newer book with number 001 and a recent date stamp has already been processed."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  }
]