[
  {
    "question_text": "What does FBI stand for in the context of US law enforcement and cybersecurity?",
    "correct_answer": "Federal Bureau of Investigation",
    "distractors": [
      {
        "question_text": "Federal Bureau of Intelligence",
        "misconception": "Targets word substitution: &#39;Intelligence&#39; is a related concept but not the correct term for the &#39;I&#39; in FBI."
      },
      {
        "question_text": "Federated Bureau of Investigation",
        "misconception": "Targets similar-sounding terms: &#39;Federated&#39; sounds plausible for a national agency but is incorrect."
      },
      {
        "question_text": "Financial Bureau of Investigation",
        "misconception": "Targets scope confusion: While the FBI investigates financial crimes, &#39;Financial&#39; is not part of its official name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The FBI is the domestic intelligence and security service of the United States and its principal federal law enforcement agency. It has jurisdiction over violations of more than 200 categories of federal crimes, including cybercrime.",
      "distractor_analysis": "Distractors test precise recall of the agency&#39;s name. &#39;Intelligence&#39; is a common misremembering due to the FBI&#39;s intelligence gathering role. &#39;Federated&#39; is a plausible but incorrect synonym for a national organization. &#39;Financial&#39; narrows the scope to one area of FBI work, rather than its full name.",
      "analogy": "Think of the FBI as the primary federal detective agency for the US, investigating a wide range of crimes, including those in the digital realm."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does OS stand for in the context of host/port scanning and CMDB/SCM data?",
    "correct_answer": "Operating System",
    "distractors": [
      {
        "question_text": "Open Source",
        "misconception": "Targets similar-sounding terms: &#39;Open Source&#39; is a common term in IT but refers to software licensing, not the core software managing hardware."
      },
      {
        "question_text": "Operational Security",
        "misconception": "Targets concept conflation: &#39;Operational Security&#39; is a security discipline, but &#39;OS&#39; in this context refers to the software itself."
      },
      {
        "question_text": "Output Stream",
        "misconception": "Targets technical term confusion: &#39;Output Stream&#39; is a programming concept, unrelated to the system software managing a device."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In computing, OS universally stands for Operating System. It is the fundamental software that manages computer hardware and software resources, providing common services for computer programs. In vulnerability management, identifying the OS is crucial for understanding potential vulnerabilities and applying appropriate patches.",
      "distractor_analysis": "The distractors leverage common IT and security terms that share the &#39;O&#39; and &#39;S&#39; initials but refer to entirely different concepts. &#39;Open Source&#39; is a software development model, &#39;Operational Security&#39; is a security practice, and &#39;Output Stream&#39; is a programming construct. None of these accurately describe the core software managing a device.",
      "analogy": "Think of the OS as the brain of a computer or device. Just as you need to know what kind of brain (human, animal, AI) you&#39;re dealing with to understand its capabilities and weaknesses, you need to know the OS to manage its security."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nmap -O 192.168.1.1\n# Nmap output might include:\n# OS: Linux 3.X (Linux kernel 3.X)",
        "context": "The &#39;-O&#39; flag in Nmap is used for Operating System detection, which helps identify the specific OS running on a target host."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does IP stand for in the context of network activity and cybersecurity investigations?",
    "correct_answer": "Internet Protocol",
    "distractors": [
      {
        "question_text": "Internal Protocol",
        "misconception": "Targets word substitution: &#39;Internal&#39; sounds plausible as IPs are used internally, but &#39;Internet&#39; refers to its global addressing scheme."
      },
      {
        "question_text": "Interconnection Protocol",
        "misconception": "Targets similar-sounding terms: &#39;Interconnection&#39; relates to networking but is not the precise term for the standard."
      },
      {
        "question_text": "Information Packet",
        "misconception": "Targets concept confusion: While IP deals with packets of information, &#39;Information Packet&#39; is not the correct expansion of the acronym itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IP, or Internet Protocol, is the fundamental protocol for communicating data across a packet-switched internetwork using the Internet Protocol Suite (TCP/IP). It defines how data packets are addressed and routed from a source host to a destination host across networks.",
      "distractor_analysis": "The distractors test the precision of recall. &#39;Internal Protocol&#39; incorrectly narrows the scope. &#39;Interconnection Protocol&#39; uses a related but incorrect synonym. &#39;Information Packet&#39; describes a component of IP communication rather than the protocol&#39;s name itself.",
      "analogy": "Think of IP as the postal service for the internet. It ensures that your data &#39;letters&#39; (packets) get addressed correctly and delivered to the right &#39;house&#39; (destination host) across various &#39;roads&#39; (networks)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "ping 8.8.8.8\nifconfig eth0",
        "context": "Common command-line tools like &#39;ping&#39; use IP addresses to test connectivity, and &#39;ifconfig&#39; displays network interface IP configurations."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does the acronym POS stand for in the context of payment systems?",
    "correct_answer": "Point-of-Sale",
    "distractors": [
      {
        "question_text": "Proof-of-Service",
        "misconception": "Targets similar-sounding terms: &#39;Proof-of-Service&#39; is a plausible-sounding term in a technical context but incorrect for payment systems."
      },
      {
        "question_text": "Payment-on-Site",
        "misconception": "Targets functional misunderstanding: &#39;Payment-on-Site&#39; describes a transaction location, but not the system itself."
      },
      {
        "question_text": "Protocol-of-Security",
        "misconception": "Targets domain confusion: &#39;Protocol-of-Security&#39; sounds like a cybersecurity term but is unrelated to payment systems."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In the context of payment systems, POS refers to &#39;Point-of-Sale&#39; systems. These are the physical or virtual locations where a transaction is completed, such as a cash register in a store or an online checkout page. Compromise of these systems is a common method for cybercriminals to acquire payment data.",
      "distractor_analysis": "The distractors are designed to sound plausible by using common technical or business terms. &#39;Proof-of-Service&#39; might be confused with other &#39;Proof-of-X&#39; concepts in technology. &#39;Payment-on-Site&#39; describes a characteristic of some transactions but not the system&#39;s name. &#39;Protocol-of-Security&#39; attempts to leverage the cybersecurity context but is a fabricated term.",
      "analogy": "Think of a POS system as the checkout counter at a grocery store – it&#39;s the specific place where you finalize your purchase and hand over your payment."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In cybersecurity, what does SecOps stand for?",
    "correct_answer": "Security Operations",
    "distractors": [
      {
        "question_text": "Secure Operations",
        "misconception": "Targets word substitution: &#39;Secure&#39; is an adjective describing the state, while &#39;Security&#39; is the noun referring to the field or function."
      },
      {
        "question_text": "Security Optimization",
        "misconception": "Targets similar-sounding terms: &#39;Optimization&#39; is a related concept in IT but not the correct expansion for &#39;Ops&#39;."
      },
      {
        "question_text": "Security Operational",
        "misconception": "Targets grammatical error: &#39;Operational&#39; is an adjective, but &#39;Operations&#39; (plural noun) is the correct term for the department/function."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SecOps refers to the Security Operations team or department within an organization. This team is responsible for managing and monitoring the organization&#39;s security posture, responding to incidents, and implementing security measures to protect IT assets.",
      "distractor_analysis": "Distractors test precise recall of the &#39;Ops&#39; component, differentiating between similar-sounding or grammatically incorrect alternatives. &#39;Secure&#39; is an adjective, &#39;Optimization&#39; is a different concept, and &#39;Operational&#39; is an adjective rather than the plural noun &#39;Operations&#39;.",
      "analogy": "Think of SecOps as the security guard station for a building. They don&#39;t just &#39;secure&#39; the building; they perform &#39;security operations&#39; like monitoring cameras, checking IDs, and responding to alarms."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "grep &#39;failed login&#39; /var/log/auth.log | mail -s &#39;Failed Login Alert&#39; secops@example.com",
        "context": "A basic script demonstrating a task that a SecOps team might automate for monitoring security events."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  }
]