[
  {
    "question_text": "Which security testing tool type would be LEAST effective in detecting a firmware rootkit that compromises the platform&#39;s hardware root of trust, such as those mitigated by Google Titan?",
    "correct_answer": "DAST (Dynamic Application Security Testing)",
    "distractors": [
      {
        "question_text": "SAST (Static Application Security Testing)",
        "misconception": "Targets scope misunderstanding: Student might think SAST can analyze firmware binaries for malicious code, overlooking the hardware-level compromise."
      },
      {
        "question_text": "IAST (Interactive Application Security Testing)",
        "misconception": "Targets scope misunderstanding: Student might believe IAST&#39;s runtime visibility extends to the firmware and hardware root of trust, which it does not."
      },
      {
        "question_text": "Manual hardware-level analysis and reverse engineering",
        "misconception": "Targets automation bias: Student might incorrectly assume that automated tools are always superior, even for highly specialized, low-level threats."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Firmware rootkits operate at a layer below the operating system, directly compromising the platform&#39;s boot process and hardware root of trust. DAST tools are designed to test running applications by interacting with them via their exposed interfaces (e.g., HTTP requests). They operate at the application layer and have no visibility or capability to detect compromises at the firmware or hardware level.",
      "distractor_analysis": "SAST can analyze code, including firmware binaries, for known malicious patterns or vulnerabilities, but it operates on source or compiled code, not the live hardware state. IAST provides runtime analysis within the application but is still confined to the application and OS layers. Manual hardware-level analysis and reverse engineering, while labor-intensive, are actually the MOST effective methods for detecting such low-level threats, making it an incorrect choice for &#39;least effective&#39;.",
      "analogy": "Detecting a firmware rootkit with DAST is like trying to find a leak in a ship&#39;s hull by only checking the water level in the cabins. The problem is at a much lower, foundational level that the tool cannot reach."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "analysis",
    "prerequisites": [
      "DAST_BASICS",
      "SAST_BASICS",
      "IAST_BASICS",
      "ROOTKIT_CONCEPTS",
      "FIRMWARE_SECURITY"
    ]
  }
]