[
  {
    "question_text": "What does Wi-Fi stand for?",
    "correct_answer": "Wireless Fidelity",
    "distractors": [
      {
        "question_text": "Wireless Fiber",
        "misconception": "Targets similar-sounding terms: &#39;Fiber&#39; is a common networking term and sounds similar to &#39;Fidelity&#39;, leading to confusion."
      },
      {
        "question_text": "Wireless Internet Functionality",
        "misconception": "Targets functional association: Wi-Fi is associated with internet access, so students might incorrectly assume &#39;Internet Functionality&#39; is part of its expansion."
      },
      {
        "question_text": "Wireless Frequency",
        "misconception": "Targets technical association: Wi-Fi operates on radio frequencies, so &#39;Frequency&#39; might seem like a plausible component of the name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Wi-Fi is a common term for 802.11 wireless networks. While often thought to be an acronym for &#39;Wireless Fidelity&#39;, the term was actually coined by Interbrand for the Wi-Fi Alliance (formerly WECA) as a marketing term, and &#39;Wireless Fidelity&#39; was added later as a tagline. However, in common usage and by the Wi-Fi Alliance itself, it is widely accepted as standing for &#39;Wireless Fidelity&#39;.",
      "distractor_analysis": "The distractors leverage common associations with wireless technology (fiber, internet functionality, frequency) to create plausible but incorrect expansions. The term &#39;Wireless Fidelity&#39; itself is somewhat arbitrary, making it a good test of precise recall versus logical deduction.",
      "analogy": "Think of Wi-Fi like &#39;Hi-Fi&#39; (High Fidelity) for audio. It implies a certain standard of quality or faithfulness in wireless communication, even if the &#39;Fidelity&#39; part isn&#39;t a direct technical descriptor."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does PID stand for in the context of process management, as shown in a system process list?",
    "correct_answer": "Process ID",
    "distractors": [
      {
        "question_text": "Program Identifier",
        "misconception": "Targets similar-sounding terms: &#39;Program&#39; is related to processes, and &#39;Identifier&#39; is close to &#39;ID&#39;, but &#39;Process&#39; is the precise term."
      },
      {
        "question_text": "Process Information Descriptor",
        "misconception": "Targets over-elaboration: Students might assume a more complex technical term, adding &#39;Information Descriptor&#39; when it&#39;s simply &#39;ID&#39;."
      },
      {
        "question_text": "Parent ID",
        "misconception": "Targets confusion with related concepts: PPID (Parent Process ID) is often seen alongside PID, leading to confusion about which is which."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PID stands for Process ID, a unique numerical identifier assigned to each active process by the operating system. This ID is crucial for managing processes, allowing the system and users to refer to specific running programs or tasks.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Program Identifier&#39; uses a synonym for &#39;Process&#39; and a similar term for &#39;ID&#39;. &#39;Process Information Descriptor&#39; adds unnecessary complexity, while &#39;Parent ID&#39; confuses PID with PPID, a closely related but distinct concept often found in the same context.",
      "analogy": "Think of a PID like a social security number for a running program; it&#39;s a unique identifier that the operating system uses to keep track of it."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "ps aux | grep &lt;process_name&gt;",
        "context": "In Linux, &#39;ps aux&#39; lists all running processes, and &#39;grep&#39; can filter by process name to find its PID."
      },
      {
        "language": "powershell",
        "code": "Get-Process -Name &lt;process_name&gt;",
        "context": "In PowerShell, &#39;Get-Process&#39; retrieves information about running processes, including their PIDs."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "OS_BASICS",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does MFD stand for in the context of network peripherals?",
    "correct_answer": "Multifunction Device",
    "distractors": [
      {
        "question_text": "Multi-Feature Device",
        "misconception": "Targets similar-sounding terms: &#39;Feature&#39; is close to &#39;Function&#39; but not the exact term used for these devices."
      },
      {
        "question_text": "Managed Functionality Device",
        "misconception": "Targets word substitution: &#39;Managed Functionality&#39; sounds plausible for a network device but is not the correct expansion."
      },
      {
        "question_text": "Multipurpose Device",
        "misconception": "Targets synonym substitution: &#39;Multipurpose&#39; is a synonym for &#39;Multifunction&#39; but not the precise acronym expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "MFD stands for Multifunction Device, referring to network peripherals like printers, scanners, and copiers that combine multiple functions into a single unit. These devices often run embedded operating systems and can be overlooked security risks.",
      "distractor_analysis": "The distractors use words that are semantically similar or sound plausible in the context of network devices (e.g., Multi-Feature, Managed Functionality, Multipurpose) but are not the exact, recognized expansion of MFD, testing for precise recall.",
      "analogy": "Think of an MFD as a &#39;Swiss Army Knife&#39; for office tasks – it combines several tools (printer, scanner, copier) into one device."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In the context of network services and Active Directory, what does DNS stand for?",
    "correct_answer": "Domain Name System",
    "distractors": [
      {
        "question_text": "Dynamic Network Service",
        "misconception": "Targets similar-sounding terms: &#39;Dynamic&#39; and &#39;Network&#39; are common networking terms, but incorrect for DNS."
      },
      {
        "question_text": "Distributed Naming Service",
        "misconception": "Targets partial understanding: DNS is distributed and provides naming services, but &#39;Distributed Naming Service&#39; is not its exact expansion."
      },
      {
        "question_text": "Domain Naming Standard",
        "misconception": "Targets word substitution: &#39;Standard&#39; is a plausible substitute for &#39;System&#39; in a technical context, but incorrect."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DNS, or Domain Name System, is a hierarchical and decentralized naming system for computers, services, or other resources connected to the Internet or a private network. It translates human-readable domain names (like example.com) into numerical IP addresses (like 192.0.2.1) that computers use to identify each other.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Dynamic Network Service&#39; uses common networking terms that are not part of the correct expansion. &#39;Distributed Naming Service&#39; captures aspects of DNS&#39;s function but is not the official name. &#39;Domain Naming Standard&#39; substitutes &#39;System&#39; with &#39;Standard,&#39; which is a plausible but incorrect word choice in a technical acronym.",
      "analogy": "Think of DNS as the internet&#39;s phonebook. Instead of remembering a long phone number (IP address) for a person (website), you just look up their name (domain name), and the phonebook gives you the number."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nslookup rebeladmin.com\n# Server:  192.168.1.1\n# Address: 192.168.1.1#53\n\n# Non-authoritative answer:\n# Name:    rebeladmin.com\n# Address: 203.0.113.42",
        "context": "The `nslookup` command is used to query DNS servers for information about domain names, demonstrating DNS in action."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does CCIP stand for in the context of Cisco certifications?",
    "correct_answer": "Cisco Certified Internetwork Professional",
    "distractors": [
      {
        "question_text": "Cisco Certified Internetwork Practitioner",
        "misconception": "Targets word substitution: &#39;Practitioner&#39; sounds similar to &#39;Professional&#39; and implies hands-on experience, which is relevant to certifications."
      },
      {
        "question_text": "Cisco Certified Internetwork Program",
        "misconception": "Targets word substitution: &#39;Program&#39; is a common term in certification contexts but is incorrect here."
      },
      {
        "question_text": "Cisco Certified Internet Protocol",
        "misconception": "Targets acronym letter confusion: &#39;IP&#39; is a common networking acronym, leading to confusion with &#39;Internetwork Professional&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CCIP, or Cisco Certified Internetwork Professional, was a mid-level certification offered by Cisco Systems, focusing on advanced routing and service provider technologies like MPLS and VPNs. It was designed for network professionals working with complex network infrastructures.",
      "distractor_analysis": "The distractors test precise recall of the &#39;P&#39; in CCIP. &#39;Practitioner&#39; and &#39;Program&#39; are plausible but incorrect substitutions for &#39;Professional&#39;. &#39;Internet Protocol&#39; leverages the common &#39;IP&#39; acronym to mislead those who don&#39;t know the full expansion.",
      "analogy": "Think of CCIP as a specialized degree for network architects, focusing on the &#39;professional&#39; application of complex internetworking concepts, rather than just a general &#39;program&#39; or &#39;protocol&#39; understanding."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does ISS stand for in the context of cybersecurity?",
    "correct_answer": "Information System Security",
    "distractors": [
      {
        "question_text": "Information Security Systems",
        "misconception": "Targets word order confusion: Reversing &#39;System&#39; and &#39;Security&#39; is a common mistake that sounds plausible."
      },
      {
        "question_text": "Internet System Security",
        "misconception": "Targets domain confusion: Substituting &#39;Information&#39; with &#39;Internet&#39; narrows the scope incorrectly, as ISS applies beyond just internet-facing systems."
      },
      {
        "question_text": "Integrated System Security",
        "misconception": "Targets similar-sounding terms: &#39;Integrated&#39; sounds like a valid security concept but is not the correct expansion for ISS."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ISS, or Information System Security, refers to the protection of information systems from unauthorized access, use, disclosure, disruption, modification, or destruction. It encompasses the security of hardware, software, data, and the people who use them.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Information Security Systems&#39; reverses the order, which is a common error. &#39;Internet System Security&#39; incorrectly limits the scope to internet systems. &#39;Integrated System Security&#39; uses a plausible but incorrect adjective.",
      "analogy": "Think of ISS as the overall bodyguard for all your digital assets and the systems that hold them, not just the internet-connected ones."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does PMBOK stand for in the context of project management methodologies?",
    "correct_answer": "Project Management Body of Knowledge",
    "distractors": [
      {
        "question_text": "Project Management Baseline of Knowledge",
        "misconception": "Targets word substitution: &#39;Baseline&#39; is a plausible project management term but incorrect for this acronym."
      },
      {
        "question_text": "Program Management Body of Knowledge",
        "misconception": "Targets similar-sounding terms: &#39;Program&#39; is related to &#39;Project&#39; in management but is a distinct concept."
      },
      {
        "question_text": "Project Management Best Practices of Knowledge",
        "misconception": "Targets concept conflation: &#39;Best Practices&#39; is a common phrase in methodologies, but not part of this specific acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PMBOK is a widely recognized collection of processes, best practices, terminologies, and guidelines that are accepted as standards within the project management industry. It is published by the Project Management Institute (PMI).",
      "distractor_analysis": "Each distractor replaces a key word with a related but incorrect term (&#39;Baseline&#39; for &#39;Body&#39;, &#39;Program&#39; for &#39;Project&#39;, &#39;Best Practices&#39; for &#39;Body&#39;), testing the precise recall of the acronym&#39;s expansion.",
      "analogy": "PMBOK is like the &#39;encyclopedia&#39; or &#39;rulebook&#39; for how to manage projects effectively, providing a common language and framework for project managers."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does OS stand for in the context of &#39;Remote OS Detection&#39;?",
    "correct_answer": "Operating System",
    "distractors": [
      {
        "question_text": "Open Source",
        "misconception": "Targets similar-sounding terms: &#39;Open Source&#39; is a common computing term and could be confused with &#39;Operating System&#39; due to shared initial letters and general tech context."
      },
      {
        "question_text": "Output Stream",
        "misconception": "Targets technical term confusion: &#39;Output Stream&#39; is a valid computing term, but unrelated to the function of a computer&#39;s core software."
      },
      {
        "question_text": "Operational Security",
        "misconception": "Targets domain confusion: &#39;Operational Security&#39; is a cybersecurity concept, but &#39;OS&#39; in this context refers to the software platform, not a security practice."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In computing, OS is the universally accepted abbreviation for Operating System. Remote OS Detection refers to the process of identifying the specific operating system (e.g., Windows, Linux, macOS) running on a remote host, often a crucial step in penetration testing to tailor subsequent attacks or vulnerability assessments.",
      "distractor_analysis": "The distractors leverage common computing acronyms or related security terms that share the &#39;OS&#39; initialism but refer to entirely different concepts. &#39;Open Source&#39; is a widely recognized term, &#39;Output Stream&#39; is a valid programming concept, and &#39;Operational Security&#39; is a relevant cybersecurity domain, making them plausible but incorrect choices for someone with partial knowledge.",
      "analogy": "Think of an OS as the brain of a computer. Remote OS Detection is like trying to figure out if a person you&#39;re talking to on the phone is speaking English, Spanish, or Mandarin, to better understand how to communicate with them."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "nmap -O target_ip",
        "context": "The &#39;nmap -O&#39; command is a common tool used in penetration testing for remote OS detection."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does FCC stand for in the context of device certifications?",
    "correct_answer": "Federal Communications Commission",
    "distractors": [
      {
        "question_text": "Federal Cybercrime Commission",
        "misconception": "Targets similar-sounding terms: &#39;Cybercrime&#39; is a related security concept but not part of the regulatory body&#39;s name."
      },
      {
        "question_text": "Federated Communications Committee",
        "misconception": "Targets word substitution: &#39;Committee&#39; sounds plausible for a regulatory body but &#39;Commission&#39; is the correct term."
      },
      {
        "question_text": "Foreign Communications Certification",
        "misconception": "Targets scope confusion: &#39;Foreign&#39; implies international, but FCC is a U.S. specific regulatory body, and &#39;Certification&#39; is a function, not part of the name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Federal Communications Commission (FCC) is an independent agency of the United States government that regulates interstate and international communications by radio, television, wire, satellite, and cable. Devices with an FCC ID have been certified to comply with FCC regulations regarding electromagnetic interference.",
      "distractor_analysis": "Distractors test the precise recall of the regulatory body&#39;s name. &#39;Cybercrime&#39; is a security-related term but incorrect. &#39;Committee&#39; is a plausible organizational structure but not the correct term for this agency. &#39;Foreign&#39; and &#39;Certification&#39; misrepresent the scope and nature of the organization.",
      "analogy": "Think of the FCC like a traffic cop for radio waves and electronic signals in the US; they ensure devices don&#39;t interfere with each other or public safety communications."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does stdout refer to in programming contexts, particularly when discussing output functions like printf?",
    "correct_answer": "Standard Output",
    "distractors": [
      {
        "question_text": "Standard Outbound",
        "misconception": "Targets similar-sounding terms: &#39;Outbound&#39; sounds related to output but is not the correct, precise term for the standard stream."
      },
      {
        "question_text": "System Output",
        "misconception": "Targets scope confusion: &#39;System&#39; is too broad; &#39;Standard&#39; refers to a specific, conventional stream for program output."
      },
      {
        "question_text": "Source Output",
        "misconception": "Targets acronym letter confusion: &#39;Source&#39; starts with &#39;S&#39; and relates to code, but &#39;Standard&#39; is the correct term for the output stream."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In programming, stdout is an abbreviation for Standard Output. It is a standard stream where a program writes its output data. By default, this output is directed to the console or terminal where the program is executed, but it can be redirected to a file or another program.",
      "distractor_analysis": "The distractors play on common misinterpretations of &#39;st&#39; or &#39;out&#39;. &#39;Standard Outbound&#39; incorrectly uses a networking term. &#39;System Output&#39; is too generic and doesn&#39;t capture the &#39;standard&#39; nature. &#39;Source Output&#39; incorrectly links &#39;S&#39; to &#39;Source&#39; code.",
      "analogy": "Think of stdout as the default printer for your program. Whatever your program wants to &#39;print&#39; (display), it sends to stdout, and by default, that &#39;printer&#39; is your screen."
    },
    "code_snippets": [
      {
        "language": "c",
        "code": "#include &lt;stdio.h&gt;\n\nint main() {\n    fprintf(stdout, &quot;This goes to standard output.\\n&quot;);\n    return 0;\n}",
        "context": "Explicitly writing to stdout using fprintf, though printf implicitly uses stdout."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which organization is known for its comprehensive cybersecurity training and certifications, often referenced for blue team skill development?",
    "correct_answer": "SANS Institute",
    "distractors": [
      {
        "question_text": "NIST Institute",
        "misconception": "Targets acronym confusion: NIST is a well-known cybersecurity organization but focuses on frameworks and standards, not primarily training like SANS."
      },
      {
        "question_text": "CIS Institute",
        "misconception": "Targets acronym confusion: CIS (Center for Internet Security) provides benchmarks and controls, not primarily training and certifications like SANS."
      },
      {
        "question_text": "OWASP Foundation",
        "misconception": "Targets domain confusion: OWASP focuses on web application security, which is a subset of the broader cybersecurity training offered by SANS."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The SANS Institute is a globally recognized organization that provides extensive cybersecurity training, certifications, and research. Its courses are highly regarded for developing practical skills in various cybersecurity domains, including those essential for blue teams.",
      "distractor_analysis": "The distractors are other prominent cybersecurity organizations (NIST, CIS, OWASP) that are often mentioned in security contexts. However, they have different primary missions (standards, benchmarks, web app security) compared to SANS&#39;s focus on comprehensive training and certifications.",
      "analogy": "If cybersecurity knowledge is a martial art, SANS is a dojo that teaches you the moves and gives you belts (certifications), while NIST provides the rulebook for the competition, CIS provides the training regimen, and OWASP focuses on specific self-defense techniques for certain types of attacks."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "In cybersecurity, what does SaaS stand for?",
    "correct_answer": "Software as a Service",
    "distractors": [
      {
        "question_text": "Security as a Service",
        "misconception": "Targets domain confusion: While &#39;Security as a Service&#39; is a valid concept (SECaaS), the &#39;S&#39; in SaaS specifically refers to Software."
      },
      {
        "question_text": "System as a Service",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; is a general IT term, but &#39;Software&#39; is the precise component delivered in SaaS."
      },
      {
        "question_text": "Service as a Software",
        "misconception": "Targets word order and grammatical error: Reversing the order makes it grammatically incorrect and changes the meaning from a delivery model to a description of software."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SaaS, or Software as a Service, is a software distribution model in which a third-party provider hosts applications and makes them available to customers over the Internet. It&#39;s a common cloud computing service model.",
      "distractor_analysis": "Distractors test the precise recall of the &#39;S&#39; in SaaS, differentiating it from other &#39;as a Service&#39; models or general IT terms, and ensuring correct word order.",
      "analogy": "SaaS is like renting an apartment: you use the living space (software) without owning the building (infrastructure) or maintaining it. The landlord (provider) handles all the upkeep."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_BASICS"
    ]
  }
]