[
  {
    "question_text": "Which of the following BEST defines &#39;Illegal access&#39; according to cybersecurity conventions?",
    "correct_answer": "The unauthorized intrusion into computer systems or unauthorized access to data, excluding access by system owners or to public open-access systems.",
    "distractors": [
      {
        "question_text": "The unauthorized intentional interception of non-public data.",
        "misconception": "Targets terminology confusion: Students might confuse &#39;illegal access&#39; with &#39;illegal interception&#39;, both involving unauthorized data interaction but distinct in method."
      },
      {
        "question_text": "The unauthorized intentional interference in the proper functioning of computer programs and data.",
        "misconception": "Targets scope confusion: Students might confuse &#39;illegal access&#39; with &#39;data interference&#39;, which focuses on modifying or damaging data rather than just gaining entry."
      },
      {
        "question_text": "The intentional hindering of the operation of computer systems, such as by denial of service attacks.",
        "misconception": "Targets impact confusion: Students might confuse &#39;illegal access&#39; with &#39;system interference&#39;, which focuses on disrupting system availability rather than gaining unauthorized entry or data access."
      }
    ],
    "detailed_explanation": {
      "core_logic": "&#39;Illegal access&#39; specifically refers to gaining entry to a system or data without proper authorization. It&#39;s about the act of entry itself, not necessarily what is done once inside or how data is intercepted.",
      "distractor_analysis": "Illegal interception is about passively acquiring data in transit. Data interference is about actively modifying or damaging data or programs. System interference is about disrupting system operations. All are distinct offenses from merely gaining unauthorized access.",
      "analogy": "Illegal access is like breaking into a house; illegal interception is like eavesdropping on a phone call; data interference is like vandalizing furniture inside the house; system interference is like cutting the power to the house."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which statement accurately describes a worm?",
    "correct_answer": "A standalone malicious program that replicates itself to spread to other computers without human interaction",
    "distractors": [
      {
        "question_text": "A malicious program that attaches itself to legitimate software and requires user execution to spread",
        "misconception": "Targets terminology confusion: Students confuse worms with viruses, which require a host program and user action to spread."
      },
      {
        "question_text": "A type of malware that disguises itself as legitimate software to trick users into installing it",
        "misconception": "Targets terminology confusion: Students confuse worms with Trojans, which rely on deception to gain initial access."
      },
      {
        "question_text": "Malicious software designed to block access to a computer system until a sum of money is paid",
        "misconception": "Targets function confusion: Students confuse the mechanism of a worm (self-propagation) with the payload of ransomware (encryption for extortion), which a worm might deliver."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A worm is a type of malware characterized by its ability to self-replicate and spread across networks independently, without needing to attach to a host program or requiring user intervention for propagation. The WannaCry incident is a prime example of a worm&#39;s rapid, widespread impact.",
      "distractor_analysis": "A virus requires a host program and user execution. A Trojan horse relies on social engineering to trick users into installing it. Ransomware is a type of payload that encrypts data for extortion, which could be delivered by a worm, but it&#39;s not the definition of a worm itself.",
      "analogy": "A worm is like a self-replicating organism that can move from one host to another on its own, whereas a virus is like a parasite that needs to attach to another living thing to spread."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which statement accurately describes a &#39;worm&#39; in the context of cybersecurity?",
    "correct_answer": "A standalone malicious program that replicates itself to spread to other computers without human interaction.",
    "distractors": [
      {
        "question_text": "A type of malware that attaches itself to legitimate programs and requires user execution to spread.",
        "misconception": "Targets terminology confusion: Students confuse worms with viruses, which require a host program and user action to spread."
      },
      {
        "question_text": "Malicious software designed to block access to a computer system until a sum of money is paid.",
        "misconception": "Targets function confusion: Students confuse worms with ransomware, which encrypts data for extortion, though a worm can deliver ransomware."
      },
      {
        "question_text": "A program that appears legitimate but performs malicious activities once executed by a user.",
        "misconception": "Targets terminology confusion: Students confuse worms with Trojans, which rely on deception and user execution but do not self-replicate."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A worm is a self-replicating malware that spreads autonomously across networks, often exploiting vulnerabilities to propagate without requiring user intervention. Its key characteristic is its ability to spread independently.",
      "distractor_analysis": "Viruses require a host program and user action. Ransomware is a payload, not a propagation method. Trojans rely on deception and user execution, not self-replication.",
      "analogy": "A worm is like a highly contagious airborne disease that spreads on its own; a virus is like a disease spread through direct contact with an infected carrier."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST defines a MAC filter in the context of wireless security?",
    "correct_answer": "A security feature on a Wireless Access Point (WAP) that limits network access to devices whose MAC addresses are on an approved list.",
    "distractors": [
      {
        "question_text": "A network device that inspects and filters network traffic based on IP addresses and port numbers.",
        "misconception": "Targets functional confusion: Students might confuse MAC filtering with a firewall, which operates at higher network layers and uses different filtering criteria."
      },
      {
        "question_text": "A protocol used to assign unique IP addresses to devices on a network.",
        "misconception": "Targets protocol confusion: Students might confuse MAC filtering with DHCP, which is responsible for IP address assignment, a completely different network function."
      },
      {
        "question_text": "A method to encrypt wireless communication between a client and a WAP.",
        "misconception": "Targets purpose confusion: Students might confuse MAC filtering (access control) with encryption protocols like WPA2/WPA3, which provide confidentiality and integrity."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A MAC filter is a basic access control mechanism at the data link layer (Layer 2) that allows or denies network access based on a device&#39;s unique Media Access Control (MAC) address. It&#39;s implemented on a WAP to control which wireless clients can connect.",
      "distractor_analysis": "The first distractor describes a firewall, which operates at Layer 3/4. The second describes DHCP, a network configuration protocol. The third describes wireless encryption, which secures data in transit, not access based on MAC addresses.",
      "analogy": "MAC filtering is like a bouncer at a club checking an &#39;approved guest list&#39; of specific IDs, rather than checking for a general ticket or membership."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST describes the role of a Security Analyst?",
    "correct_answer": "Monitors security systems, analyzes security alerts, and responds to incidents to protect an organization&#39;s assets.",
    "distractors": [
      {
        "question_text": "Conducts authorized simulated attacks to identify vulnerabilities in systems and applications.",
        "misconception": "Targets role confusion: Students often confuse the proactive vulnerability identification of a Security Analyst with the specialized offensive testing of a Penetration Tester."
      },
      {
        "question_text": "Designs, builds, and implements secure network architectures and security solutions.",
        "misconception": "Targets role confusion: Students may confuse the operational monitoring and response of an Analyst with the architectural and implementation focus of a Security Engineer."
      },
      {
        "question_text": "Investigates cybercrimes, recovers data, and provides expert testimony in legal proceedings.",
        "misconception": "Targets role confusion: Students might confuse the real-time incident response of an Analyst with the post-incident, evidence-focused work of a Forensic Expert."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Security Analyst is primarily responsible for the day-to-day monitoring of security systems, detecting and analyzing security events, and initiating response procedures to mitigate threats. Their role is crucial in maintaining an organization&#39;s security posture.",
      "distractor_analysis": "A Penetration Tester performs offensive security assessments. A Security Engineer focuses on designing and implementing security infrastructure. A Forensic Expert specializes in post-incident investigation and evidence collection.",
      "analogy": "A Security Analyst is like a security guard monitoring surveillance cameras and responding to alarms; a Penetration Tester is like a &#39;red team&#39; trying to break in to test the defenses."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST defines ASIM in the context of network security?",
    "correct_answer": "A system designed for Automated Security Incident Measurement",
    "distractors": [
      {
        "question_text": "A protocol for secure network communication",
        "misconception": "Targets category confusion: Students might confuse ASIM with a network protocol due to the &#39;Automated&#39; and &#39;Measurement&#39; terms, similar to how protocols automate tasks."
      },
      {
        "question_text": "A method for asset-centric security implementation",
        "misconception": "Targets proximity confusion: &#39;Asset-centric security&#39; appears near ASIM in the text, leading to a false association."
      },
      {
        "question_text": "A tool for collecting and analyzing network flow data",
        "misconception": "Targets function confusion: Students might associate &#39;Measurement&#39; with data collection tools like NetFlow, even though ASIM is a broader concept."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ASIM stands for Automated Security Incident Measurement. It refers to a system or framework focused on the automated measurement and analysis of security incidents, providing metrics and insights into an organization&#39;s security posture and incident response effectiveness.",
      "distractor_analysis": "Distractor 1 incorrectly categorizes ASIM as a communication protocol. Distractor 2 links it to &#39;asset-centric security,&#39; which is a different concept mentioned nearby in the text. Distractor 3 misinterprets &#39;measurement&#39; as solely referring to network flow data collection, rather than the broader concept of incident measurement.",
      "analogy": "ASIM is like a dashboard that automatically tracks and reports on how many security &#39;bumps&#39; (incidents) your car (network) has had, rather than just being the car itself or a specific part of it."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which statement accurately describes the primary function of a blue team?",
    "correct_answer": "A blue team implements proactive practices to identify and respond to malicious events targeting IT assets, improving security maturity and business continuity.",
    "distractors": [
      {
        "question_text": "A blue team simulates attacks against an organization&#39;s security defenses to identify vulnerabilities.",
        "misconception": "Targets role confusion: Students often confuse blue teams (defense) with red teams (offense/simulated attacks)."
      },
      {
        "question_text": "A blue team focuses solely on incident response after a breach has occurred, without proactive measures.",
        "misconception": "Targets scope misunderstanding: Students might think blue teams are purely reactive, ignoring their proactive hardening and analysis roles."
      },
      {
        "question_text": "A blue team is primarily responsible for developing new security tools and cryptographic algorithms.",
        "misconception": "Targets responsibility confusion: Students might confuse blue team operational roles with security research or development roles."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A blue team&#39;s primary function is to defend an organization&#39;s IT assets. This involves both proactive measures like hardening and log management, and reactive measures like incident identification and response, all aimed at improving security maturity and ensuring business continuity.",
      "distractor_analysis": "The first distractor describes a red team&#39;s function. The second incorrectly limits the blue team&#39;s scope to only reactive incident response, ignoring their proactive defense-in-depth activities. The third distractor describes a security research or development role, not the operational defense role of a blue team.",
      "analogy": "If a red team is like an attacking army, a blue team is the defending army, building fortifications, monitoring borders, and responding to incursions."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  }
]