[
  {
    "question_text": "What distinguishes a &#39;Zero-Day&#39; vulnerability from a &#39;Known Vulnerability&#39;?",
    "correct_answer": "A Zero-Day vulnerability is unknown to the vendor and has no patch available, while a Known Vulnerability has been disclosed and a patch or mitigation often exists.",
    "distractors": [
      {
        "question_text": "A Zero-Day is a vulnerability that has been exploited, whereas a Known Vulnerability has not yet been exploited.",
        "misconception": "Targets exploitation status confusion: Students confuse the &#39;zero-day&#39; aspect (vendor awareness/patch availability) with whether an exploit exists or has been used."
      },
      {
        "question_text": "A Zero-Day refers to a vulnerability with a CVE assigned, while a Known Vulnerability does not have a CVE.",
        "misconception": "Targets identification mechanism confusion: Students incorrectly associate CVE assignment with the &#39;zero-day&#39; status, rather than with public disclosure."
      },
      {
        "question_text": "A Zero-Day is a vulnerability that affects only custom software, whereas a Known Vulnerability affects commercial off-the-shelf (COTS) products.",
        "misconception": "Targets scope confusion: Students incorrectly limit the scope of zero-days to custom software, when they can affect any software."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Zero-Day vulnerability is one that is unknown to the software vendor, meaning there has been &#39;zero days&#39; for the vendor to fix it, and no patch is available. A Known Vulnerability, conversely, has been publicly disclosed, and typically a patch or mitigation has been released or is in development.",
      "distractor_analysis": "The term &#39;zero-day&#39; refers to the vendor&#39;s awareness and patch availability, not necessarily whether an exploit exists or has been used. CVEs are assigned to publicly disclosed vulnerabilities, which can include known vulnerabilities, but a zero-day is by definition not yet publicly disclosed to the vendor. Zero-days can affect any type of software, not just custom applications.",
      "analogy": "A Zero-Day is like a new, undiscovered disease for which no cure exists yet. A Known Vulnerability is a disease that has been identified, and doctors are working on or already have a treatment."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which of the following BEST defines risk in the context of cybersecurity investment decisions?",
    "correct_answer": "The potential for loss or harm resulting from a threat exploiting a vulnerability, considering the likelihood and impact",
    "distractors": [
      {
        "question_text": "A weakness in a system or design that could be exploited by a threat",
        "misconception": "Targets terminology confusion: Students confuse risk with vulnerability, which is only one component of risk."
      },
      {
        "question_text": "A potential danger or adverse event that could exploit a system weakness",
        "misconception": "Targets terminology confusion: Students confuse risk with threat, which is the source of potential harm, not the harm itself."
      },
      {
        "question_text": "An action or event that takes advantage of a vulnerability to cause harm",
        "misconception": "Targets terminology confusion: Students confuse risk with an exploit, which is the mechanism used to leverage a vulnerability."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In cybersecurity, risk is the combination of the likelihood of a threat exploiting a vulnerability and the impact of that exploitation. It&#39;s about understanding the potential for loss or harm.",
      "distractor_analysis": "A vulnerability is a weakness, a threat is a potential danger, and an exploit is the tool or method used to take advantage of a vulnerability. Risk encompasses all these elements to quantify potential harm.",
      "analogy": "If your house has a weak lock (vulnerability) and there are burglars in the area (threat), the risk is the chance of a burglary and the potential loss if it happens. An exploit would be the specific tool the burglar uses to pick the lock."
    },
    "code_snippets": [],
    "difficulty": "advanced",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  }
]