[
  {
    "question_text": "What does API stand for in the context of cloud services and automation?",
    "correct_answer": "Application Programming Interface",
    "distractors": [
      {
        "question_text": "Application Protocol Interface",
        "misconception": "Targets word substitution: &#39;Protocol&#39; is a related networking term but incorrect in this context."
      },
      {
        "question_text": "Automated Programming Interface",
        "misconception": "Targets similar-sounding terms: &#39;Automated&#39; relates to the function but is not the correct expansion of &#39;A&#39;."
      },
      {
        "question_text": "Advanced Programming Interface",
        "misconception": "Targets common misremembering: &#39;Advanced&#39; is a plausible but incorrect adjective for &#39;A&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An API (Application Programming Interface) is a set of defined rules that enable different software applications to communicate with each other. In cloud computing, APIs are crucial for automating tasks, managing resources, and integrating various services programmatically.",
      "distractor_analysis": "The distractors test precise recall of the &#39;P&#39; and &#39;A&#39; in API. &#39;Protocol&#39; is a networking term that might seem plausible, &#39;Automated&#39; describes a common use case but not the expansion, and &#39;Advanced&#39; is a common adjective that could be mistakenly associated with &#39;A&#39;.",
      "analogy": "Think of an API as a restaurant menu. You don&#39;t need to know how the kitchen works (the internal code); you just need to know what you can order (the available functions) and how to order it (the syntax and parameters)."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "import boto3\ns3 = boto3.client(&#39;s3&#39;)\nresponse = s3.list_buckets()",
        "context": "This Python code uses the Boto3 SDK, which interacts with AWS services via their underlying APIs to list S3 buckets."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does CLI stand for in the context of interacting with cloud services like AWS?",
    "correct_answer": "Command Line Interface",
    "distractors": [
      {
        "question_text": "Cloud Logic Interface",
        "misconception": "Targets term substitution: &#39;Cloud&#39; is a relevant domain term, but &#39;Logic&#39; is incorrect for the &#39;L&#39; in CLI."
      },
      {
        "question_text": "Centralized Logging Interface",
        "misconception": "Targets similar-sounding terms: &#39;Logging&#39; is a common IT concept, but not what &#39;L&#39; stands for in CLI."
      },
      {
        "question_text": "Control Layer Interface",
        "misconception": "Targets functional confusion: &#39;Control Layer&#39; sounds plausible for managing services, but is not the correct expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Command Line Interface (CLI) is a text-based interface used to operate software and operating systems. Users type commands into the interface to perform tasks, which is a common method for interacting with cloud services like AWS, Azure, and GCP for automation and scripting.",
      "distractor_analysis": "Distractors replace &#39;Command&#39; or &#39;Line&#39; with terms that are related to cloud or IT operations but are not the precise expansion, testing for exact recall of the acronym&#39;s components.",
      "analogy": "Think of a CLI as typing instructions directly to a computer or cloud service, rather than clicking buttons on a website. It&#39;s like giving verbal commands instead of using a remote control with a graphical display."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "aws s3 ls\naws ec2 describe-instances --region us-east-1",
        "context": "Examples of common AWS CLI commands to list S3 buckets and describe EC2 instances."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In the context of container security, what does the acronym VM stand for?",
    "correct_answer": "Virtual Machine",
    "distractors": [
      {
        "question_text": "Virtual Memory",
        "misconception": "Targets similar-sounding computing term: Virtual Memory is a related concept in operating systems but not what VM refers to in this context."
      },
      {
        "question_text": "Volume Mount",
        "misconception": "Targets container-specific term confusion: Volume Mounts are relevant to containers but VM refers to the underlying infrastructure."
      },
      {
        "question_text": "Verified Module",
        "misconception": "Targets plausible but incorrect technical term: Verified Module sounds like a security component but is not the correct expansion for VM."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In computing, a Virtual Machine (VM) is an emulation of a computer system. VMs are based on computer architectures and provide functionality of a physical computer. They are often used to run multiple operating systems on a single physical machine, providing isolation between different environments.",
      "distractor_analysis": "The distractors leverage terms that are either related to computing (Virtual Memory), specific to container technology (Volume Mount), or sound technically plausible (Verified Module), but none accurately represent the common meaning of VM in the context of infrastructure and cloud-native environments.",
      "analogy": "Think of a VM as a completely separate computer running inside another computer, like a nested doll, each with its own operating system and resources, but sharing the physical hardware of the host."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does VM stand for in the context of virtualization and containerization?",
    "correct_answer": "Virtual Machine",
    "distractors": [
      {
        "question_text": "Virtual Monitor",
        "misconception": "Targets similar-sounding terms: &#39;Monitor&#39; is a common computing term and sounds plausible in a virtualization context."
      },
      {
        "question_text": "Volatile Memory",
        "misconception": "Targets concept confusion: &#39;Volatile Memory&#39; is a real computing term (RAM) but unrelated to virtualization architecture."
      },
      {
        "question_text": "Verified Module",
        "misconception": "Targets letter substitution: &#39;Verified&#39; and &#39;Module&#39; are security-related terms that could be mistakenly associated with &#39;V&#39; and &#39;M&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "VM, or Virtual Machine, refers to an emulation of a computer system. Virtual machines are based on computer architectures and provide functionality of a physical computer. Their implementations may involve specialized hardware, software, or a combination of both. They run a full guest operating system on top of a hypervisor.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Virtual Monitor&#39; sounds plausible due to the &#39;virtual&#39; aspect and monitoring being a common IT task. &#39;Volatile Memory&#39; is a legitimate computing term but completely unrelated to the concept of a virtualized operating environment. &#39;Verified Module&#39; uses security-related terms that might seem relevant but do not form the correct expansion.",
      "analogy": "A VM is like having a completely separate computer running inside your existing computer, with its own operating system and applications, all isolated from each other."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does the principle of &#39;Least Privilege&#39; mean in cybersecurity?",
    "correct_answer": "Restricting access for components or users to only the information and resources absolutely necessary for their function.",
    "distractors": [
      {
        "question_text": "Granting all necessary permissions to a component or user to ensure full functionality without hindrance.",
        "misconception": "Targets misunderstanding of &#39;least&#39;: This distractor suggests maximum privilege for functionality, directly opposing the principle."
      },
      {
        "question_text": "Ensuring all users have equal access to resources to promote fairness and collaboration within an organization.",
        "misconception": "Targets conflation with equality: This distractor confuses &#39;least privilege&#39; with &#39;equal access&#39;, which is not the goal and can increase risk."
      },
      {
        "question_text": "Implementing multiple layers of security controls to protect a system from various attack vectors.",
        "misconception": "Targets confusion with &#39;Defense in Depth&#39;: This distractor describes a different security principle, &#39;Defense in Depth&#39;, which is also mentioned in the document."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The principle of Least Privilege dictates that every user, program, or process should be granted only the minimum set of permissions or access rights required to perform its legitimate function. This minimizes the potential damage or &#39;blast radius&#39; if that entity is compromised.",
      "distractor_analysis": "The first distractor represents the opposite of least privilege, suggesting full access. The second distractor confuses the concept with equal access, which is not the intent. The third distractor describes &#39;Defense in Depth&#39;, a distinct security principle, testing if the student can differentiate between core security concepts.",
      "analogy": "Think of a janitor in a building. They only get keys to the rooms they need to clean, not the CEO&#39;s office or the server room. This limits what they can access if their keys are stolen."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does LDAP stand for in the context of directory services for authentication?",
    "correct_answer": "Lightweight Directory Access Protocol",
    "distractors": [
      {
        "question_text": "Lightweight Data Access Protocol",
        "misconception": "Targets word substitution: &#39;Data&#39; is a common term in IT but &#39;Directory&#39; is specific to LDAP&#39;s function."
      },
      {
        "question_text": "Limited Directory Access Protocol",
        "misconception": "Targets similar-sounding adjective: &#39;Limited&#39; sounds plausible for a &#39;lightweight&#39; protocol but is incorrect."
      },
      {
        "question_text": "Local Directory Authentication Protocol",
        "misconception": "Targets functional confusion: While used for authentication, &#39;Local&#39; is not part of the expansion, and &#39;Access&#39; is the correct term for the &#39;A&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "LDAP, or Lightweight Directory Access Protocol, is an open, vendor-neutral, industry-standard application protocol for accessing and maintaining distributed directory information services. It is commonly used for managing user identities and authentication in enterprise environments, often integrated with systems like Kubernetes for user authentication.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Lightweight Data Access Protocol&#39; replaces &#39;Directory&#39; with &#39;Data&#39;, which is a common data-related term but incorrect for LDAP&#39;s specific purpose. &#39;Limited Directory Access Protocol&#39; uses a synonym for &#39;Lightweight&#39; that is not the correct term. &#39;Local Directory Authentication Protocol&#39; incorrectly substitutes &#39;Access&#39; with &#39;Authentication&#39; and adds &#39;Local&#39;, conflating its function with its name.",
      "analogy": "Think of LDAP as a universal phone book for an organization, where you can quickly look up information about users, groups, and devices. It&#39;s &#39;lightweight&#39; because it&#39;s designed for efficient querying over networks."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does API stand for in the context of Kubernetes and software development?",
    "correct_answer": "Application Programming Interface",
    "distractors": [
      {
        "question_text": "Application Process Interface",
        "misconception": "Targets word substitution: &#39;Process&#39; is a common computing term but &#39;Programming&#39; is specific to how applications interact."
      },
      {
        "question_text": "Automated Program Interface",
        "misconception": "Targets letter confusion: &#39;A&#39; for Automated instead of Application, and &#39;Program&#39; instead of &#39;Programming&#39;."
      },
      {
        "question_text": "Access Point Interface",
        "misconception": "Targets domain confusion: &#39;Access Point&#39; is a networking term, unrelated to software interaction mechanisms."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An API (Application Programming Interface) is a set of defined rules that enable different software applications to communicate with each other. In Kubernetes, the API server exposes an API that allows users and other components to interact with the cluster, managing resources like pods, deployments, and services.",
      "distractor_analysis": "The distractors test precise recall of the terms &#39;Application&#39; and &#39;Programming&#39;. &#39;Process&#39; is a plausible but incorrect substitute for &#39;Programming&#39;. &#39;Automated&#39; is a common misinterpretation of the &#39;A&#39;. &#39;Access Point Interface&#39; attempts to confuse with a networking concept.",
      "analogy": "Think of an API as a restaurant menu. You don&#39;t need to know how the kitchen works (the internal logic of the application); you just need to know what you can order (the available functions) and what ingredients you need to provide (the parameters)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "kubectl get pods\nkubectl create -f my-deployment.yaml",
        "context": "These kubectl commands interact with the Kubernetes API server to manage resources."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does the acronym K8s refer to in the context of container orchestration?",
    "correct_answer": "Kubernetes",
    "distractors": [
      {
        "question_text": "Key Management System",
        "misconception": "Targets similar-sounding terms: K8s is a numerical abbreviation, not an acronym, and Key Management System (KMS) is a distinct security concept."
      },
      {
        "question_text": "Kernel Security",
        "misconception": "Targets initial letter confusion: While &#39;K&#39; is correct, &#39;Kernel Security&#39; is a general concept, not the specific orchestration platform."
      },
      {
        "question_text": "Container Orchestration System",
        "misconception": "Targets functional description as expansion: This describes what Kubernetes does, but is not its name or expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "K8s is a numeronym for Kubernetes, where &#39;8&#39; represents the eight letters between the &#39;K&#39; and the &#39;s&#39; in the word Kubernetes. It is a widely adopted open-source system for automating deployment, scaling, and management of containerized applications.",
      "distractor_analysis": "The distractors aim to confuse students by offering plausible-sounding security or IT terms that either share a letter (Kernel Security), sound similar (Key Management System), or describe the function rather than the name (Container Orchestration System). The key is to recognize K8s as a specific numeronym.",
      "analogy": "Think of K8s like &#39;W3C&#39; for &#39;World Wide Web Consortium&#39; or &#39;I18n&#39; for &#39;Internationalization&#39; – it&#39;s a shorthand for a longer, specific term."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "kubectl get pods -n kube-system",
        "context": "This is a common command used to interact with a Kubernetes (K8s) cluster, listing pods in the &#39;kube-system&#39; namespace."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does API stand for in the context of integrating automation systems?",
    "correct_answer": "Application Programming Interface",
    "distractors": [
      {
        "question_text": "Application Process Interface",
        "misconception": "Targets word substitution: &#39;Process&#39; is a common computing term but &#39;Programming&#39; is specific to how applications interact."
      },
      {
        "question_text": "Automated Programming Interface",
        "misconception": "Targets initialism confusion: &#39;A&#39; for &#39;Automated&#39; seems plausible in an automation context but is incorrect."
      },
      {
        "question_text": "Application Protocol Interface",
        "misconception": "Targets similar-sounding terms: &#39;Protocol&#39; is related to communication but &#39;Programming&#39; accurately describes the interaction method."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An API (Application Programming Interface) is a set of defined rules that enable different software applications to communicate with each other. It specifies how software components should interact, defining the kinds of calls or requests that can be made, how to make them, the data formats that should be used, and the conventions to follow.",
      "distractor_analysis": "The distractors replace &#39;Programming&#39; with &#39;Process&#39;, &#39;Automated&#39;, or &#39;Protocol&#39;. While these words are related to computing and automation, they do not form the precise, universally accepted expansion of API, testing the student&#39;s exact recall.",
      "analogy": "Think of an API as a restaurant menu. You don&#39;t need to know how the kitchen (the application) prepares the food; you just need to know what dishes (functions) are available and how to order them (the interface)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "curl -X GET &quot;https://api.example.com/data&quot; -H &quot;Authorization: Bearer YOUR_TOKEN&quot;",
        "context": "Example of a cURL command interacting with a RESTful API to retrieve data."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In the context of cloud resource management, what does PII stand for?",
    "correct_answer": "Personally Identifiable Information",
    "distractors": [
      {
        "question_text": "Private Identity Information",
        "misconception": "Targets word substitution: &#39;Private&#39; is a common synonym for &#39;Personally&#39; in this context, but incorrect."
      },
      {
        "question_text": "Protected Information Identifier",
        "misconception": "Targets concept confusion: &#39;Protected&#39; and &#39;Identifier&#39; are related security terms but do not form the correct expansion."
      },
      {
        "question_text": "Personal Information Indicator",
        "misconception": "Targets word substitution: &#39;Indicator&#39; is similar to &#39;Information&#39; but changes the meaning of the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PII refers to any data that can be used to identify a specific individual. This includes names, addresses, social security numbers, and other unique identifiers. Protecting PII is a critical aspect of data privacy and security regulations.",
      "distractor_analysis": "The distractors use words that are semantically close or related to the correct terms (e.g., Private for Personally, Protected for Identifiable, Indicator for Information) to test precise recall of the acronym&#39;s expansion. Each distractor creates a plausible-sounding but incorrect phrase.",
      "analogy": "Think of PII as your digital fingerprint – any piece of data that, alone or combined, points directly to you."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does IaaS stand for in the context of cloud computing delivery models?",
    "correct_answer": "Infrastructure as a Service",
    "distractors": [
      {
        "question_text": "Identity as a Service",
        "misconception": "Targets similar-sounding terms: Identity as a Service (IDaaS) is a valid cloud service but distinct from IaaS, testing confusion between &#39;I&#39; for Infrastructure and &#39;I&#39; for Identity."
      },
      {
        "question_text": "Information as a Service",
        "misconception": "Targets word substitution: Information is a common term in IT, but Infrastructure specifically refers to the underlying computing resources."
      },
      {
        "question_text": "Integrated as a Service",
        "misconception": "Targets concept conflation: Integrated implies a combined offering, but IaaS specifically denotes the provision of raw infrastructure components."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IaaS is a cloud computing service model where a provider offers virtualized computing resources over the internet. These resources include virtual machines, storage, networks, and operating systems, giving users high-level control over their infrastructure without managing the physical hardware.",
      "distractor_analysis": "The distractors leverage common cloud-related terms or similar-sounding words to test precise recall. &#39;Identity as a Service&#39; is a real cloud model but different. &#39;Information as a Service&#39; substitutes a key word. &#39;Integrated as a Service&#39; suggests a different type of offering.",
      "analogy": "IaaS is like renting an empty apartment: you get the structure (infrastructure) and can furnish it and install your own appliances (software and applications) as you see fit, but you don&#39;t own the building."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does the principle of &#39;least privilege&#39; primarily aim to achieve in cybersecurity?",
    "correct_answer": "Users, systems, or tools should be able to access only what they need to do their jobs, and no more.",
    "distractors": [
      {
        "question_text": "Ensuring that no single person can completely undermine the security of the entire environment.",
        "misconception": "Targets concept confusion: This describes &#39;separation of duties&#39;, a related but distinct security principle."
      },
      {
        "question_text": "Granting all necessary permissions to users by default and revoking them as needed.",
        "misconception": "Targets policy inversion: This is the opposite of least privilege, which advocates for &#39;deny by default&#39;."
      },
      {
        "question_text": "Providing users with temporary elevated access for critical tasks, then automatically revoking it.",
        "misconception": "Targets scope misunderstanding: While temporary elevation can be part of a least privilege strategy, it&#39;s not the primary definition of the principle itself."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The principle of least privilege dictates that any user, program, or process should have only the bare minimum privileges necessary to perform its function. This minimizes the potential damage from a compromise or error.",
      "distractor_analysis": "The first distractor describes &#39;separation of duties&#39;, a complementary but different security principle. The second distractor describes a &#39;grant by default&#39; policy, which is antithetical to least privilege&#39;s &#39;deny by default&#39; approach. The third distractor describes a specific implementation strategy (temporary elevation) rather than the core principle of limiting access to only what is needed.",
      "analogy": "Think of a janitor in a building. Least privilege means they only have keys to the areas they need to clean, not to the CEO&#39;s office or the server room."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does VM stand for in the context of cloud security and infrastructure?",
    "correct_answer": "Virtual Machine",
    "distractors": [
      {
        "question_text": "Vulnerability Management",
        "misconception": "Targets context confusion: While &#39;Vulnerability Management&#39; is a valid security term and mentioned in the document, &#39;VM&#39; in the context of &#39;virtual machine images&#39; refers to &#39;Virtual Machine&#39;."
      },
      {
        "question_text": "Virtual Memory",
        "misconception": "Targets similar-sounding technical terms: Virtual Memory is a computing concept but not the expansion of VM in this context."
      },
      {
        "question_text": "Volume Mount",
        "misconception": "Targets related cloud/container terms: Volume Mount is a concept in containerization and storage, but not the expansion of VM for an instance."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In cloud security and infrastructure, especially when discussing &#39;virtual machine images&#39; or &#39;VM instances&#39;, VM is the widely accepted abbreviation for Virtual Machine. A Virtual Machine is an emulation of a computer system, running on a hypervisor, and is a fundamental component of cloud computing.",
      "distractor_analysis": "The distractors leverage common acronyms or related technical terms. &#39;Vulnerability Management&#39; is a key theme of the document, making it a plausible but incorrect choice for the specific &#39;VM&#39; reference. &#39;Virtual Memory&#39; is a core computer science concept, and &#39;Volume Mount&#39; is relevant to cloud storage and containers, but neither fits the context of &#39;VM images&#39;.",
      "analogy": "Think of a VM as a digital clone of a physical computer, complete with its own operating system and applications, running inside another computer."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does DevOps stand for in the context of software development and IT operations?",
    "correct_answer": "Development Operations",
    "distractors": [
      {
        "question_text": "Developer Operations",
        "misconception": "Targets word substitution: &#39;Developer&#39; is a common role but &#39;Development&#39; refers to the broader phase of software creation."
      },
      {
        "question_text": "Deployment Operations",
        "misconception": "Targets scope confusion: Deployment is a key part of DevOps, but the acronym encompasses the entire &#39;Development&#39; lifecycle, not just deployment."
      },
      {
        "question_text": "Distributed Operations",
        "misconception": "Targets similar-sounding terms: &#39;Distributed&#39; is a concept in IT, but not what the &#39;D&#39; in DevOps stands for, despite DevOps often facilitating distributed systems."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DevOps is a set of practices that combines software Development and IT Operations. It aims to shorten the systems development life cycle and provide continuous delivery with high software quality. The name reflects the integration of these two traditionally separate functions.",
      "distractor_analysis": "The distractors play on common misunderstandings of the &#39;Dev&#39; component. &#39;Developer Operations&#39; narrows the scope to just the individual developer, &#39;Deployment Operations&#39; focuses only on the latter part of the cycle, and &#39;Distributed Operations&#39; introduces a related but incorrect concept.",
      "analogy": "DevOps is like a pit crew in racing where the engineers (Development) and mechanics (Operations) work seamlessly together to build, test, and maintain the car, rather than working in silos."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git commit -m &quot;Feature complete&quot;\ngit push origin main\n# CI/CD pipeline triggered by push\n# ... automated build, test, deploy ...",
        "context": "A typical DevOps workflow involves continuous integration/continuous delivery (CI/CD) pipelines, often triggered by code commits."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does IAM stand for in the context of cloud security, specifically within AWS?",
    "correct_answer": "Identity and Access Management",
    "distractors": [
      {
        "question_text": "Identity and Account Management",
        "misconception": "Targets term substitution: &#39;Account&#39; is a related concept but &#39;Access&#39; is the precise term for controlling permissions."
      },
      {
        "question_text": "Information and Access Management",
        "misconception": "Targets similar-sounding terms: &#39;Information&#39; starts with &#39;I&#39; and is a common security term, but &#39;Identity&#39; is correct here."
      },
      {
        "question_text": "Integrated Access Management",
        "misconception": "Targets word substitution: &#39;Integrated&#39; implies a consolidated system, which IAM is, but it&#39;s not the &#39;I&#39; in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IAM, or Identity and Access Management, is a fundamental service in cloud platforms like AWS that allows administrators to securely control who is authenticated (identity) and authorized (access) to use resources. It defines users, groups, roles, and policies to manage permissions.",
      "distractor_analysis": "The distractors test the precision of the second and third words. &#39;Account&#39; is a common concept in cloud, but IAM specifically manages &#39;Access&#39;. &#39;Information&#39; is a general security term, but &#39;Identity&#39; is key to IAM. &#39;Integrated&#39; describes a characteristic of IAM but is not part of its official expansion.",
      "analogy": "Think of IAM as the bouncer and guest list for a VIP club. The &#39;Identity&#39; is who you are (your ID), and &#39;Access Management&#39; is what parts of the club you&#39;re allowed into based on that identity (the guest list and your VIP status)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "aws iam list-users\naws iam list-roles\naws iam list-policies",
        "context": "These AWS CLI commands are used to list IAM entities, demonstrating the core components managed by Identity and Access Management."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does MFA stand for in the context of cloud security and account management?",
    "correct_answer": "Multi-Factor Authentication",
    "distractors": [
      {
        "question_text": "Multi-Function Authorization",
        "misconception": "Targets word substitution: Authorization is a related security concept but not the correct term for verifying identity."
      },
      {
        "question_text": "Managed Feature Access",
        "misconception": "Targets similar-sounding terms: &#39;Managed&#39; and &#39;Feature&#39; are common cloud terms but do not relate to the core purpose of MFA."
      },
      {
        "question_text": "Multi-Form Authentication",
        "misconception": "Targets synonym confusion: &#39;Form&#39; is a synonym for &#39;Factor&#39; but &#39;Multi-Factor&#39; is the precise and universally accepted term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Multi-Factor Authentication (MFA) is a security system that requires more than one method of authentication from independent categories of credentials to verify the user&#39;s identity for a login or other transaction. This typically involves something the user knows (password), something the user has (token, phone), and/or something the user is (biometrics).",
      "distractor_analysis": "The distractors play on common misunderstandings or similar-sounding terms. &#39;Multi-Function Authorization&#39; confuses authentication with authorization and uses &#39;Function&#39; instead of &#39;Factor&#39;. &#39;Managed Feature Access&#39; uses generic cloud terms that don&#39;t fit the context. &#39;Multi-Form Authentication&#39; uses a synonym that is not the standard, precise terminology.",
      "analogy": "MFA is like needing both a key (something you have) and a secret code (something you know) to open a safe, rather than just one or the other."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does VM stand for in the context of cloud computing and infrastructure management?",
    "correct_answer": "Virtual Machine",
    "distractors": [
      {
        "question_text": "Virtual Memory",
        "misconception": "Targets similar-sounding terms: Virtual Memory is a related computing concept but refers to memory management, not an entire computing environment."
      },
      {
        "question_text": "Volume Management",
        "misconception": "Targets concept confusion: Volume Management relates to storage, which is part of infrastructure, but VM refers to the compute instance itself."
      },
      {
        "question_text": "Validated Module",
        "misconception": "Targets acronym letter confusion: Students might guess &#39;V&#39; stands for Validated, which is a common term in IT, but incorrect here."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In cloud computing, a Virtual Machine (VM) is an emulation of a computer system. VMs are based on computer architectures and provide functionality of a physical computer. Their implementations may involve specialized hardware, software, or a combination. They are fundamental to cloud infrastructure, allowing multiple operating systems to run on a single physical server.",
      "distractor_analysis": "The distractors leverage terms that are common in computing (Virtual Memory, Volume Management) or plausible but incorrect interpretations of the letters (Validated Module). This tests precise recall of the specific term used for virtualized compute instances in cloud environments.",
      "analogy": "Think of a VM as a separate, self-contained computer running inside another computer. You can have many &#39;guest&#39; VMs on one &#39;host&#39; physical machine, each with its own operating system and applications."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "az vm create --resource-group MyResourceGroup --name MyVM --image UbuntuLTS --admin-username azureuser --generate-ssh-keys",
        "context": "This Azure CLI command creates a new Virtual Machine (VM) instance, demonstrating its role as a fundamental cloud resource."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does API stand for in the context of software and cybersecurity?",
    "correct_answer": "Application Programming Interface",
    "distractors": [
      {
        "question_text": "Application Protocol Interface",
        "misconception": "Targets term substitution: Protocol is a related concept but Programming is the correct term for how applications interact."
      },
      {
        "question_text": "Automated Program Interface",
        "misconception": "Targets similar-sounding terms: Automated sounds plausible for software interaction but Application is the correct first word."
      },
      {
        "question_text": "Advanced Programming Interface",
        "misconception": "Targets common adjective substitution: Advanced is a common descriptor but Application is the precise term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An API (Application Programming Interface) is a set of defined rules that enable different software applications to communicate with each other. It specifies how software components should interact, defining the methods and data formats that applications can use to request and exchange information.",
      "distractor_analysis": "Distractors play on common misrememberings or substitutions of words that sound similar or are related to software development, such as &#39;Protocol&#39; instead of &#39;Programming&#39;, &#39;Automated&#39; instead of &#39;Application&#39;, or &#39;Advanced&#39; as a generic descriptor.",
      "analogy": "Think of an API as a restaurant menu. You don&#39;t need to know how the kitchen works (the internal code); you just need to know what you can order (the available functions) and what you&#39;ll get back (the data format)."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "import requests\n\nresponse = requests.get(&#39;https://api.github.com/users/octocat/repos&#39;)\nprint(response.json())",
        "context": "This Python code snippet demonstrates calling a RESTful API (GitHub&#39;s API) to retrieve data, illustrating how applications interact via defined interfaces."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEV_BASICS"
    ]
  }
]