[
  {
    "question_text": "What does RBAC stand for in the context of Azure access security?",
    "correct_answer": "Role-based access control",
    "distractors": [
      {
        "question_text": "Resource-based access control",
        "misconception": "Targets similar-sounding terms: &#39;Resource&#39; is a common Azure concept and sounds plausible in place of &#39;Role&#39;."
      },
      {
        "question_text": "Role-Based Authentication Control",
        "misconception": "Targets word substitution: &#39;Authentication&#39; is a related security concept but &#39;Access&#39; is the correct term for authorization."
      },
      {
        "question_text": "Role-based Authorization Control",
        "misconception": "Targets word substitution: &#39;Authorization&#39; is a core concept, but &#39;Access&#39; is the specific term used in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RBAC, or Role-based access control, is a method of restricting system access to authorized users. It is a security mechanism that assigns permissions to users based on their role within an organization, rather than individually to each user. In Azure, it&#39;s a fundamental way to manage who has what permissions to Azure resources.",
      "distractor_analysis": "The distractors play on common confusions: substituting &#39;Resource&#39; for &#39;Role&#39; due to Azure&#39;s resource-centric nature, and replacing &#39;Access&#39; with &#39;Authentication&#39; or &#39;Authorization&#39;, which are related but distinct security functions. The key is that RBAC specifically controls &#39;access&#39; based on &#39;roles&#39;.",
      "analogy": "Think of RBAC like a company&#39;s organizational chart and job descriptions. Instead of giving every employee individual keys to every office, you give &#39;managers&#39; a master key to their department, &#39;employees&#39; a key to their specific office, and &#39;visitors&#39; only access to the lobby. The &#39;role&#39; (manager, employee, visitor) determines their &#39;access&#39;."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "In the context of Terraform and cloud infrastructure, what does IaC stand for?",
    "correct_answer": "Infrastructure as Code",
    "distractors": [
      {
        "question_text": "Integrated as Code",
        "misconception": "Targets similar-sounding terms: &#39;Integrated&#39; sounds plausible for a development context but is incorrect."
      },
      {
        "question_text": "Infrastructure and Control",
        "misconception": "Targets word substitution: &#39;Control&#39; is a related concept but not part of the exact acronym expansion."
      },
      {
        "question_text": "Information as Code",
        "misconception": "Targets initial letter confusion: &#39;Information&#39; starts with &#39;I&#39; but refers to a different domain than &#39;Infrastructure&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IaC, or Infrastructure as Code, is a practice in which infrastructure (networks, virtual machines, load balancers, etc.) is provisioned and managed using code and software development techniques, such as version control, CI/CD, and automated testing. This allows for consistent, repeatable, and scalable infrastructure deployments.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Integrated as Code&#39; uses a common development term. &#39;Infrastructure and Control&#39; substitutes a key word with a related but incorrect concept. &#39;Information as Code&#39; uses a different &#39;I&#39; word that might seem plausible in a tech context.",
      "analogy": "IaC is like having a blueprint for a building that you can automatically construct and reconstruct perfectly every time, rather than manually building it brick by brick."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "terraform init\nterraform plan\nterraform apply",
        "context": "Basic Terraform commands demonstrating the &#39;as Code&#39; approach to infrastructure management."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "CLOUD_BASICS",
      "DEV_OPS"
    ]
  },
  {
    "question_text": "Which cloud computing model is geared toward software development?",
    "correct_answer": "PaaS",
    "distractors": [
      {
        "question_text": "IaaS",
        "misconception": "Targets scope confusion: IaaS provides infrastructure, but PaaS specifically targets the development environment."
      },
      {
        "question_text": "SaaS",
        "misconception": "Targets functional misunderstanding: SaaS provides ready-to-use applications, not a development platform."
      },
      {
        "question_text": "Private",
        "misconception": "Targets deployment model confusion: Private is a deployment model, not a service model like PaaS."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PaaS, or Platform as a Service, provides a complete development and deployment environment in the cloud, with resources that enable developers to build, run, and manage applications without the complexity of building and maintaining the infrastructure typically associated with developing and launching an app.",
      "distractor_analysis": "IaaS (Infrastructure as a Service) provides virtualized computing resources over the internet, but users still manage the operating systems and applications. SaaS (Software as a Service) delivers ready-to-use applications over the internet. &#39;Private&#39; refers to a cloud deployment model, not a service model, and can host any of IaaS, PaaS, or SaaS.",
      "analogy": "If IaaS is like renting an empty lot to build a house, PaaS is like renting a fully equipped workshop where you just bring your tools and materials to build your product."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_COMPUTING"
    ]
  },
  {
    "question_text": "What does AWS IAM stand for in the context of AWS security?",
    "correct_answer": "AWS Identity and Access Management",
    "distractors": [
      {
        "question_text": "AWS Identity and Account Management",
        "misconception": "Targets word substitution: &#39;Account&#39; is a related concept but &#39;Access&#39; is the correct term for controlling permissions."
      },
      {
        "question_text": "AWS Information and Access Management",
        "misconception": "Targets similar-sounding terms: &#39;Information&#39; starts with &#39;I&#39; but &#39;Identity&#39; is the core concept of who is accessing resources."
      },
      {
        "question_text": "AWS Identity and Authorization Management",
        "misconception": "Targets synonym substitution: &#39;Authorization&#39; is a component of IAM, but &#39;Access&#39; is the broader and correct term in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AWS Identity and Access Management (IAM) is a web service that helps you securely control access to AWS resources. It allows you to manage users, groups, and roles, and define policies that determine who can access which resources and under what conditions.",
      "distractor_analysis": "Each distractor replaces a key word in the acronym with a closely related but incorrect term. &#39;Account&#39; is related to identity but not the &#39;A&#39; in IAM. &#39;Information&#39; is a common &#39;I&#39; word but &#39;Identity&#39; is specific to IAM&#39;s function. &#39;Authorization&#39; is a function of IAM, but &#39;Access&#39; is the precise term used in the acronym.",
      "analogy": "Think of AWS IAM as the bouncer and guest list for a VIP party. It verifies who you are (Identity), checks if you&#39;re on the list (Access), and then lets you into specific areas (Management) based on your permissions."
    },
    "code_snippets": [
      {
        "language": "json",
        "code": "{\n  &quot;Version&quot;: &quot;2012-10-17&quot;,\n  &quot;Statement&quot;: [\n    {\n      &quot;Effect&quot;: &quot;Allow&quot;,\n      &quot;Action&quot;: [\n        &quot;s3:GetObject&quot;\n      ],\n      &quot;Resource&quot;: [\n        &quot;arn:aws:s3:::my-bucket/*&quot;\n      ]\n    }\n  ]\n}",
        "context": "This is an example of an AWS IAM policy document, which defines permissions for users, groups, or roles to access AWS resources like an S3 bucket."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "CLOUD_AWS"
    ]
  },
  {
    "question_text": "What does CI/CD stand for in the context of software development and cloud deployments?",
    "correct_answer": "Continuous Integration/Continuous Delivery",
    "distractors": [
      {
        "question_text": "Continuous Integration/Continuous Deployment",
        "misconception": "Targets term substitution: &#39;Delivery&#39; and &#39;Deployment&#39; are often used interchangeably, but &#39;Delivery&#39; is the broader concept encompassing deployment readiness."
      },
      {
        "question_text": "Centralized Integration/Continuous Delivery",
        "misconception": "Targets letter confusion: &#39;C&#39; for Centralized instead of Continuous, which changes the core philosophy of the methodology."
      },
      {
        "question_text": "Cloud Integration/Cloud Deployment",
        "misconception": "Targets domain conflation: While CI/CD is heavily used in cloud, the &#39;C&#39; does not stand for Cloud, but rather Continuous."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CI/CD is a methodology that introduces continuous automation and continuous monitoring throughout the lifecycle of applications, from integration and testing phases to delivery and deployment. Continuous Integration (CI) involves frequently merging code changes into a central repository where automated builds and tests are run. Continuous Delivery (CD) extends CI by ensuring that all code changes are automatically built, tested, and prepared for a release to production, making it possible to deploy to production at any time.",
      "distractor_analysis": "The distractors target common misunderstandings: confusing &#39;Delivery&#39; with &#39;Deployment&#39; (where Delivery implies readiness for deployment, while Deployment is the actual act), misinterpreting the &#39;C&#39; as &#39;Centralized&#39; or &#39;Cloud&#39; due to the context of modern development practices.",
      "analogy": "Think of CI/CD like an automated assembly line for software. CI is the part where all new components are constantly added and tested to make sure they fit together. CD is the part that packages the product and gets it ready to be shipped to the customer at a moment&#39;s notice."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git push origin main\n# CI pipeline triggered automatically\n# Build, test, package\n# CD pipeline prepares for release",
        "context": "A typical CI/CD workflow starts with a code commit, triggering automated pipelines for building, testing, and preparing for deployment."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEV_OPS"
    ]
  },
  {
    "question_text": "What does `veth` stand for in the context of Linux networking for containers?",
    "correct_answer": "Virtual Ethernet",
    "distractors": [
      {
        "question_text": "Virtual Endpoint Host",
        "misconception": "Targets similar-sounding terms: &#39;Endpoint&#39; and &#39;Host&#39; are related to networking but not part of the exact expansion."
      },
      {
        "question_text": "Validated Ethernet",
        "misconception": "Targets word substitution: &#39;Validated&#39; sounds like a security-related term but is incorrect for this specific acronym."
      },
      {
        "question_text": "Virtual Extended Host",
        "misconception": "Targets letter confusion: &#39;Extended&#39; and &#39;Host&#39; are plausible but incorrect substitutions for the &#39;E&#39; and &#39;H&#39; in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "`veth` refers to a Virtual Ethernet interface, which is a crucial component in container networking. It creates a pair of connected virtual network interfaces, allowing communication between different network namespaces, such as a container&#39;s namespace and the host&#39;s default namespace.",
      "distractor_analysis": "The distractors use words that are common in networking or security contexts (Endpoint, Host, Validated, Extended) but are not part of the precise expansion of `veth`. This tests whether the student knows the exact technical term rather than just general networking concepts.",
      "analogy": "`veth` is like a virtual network cable with two ends. One end plugs into the container&#39;s network, and the other end plugs into the host&#39;s network, enabling them to communicate as if they were physically connected."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "ip link add ve1 netns 28586 type veth peer name ve2 netns 1",
        "context": "This command demonstrates how to create a `veth` pair to connect a process in a new network namespace (representing a container) to the host&#39;s default network namespace."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CONTAINER_SECURITY"
    ]
  },
  {
    "question_text": "What does the acronym CVE stand for in the context of cybersecurity?",
    "correct_answer": "Common Vulnerabilities and Exposures",
    "distractors": [
      {
        "question_text": "Common Vulnerability Enumeration",
        "misconception": "Targets word substitution: &#39;Enumeration&#39; is a related concept in security (e.g., port enumeration) but &#39;Exposures&#39; is the correct term for the &#39;E&#39; in CVE."
      },
      {
        "question_text": "Critical Vulnerability and Exploits",
        "misconception": "Targets word substitution and scope: &#39;Critical&#39; implies severity, which is often associated with CVEs but not part of the name. &#39;Exploits&#39; are related but &#39;Exposures&#39; is the correct term."
      },
      {
        "question_text": "Centralized Vulnerability and Events",
        "misconception": "Targets letter confusion and concept conflation: &#39;Centralized&#39; is plausible for a database, but &#39;Common&#39; is correct. &#39;Events&#39; is a term from SIEM, not CVE."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CVE (Common Vulnerabilities and Exposures) is a list of publicly disclosed cybersecurity vulnerabilities. Each CVE entry is a unique identifier for a specific vulnerability, allowing for standardized tracking and communication about security flaws across different security products and services.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Enumeration&#39; is a common security term but incorrect here. &#39;Critical&#39; and &#39;Exploits&#39; are closely related to vulnerabilities but are not part of the official acronym. &#39;Centralized&#39; and &#39;Events&#39; introduce terms from other security domains, testing if the student can distinguish between related but distinct concepts.",
      "analogy": "Think of CVEs as a universal catalog number for known security flaws, like an ISBN for books. It doesn&#39;t tell you if the book is good or bad, but it gives it a unique identifier so everyone can refer to the same book."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does OCI stand for in the context of container technologies?",
    "correct_answer": "Open Container Initiative",
    "distractors": [
      {
        "question_text": "Open Cloud Interface",
        "misconception": "Targets similar-sounding terms: &#39;Cloud&#39; is a common term in container environments, leading to confusion with &#39;Container&#39;"
      },
      {
        "question_text": "Operating Container Interface",
        "misconception": "Targets word substitution: &#39;Operating&#39; is a plausible verb for containers, but &#39;Open&#39; refers to the standard&#39;s nature"
      },
      {
        "question_text": "Orchestration Container Initiative",
        "misconception": "Targets concept conflation: &#39;Orchestration&#39; is closely related to container management (e.g., Kubernetes) but not part of the OCI standard&#39;s name"
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Open Container Initiative (OCI) is a Linux Foundation project that aims to create open industry standards around container formats and runtimes. Its primary goal is to ensure portability and interoperability of container technologies across different platforms and vendors.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Open Cloud Interface&#39; substitutes &#39;Container&#39; with &#39;Cloud&#39;, a related but incorrect domain. &#39;Operating Container Interface&#39; replaces &#39;Open&#39; with &#39;Operating&#39;, a plausible but wrong verb. &#39;Orchestration Container Initiative&#39; conflates OCI with container orchestration concepts, which are distinct.",
      "analogy": "Think of OCI as the &#39;USB standard&#39; for containers. Just like USB ensures any USB device works with any USB port, OCI ensures any OCI-compliant container image can run on any OCI-compliant runtime, regardless of who created them."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of an OCI-compliant runtime (runc) being used\nsudo runc run my_container_id",
        "context": "runc is a common OCI-compliant container runtime that executes containers based on OCI specifications."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "CONTAINER_BASICS"
    ]
  },
  {
    "question_text": "What does the acronym Notary refer to in the context of container image security?",
    "correct_answer": "Notary",
    "distractors": [
      {
        "question_text": "A system for Network Orchestration and Trust Assurance for Repositories",
        "misconception": "Targets term substitution: Substitutes &#39;Notary&#39; with a plausible-sounding but incorrect expansion related to network orchestration and trust."
      },
      {
        "question_text": "A tool for Node and Orchestration Trust and Repository Assurance",
        "misconception": "Targets word order and substitution: Rearranges words and uses &#39;Node&#39; and &#39;Orchestration&#39; which are related to container environments but not part of the tool&#39;s name."
      },
      {
        "question_text": "A framework for Notarization of Artifacts and Repository Integrity",
        "misconception": "Targets conceptual confusion: While Notary provides notarization and integrity, it is a proper noun, not an acronym with this expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Notary is a proper noun, specifically the name of an open-source tool developed by Docker (now part of the Cloud Native Computing Foundation) that provides content trust for container images. It allows users to cryptographically sign and verify images, ensuring their authenticity and integrity. It is not an acronym.",
      "distractor_analysis": "The question is a trick question designed to test if the user understands that Notary is a proper noun, not an acronym. The distractors are crafted to sound like plausible acronym expansions related to container security, leveraging terms like &#39;network orchestration,&#39; &#39;trust assurance,&#39; &#39;node,&#39; &#39;repository,&#39; and &#39;artifact integrity&#39; to mislead those who assume it must be an acronym.",
      "analogy": "Think of Notary like &#39;Docker&#39; or &#39;Kubernetes&#39; – they are names of specific tools or projects, not acronyms that expand into longer phrases. Just as you wouldn&#39;t expand &#39;Docker&#39; into &#39;Distributed Orchestration Container Kernel for Enterprise Resources&#39;, Notary is simply &#39;Notary&#39;."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "export DOCKER_CONTENT_TRUST=1\ndocker pull some/image:latest\n# If the image is not signed, the pull will fail with DOCKER_CONTENT_TRUST enabled.",
        "context": "Notary&#39;s functionality is often integrated with Docker Content Trust, which enforces signature verification for pulled images."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does YAML stand for in the context of configuration files for container orchestrators?",
    "correct_answer": "YAML Ain&#39;t Markup Language",
    "distractors": [
      {
        "question_text": "Yet Another Markup Language",
        "misconception": "Targets historical confusion: This was an earlier, less accurate expansion that is still commonly remembered."
      },
      {
        "question_text": "YAML Abstract Markup Language",
        "misconception": "Targets word substitution: &#39;Abstract&#39; sounds plausible for a configuration language but is incorrect."
      },
      {
        "question_text": "YAML Application Markup Language",
        "misconception": "Targets domain-specific substitution: &#39;Application&#39; is relevant to the context but not part of the acronym&#39;s expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "YAML is a human-friendly data serialization standard often used for configuration files. Its recursive acronym, &#39;YAML Ain&#39;t Markup Language,&#39; emphasizes its data-oriented nature over document markup, distinguishing it from languages like XML or HTML.",
      "distractor_analysis": "The primary distractor, &#39;Yet Another Markup Language,&#39; was an initial expansion of YAML, making it a common point of confusion. The other distractors use plausible but incorrect words that fit the general context of configuration or application development.",
      "analogy": "Think of YAML as a structured way to write down instructions or settings, like a recipe. The name &#39;YAML Ain&#39;t Markup Language&#39; is like saying &#39;This isn&#39;t just a pretty document, it&#39;s a precise set of data!&#39;"
    },
    "code_snippets": [
      {
        "language": "yaml",
        "code": "apiVersion: v1\nkind: Pod\nmetadata:\n  name: my-app\nspec:\n  containers:\n  - name: my-container\n    image: nginx:latest",
        "context": "Example of a Kubernetes Pod definition using YAML, demonstrating its structure for defining containerized applications."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In the context of container security and deployment, what does CI stand for?",
    "correct_answer": "Continuous Integration",
    "distractors": [
      {
        "question_text": "Container Isolation",
        "misconception": "Targets domain-specific confusion: While relevant to container security, CI refers to a development practice, not a security mechanism."
      },
      {
        "question_text": "Centralized Intelligence",
        "misconception": "Targets similar-sounding but unrelated concept: &#39;Centralized Intelligence&#39; is a plausible-sounding IT term but not the correct expansion for CI in this context."
      },
      {
        "question_text": "Code Integration",
        "misconception": "Targets partial understanding: &#39;Code Integration&#39; is part of CI but misses the &#39;Continuous&#39; aspect, which is crucial for the methodology."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CI, or Continuous Integration, is a software development practice where developers frequently merge their code changes into a central repository. Automated builds and tests are then run. This practice is often part of a larger CI/CD pipeline, aiming to detect integration errors early and improve software quality and delivery speed.",
      "distractor_analysis": "The distractors are designed to test precise knowledge of CI. &#39;Container Isolation&#39; is a concept within the document&#39;s domain but not the meaning of CI. &#39;Centralized Intelligence&#39; sounds like a technical term but is incorrect. &#39;Code Integration&#39; is a component of CI but lacks the &#39;Continuous&#39; aspect, which defines the methodology.",
      "analogy": "Think of CI like a team constantly building a LEGO castle: every time someone adds a new piece, they immediately try to connect it to the main structure and check if it still stands, rather than waiting until the whole castle is &#39;finished&#39; to find out it&#39;s unstable."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git push origin main\n# CI pipeline triggered automatically on push\n# ... runs tests, builds image, scans for vulnerabilities ...",
        "context": "A common trigger for a CI pipeline is a code push to a version control system, initiating automated checks and builds."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEV_OPS_BASICS"
    ]
  },
  {
    "question_text": "What does CI stand for in the context of a GitOps or DevOps pipeline?",
    "correct_answer": "Continuous Integration",
    "distractors": [
      {
        "question_text": "Continuous Improvement",
        "misconception": "Targets similar-sounding terms: &#39;Improvement&#39; is a general business concept often associated with processes, but &#39;Integration&#39; is the specific technical practice."
      },
      {
        "question_text": "Code Integration",
        "misconception": "Targets partial understanding: While code is integrated, &#39;Continuous&#39; is a crucial part of the methodology&#39;s name and purpose."
      },
      {
        "question_text": "Centralized Integration",
        "misconception": "Targets incorrect adjective: &#39;Centralized&#39; is a plausible descriptor for some systems, but not the &#39;C&#39; in CI."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Continuous Integration (CI) is a DevOps practice where developers frequently merge their code changes into a central repository. Automated builds and tests are then run to detect integration errors early and quickly. This ensures that the codebase remains in a consistently working state.",
      "distractor_analysis": "The distractors target common misunderstandings: &#39;Continuous Improvement&#39; is a general concept, &#39;Code Integration&#39; misses the &#39;Continuous&#39; aspect, and &#39;Centralized Integration&#39; uses an incorrect adjective, testing the precise recall of the acronym&#39;s expansion.",
      "analogy": "Think of CI like a team working on a puzzle. Instead of each person doing a large section alone and trying to fit them all together at the end (which often leads to big problems), CI means everyone adds a few pieces at a time, and the system immediately checks if the new pieces fit with what&#39;s already there."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git push origin feature-branch\n# CI pipeline automatically triggered by push\n# ... runs tests, builds artifact ...",
        "context": "A typical CI workflow where a &#39;git push&#39; triggers an automated build and test pipeline."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEV_OPS_BASICS"
    ]
  },
  {
    "question_text": "What does WAF stand for in the context of container security and API firewalls?",
    "correct_answer": "Web Application Firewall",
    "distractors": [
      {
        "question_text": "Wireless Access Filter",
        "misconception": "Targets similar-sounding terms: &#39;Wireless Access&#39; is a common networking term, and &#39;Filter&#39; is a plausible function for a security device."
      },
      {
        "question_text": "Web Access Firewall",
        "misconception": "Targets word substitution: &#39;Access&#39; is close to &#39;Application&#39; but changes the specific layer of protection."
      },
      {
        "question_text": "Web Application Filter",
        "misconception": "Targets word substitution: &#39;Filter&#39; is a common term for traffic control but &#39;Firewall&#39; implies a more comprehensive security device."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Web Application Firewall (WAF) is a specific type of firewall that protects web applications from various attacks by filtering and monitoring HTTP traffic between a web application and the Internet. It operates at Layer 7 (the application layer) of the OSI model.",
      "distractor_analysis": "The distractors test precise recall of the &#39;Application&#39; and &#39;Firewall&#39; components. &#39;Wireless Access Filter&#39; introduces unrelated networking terms. &#39;Web Access Firewall&#39; substitutes &#39;Application&#39; with &#39;Access&#39;, which is too generic. &#39;Web Application Filter&#39; replaces &#39;Firewall&#39; with &#39;Filter&#39;, which, while related, doesn&#39;t convey the full scope of a WAF&#39;s protective capabilities.",
      "analogy": "Think of a WAF as a bouncer for your website&#39;s front door. It checks everyone trying to get in (HTTP requests) against a list of known bad behaviors and only lets legitimate visitors (safe requests) through to the application."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does IPTABLES refer to in the context of Linux networking and container security?",
    "correct_answer": "A user-space utility program that allows a system administrator to configure the IP packet filter rules of the Linux kernel firewall",
    "distractors": [
      {
        "question_text": "A kernel module that provides stateful packet filtering for network traffic in Linux",
        "misconception": "Targets functional confusion: IPTABLES is the user-space utility, not the kernel module itself (which is netfilter). Students might confuse the tool with the underlying kernel component."
      },
      {
        "question_text": "An API for defining network policies in Kubernetes that are then enforced by container runtimes",
        "misconception": "Targets scope confusion: While IPTABLES is used to implement Kubernetes NetworkPolicies, it is a general Linux utility, not specific to Kubernetes or an API for it."
      },
      {
        "question_text": "A command-line tool for managing routing tables and network interfaces in Linux systems",
        "misconception": "Targets similar-sounding tools: Students might confuse IPTABLES with other network configuration tools like `ip route` or `ifconfig` which manage routing and interfaces, not packet filtering rules."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IPTABLES is a command-line utility that interacts with the netfilter framework in the Linux kernel. It allows administrators to define rules for filtering, modifying, and routing network packets. In container security, it&#39;s often used by networking plugins to enforce network policies, such as those defined in Kubernetes, by translating high-level policies into low-level packet filtering rules.",
      "distractor_analysis": "The first distractor incorrectly identifies IPTABLES as the kernel module itself, rather than the user-space tool that configures it. The second distractor misrepresents IPTABLES as a Kubernetes-specific API, when it&#39;s a foundational Linux tool. The third distractor confuses IPTABLES&#39;s packet filtering role with other network management tasks like routing table manipulation.",
      "analogy": "Think of IPTABLES as the remote control for your TV (the netfilter firewall). You use the remote to change channels (filter packets), but the remote itself isn&#39;t the TV&#39;s internal electronics."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sudo iptables -A INPUT -p tcp --dport 22 -j ACCEPT",
        "context": "Example of using the `iptables` command to add a rule to the INPUT chain, allowing incoming TCP traffic on port 22 (SSH)."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "LINUX_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does CNI stand for in the context of Kubernetes network plugins?",
    "correct_answer": "Container Network Interface",
    "distractors": [
      {
        "question_text": "Container Network Integration",
        "misconception": "Targets word substitution: &#39;Integration&#39; sounds plausible as plugins integrate with Kubernetes, but &#39;Interface&#39; is the correct term for the standard."
      },
      {
        "question_text": "Container Node Interface",
        "misconception": "Targets scope confusion: &#39;Node&#39; is a component in Kubernetes, but CNI specifically refers to the network aspect, not the node itself."
      },
      {
        "question_text": "Common Network Interface",
        "misconception": "Targets initialism confusion: &#39;Common&#39; is a common word, but &#39;Container&#39; is specific to the technology CNI addresses."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CNI, or Container Network Interface, is a Cloud Native Computing Foundation (CNCF) project that consists of a specification and libraries for writing plugins to configure network interfaces in Linux containers. It defines a common interface between network providers and container runtimes, allowing for interoperability and flexibility in container networking within environments like Kubernetes.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Container Network Integration&#39; replaces &#39;Interface&#39; with a functionally similar but incorrect word. &#39;Container Node Interface&#39; incorrectly narrows the scope to nodes rather than the broader network interface for containers. &#39;Common Network Interface&#39; misidentifies the &#39;C&#39; in CNI, replacing &#39;Container&#39; with a generic term.",
      "analogy": "Think of CNI as a standardized electrical outlet for container networking. Any network plugin that adheres to the CNI specification can &#39;plug in&#39; and provide networking for containers, just like any appliance can plug into a standard outlet."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of a CNI configuration file snippet\n{\n  &quot;cniVersion&quot;: &quot;0.3.1&quot;,\n  &quot;name&quot;: &quot;mynet&quot;,\n  &quot;type&quot;: &quot;bridge&quot;,\n  &quot;bridge&quot;: &quot;cni0&quot;,\n  &quot;isGateway&quot;: true,\n  &quot;ipMasq&quot;: true,\n  &quot;ipam&quot;: {\n    &quot;type&quot;: &quot;host-local&quot;,\n    &quot;subnet&quot;: &quot;10.22.0.0/16&quot;\n  }\n}",
        "context": "CNI plugins are configured via JSON files that specify network parameters and plugin types."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In the context of vulnerability management, what does EDR stand for?",
    "correct_answer": "Endpoint Detection and Response",
    "distractors": [
      {
        "question_text": "Endpoint Data and Recovery",
        "misconception": "Targets word substitution: &#39;Data&#39; and &#39;Recovery&#39; are related to security but not the core function of EDR, which is active detection and response."
      },
      {
        "question_text": "Event Detection and Reporting",
        "misconception": "Targets similar-sounding terms: &#39;Event&#39; and &#39;Reporting&#39; are close but miss the &#39;Endpoint&#39; focus and the &#39;Response&#39; action of EDR."
      },
      {
        "question_text": "Enhanced Detection and Remediation",
        "misconception": "Targets synonym substitution: &#39;Enhanced&#39; and &#39;Remediation&#39; are plausible but not the exact, standardized terms in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "EDR (Endpoint Detection and Response) refers to a cybersecurity solution that continuously monitors and collects data from endpoint devices (like laptops, servers, and mobile devices) to detect and investigate suspicious activity, and then provides automated or manual response capabilities to mitigate threats.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Endpoint Data and Recovery&#39; replaces &#39;Detection and Response&#39; with related but incorrect concepts. &#39;Event Detection and Reporting&#39; shifts the focus from &#39;Endpoint&#39; and replaces &#39;Response&#39; with &#39;Reporting&#39;. &#39;Enhanced Detection and Remediation&#39; uses synonyms that are close in meaning but not the exact terms of the acronym, testing for precise memorization.",
      "analogy": "Think of EDR as a security guard specifically assigned to each individual office (endpoint) in a building. It not only watches for intruders (detection) but also has the authority to lock doors or call for backup (response) when a threat is identified."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does AAA stand for in the context of identity and access management?",
    "correct_answer": "Authentication, Authorization and Accounting",
    "distractors": [
      {
        "question_text": "Authentication, Authorization, and Auditing",
        "misconception": "Targets term substitution: Auditing is a related security concept but Accounting is the correct term in AAA, referring to tracking resource usage."
      },
      {
        "question_text": "Access, Authorization, and Accounting",
        "misconception": "Targets initial letter confusion: Access is a common IAM term but Authentication is the correct first &#39;A&#39; in AAA."
      },
      {
        "question_text": "Authentication, Access, and Administration",
        "misconception": "Targets concept conflation: Access and Administration are related to IAM but do not form part of the standard AAA framework."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AAA is a framework for intelligently controlling access to computer resources, enforcing policies, auditing usage, and providing the information necessary to bill for services. Authentication verifies the identity of a user or device, Authorization determines what an authenticated user or device is permitted to do, and Accounting tracks the resources consumed by the user or device.",
      "distractor_analysis": "Distractors replace one of the &#39;A&#39;s with a related but incorrect term (Auditing, Access, Administration), testing the precise recall of the three distinct components of the AAA framework.",
      "analogy": "Think of AAA like a bouncer, a guest list, and a bar tab at a club: Authentication is showing your ID to the bouncer, Authorization is checking the guest list to see where you can go, and Accounting is keeping track of what drinks you ordered."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "IAM_BASICS"
    ]
  },
  {
    "question_text": "What does IDaaS stand for in the context of identity and access management?",
    "correct_answer": "Identity as a Service",
    "distractors": [
      {
        "question_text": "Identity and Access as a Service",
        "misconception": "Targets extra word: Students might add &#39;Access&#39; due to its common pairing with Identity in IAM, but it&#39;s not part of the IDaaS acronym."
      },
      {
        "question_text": "Integrated Directory as a Service",
        "misconception": "Targets letter confusion: &#39;I&#39; for Integrated instead of Identity, and &#39;D&#39; for Directory instead of &#39;as a&#39; (which is not a single word)."
      },
      {
        "question_text": "Information Data as a Service",
        "misconception": "Targets domain confusion: Students might associate &#39;ID&#39; with Information Data, which is a different concept in IT."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IDaaS, or Identity as a Service, refers to a third-party service that provides identity and access management (IAM) capabilities, often delivered via the cloud. It enables organizations to outsource their identity management infrastructure, providing features like single sign-on (SSO) for cloud applications.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Identity and Access as a Service&#39; adds an extra, albeit related, word. &#39;Integrated Directory as a Service&#39; misinterprets the &#39;I&#39; and &#39;D&#39; letters. &#39;Information Data as a Service&#39; shifts the context entirely to data management rather than identity.",
      "analogy": "Think of IDaaS like a cloud-based concierge for your digital identity. Instead of managing all your keys and access cards yourself for every building (application), you have one trusted service that handles it all for you across different locations."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does IAM stand for in the context of cloud computing and cybersecurity?",
    "correct_answer": "Identity and Access Management",
    "distractors": [
      {
        "question_text": "Information and Access Management",
        "misconception": "Targets word substitution: &#39;Information&#39; is a common security term but incorrect here, confusing it with data management."
      },
      {
        "question_text": "Identity and Authorization Management",
        "misconception": "Targets term substitution: &#39;Authorization&#39; is a related concept but &#39;Access&#39; is the broader term encompassing both authentication and authorization decisions."
      },
      {
        "question_text": "Integrated Access Management",
        "misconception": "Targets acronym letter confusion: &#39;I&#39; for &#39;Integrated&#39; is plausible but incorrect, missing the core concept of identity."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IAM (Identity and Access Management) is a framework of policies and technologies that enables an organization to manage digital identities and control access to resources. It ensures that the right entities (users, services, devices) have the right access to the right resources at the right time.",
      "distractor_analysis": "Distractors play on common confusions: substituting &#39;Identity&#39; with &#39;Information&#39; (a general security term), replacing &#39;Access&#39; with &#39;Authorization&#39; (a component of access control), or misinterpreting the &#39;I&#39; as &#39;Integrated&#39; instead of &#39;Identity&#39;.",
      "analogy": "IAM is like a bouncer and a guest list for a club. The bouncer (authentication) verifies your ID (identity), and the guest list (access management) determines which areas of the club you&#39;re allowed into (resources)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "aws iam create-user --user-name my-new-user\naws iam attach-user-policy --user-name my-new-user --policy-arn arn:aws:iam::aws:policy/ReadOnlyAccess",
        "context": "Example AWS CLI commands for creating an IAM user and attaching a policy, demonstrating how IAM controls access to cloud resources."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "CLOUD_SECURITY"
    ]
  },
  {
    "question_text": "In the context of Kubernetes security, what does RBAC stand for?",
    "correct_answer": "Role-Based Access Control",
    "distractors": [
      {
        "question_text": "Resource-Based Access Control",
        "misconception": "Targets term substitution: &#39;Resource&#39; is a key concept in Kubernetes but not the &#39;R&#39; in RBAC, which refers to &#39;Role&#39;."
      },
      {
        "question_text": "Role-Based Authentication Control",
        "misconception": "Targets concept confusion: &#39;Authentication&#39; is distinct from &#39;Authorization&#39; and &#39;Access Control&#39;, though related in the security flow."
      },
      {
        "question_text": "Rule-Based Access Control",
        "misconception": "Targets similar-sounding terms: &#39;Rule&#39; sounds plausible for defining permissions but &#39;Role&#39; is the precise term for grouping permissions."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RBAC (Role-Based Access Control) is a method of regulating access to computer or network resources based on the roles of individual users within an enterprise. In Kubernetes, RBAC policies define who (users or service accounts) can perform what actions (verbs like &#39;get&#39;, &#39;create&#39;, &#39;delete&#39;) on which resources (pods, deployments, services) in which namespaces.",
      "distractor_analysis": "The distractors target common misunderstandings: confusing &#39;Role&#39; with &#39;Resource&#39; (a key Kubernetes object), substituting &#39;Access Control&#39; with &#39;Authentication Control&#39; (a different security phase), and replacing &#39;Role&#39; with &#39;Rule&#39; (a plausible but incorrect synonym).",
      "analogy": "Think of RBAC like a company&#39;s organizational chart and job descriptions. Instead of giving each employee individual keys to every office, you give them a &#39;role&#39; (e.g., &#39;Manager&#39;, &#39;Developer&#39;, &#39;HR&#39;) and that role automatically grants them access to the offices and tools relevant to their job."
    },
    "code_snippets": [
      {
        "language": "yaml",
        "code": "apiVersion: rbac.authorization.k8s.io/v1\nkind: Role\nmetadata:\n  namespace: default\n  name: pod-reader\nrules:\n- apiGroups: [&quot;&quot;] # &quot;&quot; indicates the core API group\n  resources: [&quot;pods&quot;]\n  verbs: [&quot;get&quot;, &quot;watch&quot;, &quot;list&quot;]",
        "context": "This YAML snippet defines a Kubernetes Role named &#39;pod-reader&#39; that grants permissions to &#39;get&#39;, &#39;watch&#39;, and &#39;list&#39; pods within the &#39;default&#39; namespace. This is a fundamental component of RBAC."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does RBAC stand for in the context of Kubernetes authorization?",
    "correct_answer": "Role-Based Access Control",
    "distractors": [
      {
        "question_text": "Resource-Based Access Control",
        "misconception": "Targets term substitution: &#39;Resource&#39; is a common concept in Kubernetes, but &#39;Role&#39; is the correct term for defining permissions."
      },
      {
        "question_text": "Rule-Based Access Control",
        "misconception": "Targets similar-sounding terms: &#39;Rule&#39; sounds like it could define access, but &#39;Role&#39; is the specific and correct term in RBAC."
      },
      {
        "question_text": "Role-Based Authentication Control",
        "misconception": "Targets concept confusion: &#39;Authentication&#39; is distinct from &#39;Authorization&#39;, and RBAC specifically deals with authorization."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RBAC (Role-Based Access Control) is a method of regulating access to computer or network resources based on the roles of individual users within an enterprise. In Kubernetes, RBAC allows administrators to define granular permissions for users and service accounts by assigning them specific roles, which then grant access to Kubernetes resources.",
      "distractor_analysis": "The distractors test precise recall of the acronym. &#39;Resource-Based&#39; and &#39;Rule-Based&#39; are plausible as they relate to access control mechanisms but are not the exact &#39;Role-Based&#39;. &#39;Role-Based Authentication Control&#39; incorrectly substitutes &#39;Authorization&#39; with &#39;Authentication&#39;, confusing two distinct security concepts.",
      "analogy": "Think of RBAC like a company&#39;s organizational chart for permissions. Instead of giving each employee individual keys to every room, you give them a &#39;role&#39; (e.g., &#39;Manager&#39;, &#39;Developer&#39;, &#39;HR&#39;), and each role has a specific set of keys (permissions) to access certain rooms (resources)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "kubectl create role pod-reader --verb=get --resource=pods\nkubectl create rolebinding pod-readers-binding --role=pod-reader --user=jane",
        "context": "Example of creating a Kubernetes Role and RoleBinding to grant &#39;jane&#39; read access to pods using RBAC."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does OpenSCAP stand for in the context of security assessment tools?",
    "correct_answer": "Open Source Content Automation Protocol",
    "distractors": [
      {
        "question_text": "Open Security Content Assessment Protocol",
        "misconception": "Targets word substitution: &#39;Security&#39; is a common association but &#39;Source&#39; is correct, indicating its open-source nature."
      },
      {
        "question_text": "Open System Compliance Automation Protocol",
        "misconception": "Targets concept conflation: &#39;System Compliance&#39; is related to SCAP&#39;s function but &#39;Source Content&#39; is the precise term."
      },
      {
        "question_text": "Open Standard for Configuration and Assessment Procedures",
        "misconception": "Targets similar-sounding terms: &#39;Standard&#39; and &#39;Procedures&#39; are plausible but incorrect, missing &#39;Content Automation Protocol&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "OpenSCAP is an open-source implementation of the Security Content Automation Protocol (SCAP). It provides a standardized approach for maintaining the security of enterprise systems, including vulnerability management, policy compliance, and security auditing. The &#39;Content Automation Protocol&#39; part refers to its ability to automate the use of security content (like vulnerability definitions and configuration checklists).",
      "distractor_analysis": "Distractors play on common misinterpretations: substituting &#39;Source&#39; with &#39;Security&#39; due to the tool&#39;s purpose, replacing &#39;Content&#39; with &#39;System Compliance&#39; which describes its goal, and using &#39;Standard&#39; and &#39;Procedures&#39; which are related but not part of the exact acronym.",
      "analogy": "Think of OpenSCAP as an automated security checklist and auditor for your systems, using a universally understood language (SCAP) to ensure everything is configured correctly and securely."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "oscap oval eval --report report.html /usr/share/openscap/scap-security-guide/ssg-rhel8-ds.xml",
        "context": "Example command to evaluate a system against an OVAL definition using OpenSCAP."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does CVE stand for in the context of reporting software vulnerabilities?",
    "correct_answer": "Common Vulnerabilities and Exposures",
    "distractors": [
      {
        "question_text": "Common Vulnerability Enumeration",
        "misconception": "Targets word substitution: &#39;Enumeration&#39; is a related concept but &#39;Exposures&#39; is the correct term, indicating the broader scope of security weaknesses."
      },
      {
        "question_text": "Critical Vulnerability and Exploits",
        "misconception": "Targets term substitution and scope: &#39;Critical&#39; is a severity level, not part of the name, and &#39;Exploits&#39; refers to the attack, not the vulnerability itself."
      },
      {
        "question_text": "Centralized Vulnerability and Events",
        "misconception": "Targets letter confusion and scope: &#39;Centralized&#39; is incorrect for &#39;C&#39;, and &#39;Events&#39; is too broad, not specific to vulnerabilities."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CVE (Common Vulnerabilities and Exposures) is a list of publicly disclosed cybersecurity vulnerabilities and exposures. It provides a common identifier for each vulnerability, allowing security professionals to easily share and discuss information about specific security flaws.",
      "distractor_analysis": "The distractors test precise recall of the terms &#39;Exposures&#39; versus &#39;Enumeration&#39;, and &#39;Vulnerabilities&#39; versus &#39;Exploits&#39; or &#39;Events&#39;. They also test for common misinterpretations of the &#39;C&#39; in CVE.",
      "analogy": "Think of CVE as a unique serial number for every known security flaw, like a product ID for a defective part. It doesn&#39;t fix the flaw, but it helps everyone talk about the same specific problem."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "VULN_MGMT"
    ]
  },
  {
    "question_text": "What does RBAC stand for in the context of operating system security?",
    "correct_answer": "Role-Based Access Control",
    "distractors": [
      {
        "question_text": "Rule-Based Access Control",
        "misconception": "Targets similar-sounding terms: &#39;Rule&#39; sounds plausible as access is often governed by rules, but &#39;Role&#39; is the correct term for grouping permissions."
      },
      {
        "question_text": "Resource-Based Access Control",
        "misconception": "Targets scope confusion: While access control applies to resources, &#39;Resource-Based&#39; is not the standard term for this model, which focuses on user roles."
      },
      {
        "question_text": "Role-Based Authentication Control",
        "misconception": "Targets concept conflation: Authentication is a distinct security concept from Access Control, though often used together."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RBAC is a method of restricting system access to authorized users based on their role within an organization. Instead of assigning permissions directly to individual users, permissions are grouped into roles, and users are then assigned to one or more roles. This simplifies management and enforces the principle of least privilege.",
      "distractor_analysis": "The distractors target common misunderstandings: &#39;Rule-Based&#39; is a plausible but incorrect alternative, as RBAC is about roles, not just rules. &#39;Resource-Based&#39; shifts the focus from the user&#39;s role to the resource itself, which is not the defining characteristic of RBAC. &#39;Authentication Control&#39; confuses access control (what you can do) with authentication (who you are).",
      "analogy": "Think of RBAC like job titles in a company. A &#39;Manager&#39; role has certain permissions (e.g., approve expenses), while an &#39;Employee&#39; role has different ones (e.g., submit expenses). You get permissions by being assigned a job title (role), not by being granted individual permissions for every task."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "OS_SECURITY"
    ]
  },
  {
    "question_text": "What does LXC stand for in the context of Linux container technology?",
    "correct_answer": "Linux Containers",
    "distractors": [
      {
        "question_text": "Linux Container eXtension",
        "misconception": "Targets common &#39;X&#39; for eXtension: Many acronyms use &#39;X&#39; to denote extension or extra features, leading to this plausible but incorrect guess."
      },
      {
        "question_text": "Lightweight X-platform Containers",
        "misconception": "Targets descriptive but incorrect terms: &#39;Lightweight&#39; and &#39;X-platform&#39; describe container characteristics but are not part of the official expansion."
      },
      {
        "question_text": "Linux eXecution Containers",
        "misconception": "Targets functional but inaccurate term: &#39;eXecution&#39; relates to the purpose of containers but is not the correct word in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "LXC is the acronym for Linux Containers, a lightweight virtualization technology that allows multiple isolated Linux systems (containers) to run on a single Linux host. It provides OS-level virtualization without the overhead of full virtual machines.",
      "distractor_analysis": "The distractors play on common misinterpretations of the letter &#39;X&#39; in acronyms, or attempt to describe the functionality of LXC using plausible but incorrect words. &#39;Linux Container eXtension&#39; is a common guess due to the &#39;X&#39; often signifying &#39;eXtension&#39;. &#39;Lightweight X-platform Containers&#39; uses descriptive terms that are true of containers but not part of the acronym. &#39;Linux eXecution Containers&#39; uses a functionally related but incorrect word for &#39;X&#39;.",
      "analogy": "Think of LXC as a set of tools that lets you create separate, self-contained &#39;rooms&#39; (containers) within a single &#39;house&#39; (Linux operating system), each with its own furniture and rules, but all sharing the same foundation and utilities."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "lxc-create -t download -n mycontainer -- --dist ubuntu --release focal --arch amd64\nlxc-start mycontainer\nlxc-attach mycontainer",
        "context": "Basic commands for creating, starting, and attaching to an LXC container on a Linux system."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "OS_VIRTUALIZATION",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does CSIS stand for in the context of cybersecurity workforce reports?",
    "correct_answer": "Center for Strategic and International Studies",
    "distractors": [
      {
        "question_text": "Cybersecurity Strategic and International Systems",
        "misconception": "Targets word substitution: &#39;Systems&#39; instead of &#39;Studies&#39; and &#39;Cybersecurity&#39; as a leading word, conflating the organization&#39;s focus with its name."
      },
      {
        "question_text": "Central Security and Information Services",
        "misconception": "Targets similar-sounding words: &#39;Central&#39; for &#39;Center&#39; and &#39;Information Services&#39; for &#39;International Studies&#39;, changing the organizational scope."
      },
      {
        "question_text": "Committee for Security and Intelligence Standards",
        "misconception": "Targets concept conflation: &#39;Committee&#39; and &#39;Standards&#39; are related to governance but not the correct expansion, and &#39;Intelligence&#39; is a common security term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CSIS is a prominent bipartisan, non-profit think tank that conducts policy studies and analyses on a wide range of issues, including international security and cybersecurity. Its reports are frequently cited in discussions about global challenges and workforce trends.",
      "distractor_analysis": "The distractors are designed to test precise recall by substituting key words with similar-sounding or related cybersecurity terms (e.g., &#39;Systems&#39; for &#39;Studies&#39;, &#39;Information Services&#39; for &#39;International Studies&#39;, &#39;Intelligence&#39; for &#39;International&#39;). They also attempt to reframe the &#39;C&#39; as &#39;Cybersecurity&#39; or &#39;Central&#39; and the &#39;S&#39; as &#39;Security&#39; or &#39;Standards&#39;, which are plausible but incorrect given the actual name of the organization.",
      "analogy": "Think of CSIS as a global research institution that provides insights, much like a university research department, but focused on policy and strategy rather than academic theory."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does CI stand for in the context of modern software development and cloud deployments?",
    "correct_answer": "Continuous Integration",
    "distractors": [
      {
        "question_text": "Cloud Integration",
        "misconception": "Targets domain confusion: While related to cloud, &#39;Continuous&#39; is the correct first word, reflecting the iterative nature."
      },
      {
        "question_text": "Continuous Improvement",
        "misconception": "Targets similar-sounding concept: Continuous Improvement is a general process concept, but &#39;Integration&#39; specifically refers to merging code changes frequently."
      },
      {
        "question_text": "Centralized Integration",
        "misconception": "Targets letter confusion: &#39;C&#39; for Centralized is plausible but incorrect; the emphasis is on the ongoing nature."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Continuous Integration (CI) is a software development practice where developers frequently merge their code changes into a central repository. Automated builds and tests are run upon each merge to detect integration errors early and quickly.",
      "distractor_analysis": "Distractors play on common misunderstandings: &#39;Cloud Integration&#39; incorrectly links CI directly to cloud, &#39;Continuous Improvement&#39; is a broader, related but distinct concept, and &#39;Centralized Integration&#39; misinterprets the &#39;C&#39; for a different organizational structure.",
      "analogy": "CI is like a team of builders constantly adding new bricks to a wall, and after every few bricks, a machine automatically checks if the wall is still stable and straight. This catches problems immediately rather than waiting until the whole wall is built."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git push origin main\n# CI pipeline triggered automatically on push",
        "context": "A &#39;git push&#39; command often triggers a CI pipeline, which then runs automated tests and builds."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "DEV_OPS_BASICS",
      "CLOUD_BASICS"
    ]
  },
  {
    "question_text": "What does MTTR stand for in the context of incident response?",
    "correct_answer": "Mean Time To Recover",
    "distractors": [
      {
        "question_text": "Mean Time To Respond",
        "misconception": "Targets similar-sounding action: &#39;Respond&#39; is a key part of incident management, but &#39;Recover&#39; is the specific metric for restoration."
      },
      {
        "question_text": "Maximum Time To Resolve",
        "misconception": "Targets word substitution and statistical term confusion: &#39;Maximum&#39; is a different statistical measure, and &#39;Resolve&#39; is broader than &#39;Recover&#39;."
      },
      {
        "question_text": "Minimum Time To Repair",
        "misconception": "Targets word substitution and statistical term confusion: &#39;Minimum&#39; is a different statistical measure, and &#39;Repair&#39; is often used in hardware contexts, not necessarily incident recovery."
      }
    ],
    "detailed_explanation": {
      "core_logic": "MTTR, or Mean Time To Recover, is a critical metric in incident response and disaster recovery. It measures the average time it takes to restore a system or service to full operational status after a failure or incident. This includes the time spent on detection, diagnosis, and actual recovery actions.",
      "distractor_analysis": "The distractors play on common confusions within incident management terminology. &#39;Mean Time To Respond&#39; is plausible because response is a phase of incident handling, but MTTR specifically focuses on the recovery aspect. &#39;Maximum Time To Resolve&#39; and &#39;Minimum Time To Repair&#39; use incorrect statistical terms (&#39;Maximum&#39;, &#39;Minimum&#39; instead of &#39;Mean&#39;) and substitute &#39;Recover&#39; with related but distinct actions (&#39;Resolve&#39;, &#39;Repair&#39;), testing the precision of the student&#39;s recall.",
      "analogy": "Think of MTTR like the time it takes to get your car back on the road after a breakdown, including calling for help, diagnosing the problem, and fixing it, until it&#39;s fully functional again."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does PoLP stand for in the context of cybersecurity permissions?",
    "correct_answer": "Principle of Least Privilege",
    "distractors": [
      {
        "question_text": "Policy of Least Privilege",
        "misconception": "Targets word substitution: &#39;Policy&#39; is a related concept but &#39;Principle&#39; accurately describes the fundamental security tenet."
      },
      {
        "question_text": "Principle of Limited Permissions",
        "misconception": "Targets synonym substitution: &#39;Limited Permissions&#39; conveys a similar idea but &#39;Least Privilege&#39; is the exact and widely accepted term."
      },
      {
        "question_text": "Protection of Local Processes",
        "misconception": "Targets acronym letter confusion: &#39;P&#39; and &#39;L&#39; are used, but the meaning is entirely unrelated to permissions management."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Principle of Least Privilege (PoLP) is a fundamental security concept requiring that a user, program, or process be granted only the minimum access rights necessary to perform its job or function. This minimizes the potential damage from a compromise or error.",
      "distractor_analysis": "Distractors test precise recall of the acronym&#39;s expansion. &#39;Policy&#39; is a common substitute for &#39;Principle&#39; but changes the fundamental nature of the concept. &#39;Limited Permissions&#39; is a synonym but not the exact term. &#39;Protection of Local Processes&#39; is a plausible-sounding technical term but completely unrelated to the &#39;P&#39; and &#39;L&#39; in PoLP.",
      "analogy": "Think of PoLP like giving someone only the specific key they need for one door, rather than a master key to the entire building. If they lose that one key, only one door is at risk."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  }
]