[
  {
    "question_text": "What does RPM stand for in the context of disk drives and rotational speed?",
    "correct_answer": "Revolutions Per Minute",
    "distractors": [
      {
        "question_text": "Rotations Per Minute",
        "misconception": "Targets synonym substitution: &#39;Rotations&#39; is a close synonym for &#39;Revolutions&#39; but not the exact term used in the acronym."
      },
      {
        "question_text": "Revolutions Per Millisecond",
        "misconception": "Targets unit confusion: &#39;Millisecond&#39; is a time unit used in disk calculations, but &#39;Minute&#39; is the correct unit for RPM."
      },
      {
        "question_text": "Readings Per Minute",
        "misconception": "Targets functional confusion: &#39;Readings&#39; relates to disk operation but not to the physical rotational speed measurement."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RPM, or Revolutions Per Minute, is a unit of frequency, specifically the number of turns in one minute. It is commonly used to specify the rotational speed of hard disk drives, indicating how many times the platters spin in a minute, which directly impacts rotational latency and data transfer rates.",
      "distractor_analysis": "The distractors test precise recall of the terms. &#39;Rotations Per Minute&#39; uses a near-synonym, &#39;Revolutions Per Millisecond&#39; confuses the time unit, and &#39;Readings Per Minute&#39; relates to a different aspect of disk performance.",
      "analogy": "Think of RPM like the speed of a record player; a higher RPM means the record spins faster, allowing the needle to access music more quickly."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does OSI stand for in the context of network security architectures?",
    "correct_answer": "Open Systems Interconnection",
    "distractors": [
      {
        "question_text": "Open Source Integration",
        "misconception": "Targets similar-sounding terms: &#39;Open Source&#39; is a common computing term, and &#39;Integration&#39; relates to systems, making it a plausible but incorrect substitution."
      },
      {
        "question_text": "Operating System Interface",
        "misconception": "Targets concept confusion: &#39;Operating System&#39; and &#39;Interface&#39; are valid computing terms, but they refer to a different layer of abstraction than the network model."
      },
      {
        "question_text": "Organizational Security Infrastructure",
        "misconception": "Targets domain conflation: &#39;Organizational Security&#39; and &#39;Infrastructure&#39; are relevant to cybersecurity but do not represent the specific networking model OSI."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Open Systems Interconnection (OSI) model is a conceptual framework used to describe the functions of a networking system. It standardizes the communication functions of a telecommunication or computing system without regard to their underlying internal structure and technology.",
      "distractor_analysis": "Each distractor uses terms that are common in the IT and cybersecurity domains but incorrectly combine them to form a plausible but wrong expansion. This tests precise recall of the standard networking model&#39;s name.",
      "analogy": "Think of OSI as a universal language translator for computers, allowing different systems to understand each other by breaking down communication into seven standardized layers, much like how a complex task can be broken into smaller, manageable steps."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SDLC stand for in the context of software development?",
    "correct_answer": "Software Development Life Cycle",
    "distractors": [
      {
        "question_text": "System Development Life Cycle",
        "misconception": "Targets scope confusion: While &#39;System&#39; is related, the context specifically refers to &#39;Software&#39; development, making &#39;Software&#39; the precise term."
      },
      {
        "question_text": "Secure Development Life Cycle",
        "misconception": "Targets concept conflation: &#39;Secure&#39; is a goal of the SDLC, but not part of its standard expansion. This confuses the objective with the name."
      },
      {
        "question_text": "Software Design Life Cycle",
        "misconception": "Targets word substitution: &#39;Design&#39; is a phase within the SDLC, but &#39;Development&#39; encompasses the entire process from conception to retirement."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Software Development Life Cycle (SDLC) is a structured process that outlines the stages involved in developing and maintaining software, from initial planning and requirements gathering to testing, deployment, and maintenance. It provides a framework for managing the entire software project.",
      "distractor_analysis": "Distractors play on common misunderstandings: substituting &#39;Software&#39; with &#39;System&#39; (a broader but less precise term in this context), replacing &#39;Development&#39; with &#39;Design&#39; (a specific phase), or inserting &#39;Secure&#39; (a desired attribute, not part of the acronym&#39;s expansion).",
      "analogy": "Think of SDLC as the blueprint and construction plan for a building: it covers everything from drawing the initial sketches to the final inspection before people move in, ensuring a structured approach to creation."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does ISP stand for in the context of network infrastructure and service provision?",
    "correct_answer": "Internet Service Provider",
    "distractors": [
      {
        "question_text": "Information Security Professional",
        "misconception": "Targets domain confusion: While related to security, this is a role, not a network entity."
      },
      {
        "question_text": "Internal System Protocol",
        "misconception": "Targets word substitution: &#39;System&#39; and &#39;Protocol&#39; are common tech terms but incorrect here."
      },
      {
        "question_text": "Integrated Service Platform",
        "misconception": "Targets similar-sounding terms: &#39;Integrated&#39; and &#39;Platform&#39; are plausible but not the exact expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Internet Service Provider (ISP) is an organization that provides services for accessing, using, or participating in the Internet. ISPs can be organized in various forms, such as commercial, community-owned, non-profit, or privately owned.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Information Security Professional&#39; is a valid term in cybersecurity but refers to a person, not a company. &#39;Internal System Protocol&#39; uses common technical words but forms a non-existent acronym in this context. &#39;Integrated Service Platform&#39; sounds plausible but is not the correct, widely recognized expansion.",
      "analogy": "Think of an ISP as the utility company for the internet; they provide the connection and services that allow you to get online, much like an electricity company provides power."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does AI stand for in the context of computing and cybersecurity?",
    "correct_answer": "Artificial Intelligence",
    "distractors": [
      {
        "question_text": "Automated Intelligence",
        "misconception": "Targets word substitution: &#39;Automated&#39; is a related concept but not the correct term for the field of AI."
      },
      {
        "question_text": "Advanced Intelligence",
        "misconception": "Targets similar-sounding terms: &#39;Advanced&#39; implies sophistication but is not the precise term used in the acronym."
      },
      {
        "question_text": "Algorithmic Intelligence",
        "misconception": "Targets concept conflation: AI heavily relies on algorithms, but &#39;Algorithmic&#39; is not part of the standard expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AI, or Artificial Intelligence, refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions. This includes learning, problem-solving, perception, and language understanding.",
      "distractor_analysis": "Each distractor replaces &#39;Artificial&#39; with a word that is conceptually related to AI&#39;s function or characteristics (automated processes, advanced capabilities, algorithmic foundations) but is not the exact term in the acronym, testing precise recall.",
      "analogy": "Think of AI as building a robot that can learn to play chess like a human, rather than just following pre-programmed moves."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does OS stand for in the context of cybersecurity vulnerabilities?",
    "correct_answer": "Operating System",
    "distractors": [
      {
        "question_text": "Open Source",
        "misconception": "Targets similar-sounding terms: &#39;Open Source&#39; is a common term in software but not the correct expansion for OS in this context."
      },
      {
        "question_text": "Operational Security",
        "misconception": "Targets related security concepts: &#39;Operational Security&#39; (OpSec) is a valid security term, but not the expansion of OS."
      },
      {
        "question_text": "Output Stream",
        "misconception": "Targets computing jargon: &#39;Output Stream&#39; is a valid computing term, but unrelated to the context of system vulnerabilities."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In cybersecurity, OS commonly refers to &#39;Operating System&#39;. An Operating System is the core software that manages computer hardware and software resources, and vulnerabilities within it can be exploited by attackers.",
      "distractor_analysis": "The distractors leverage terms that are either common in the broader computing or security domains (&#39;Open Source&#39;, &#39;Operational Security&#39;) or are valid computing terms (&#39;Output Stream&#39;), but none correctly expand OS in the context of system vulnerabilities.",
      "analogy": "Think of the OS as the brain of a computer; if the brain has a weakness, the whole body is vulnerable."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "In cybersecurity, what does CIO stand for?",
    "correct_answer": "Chief Information Officer",
    "distractors": [
      {
        "question_text": "Chief Information Officer",
        "misconception": "Targets exact match: This is the correct answer, but included as a distractor to test precise recall against very similar options."
      },
      {
        "question_text": "Chief Intelligence Officer",
        "misconception": "Targets similar-sounding terms: Intelligence is a related field, but Information is the correct term for the IT executive role."
      },
      {
        "question_text": "Chief Internet Officer",
        "misconception": "Targets outdated or incorrect terminology: Internet is too narrow; Information encompasses all IT systems and data."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Chief Information Officer (CIO) is a senior executive responsible for managing and overseeing the information technology (IT) systems and strategies within an organization. This role focuses on aligning IT initiatives with business goals.",
      "distractor_analysis": "The distractors test the precise recall of the &#39;I&#39; in CIO. &#39;Intelligence&#39; is a plausible but incorrect substitution, while &#39;Internet&#39; is too specific and not the standard term for the executive role.",
      "analogy": "Think of the CIO as the captain of the organization&#39;s digital ship, responsible for its navigation, maintenance, and ensuring it reaches its business destinations efficiently and securely."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does UX stand for in the context of software and web development?",
    "correct_answer": "User Experience",
    "distractors": [
      {
        "question_text": "User eXchange",
        "misconception": "Targets similar-sounding terms: &#39;eXchange&#39; sounds plausible in a technical context but is incorrect."
      },
      {
        "question_text": "User eXecution",
        "misconception": "Targets functional confusion: &#39;eXecution&#39; relates to software operation but not the design aspect of user interaction."
      },
      {
        "question_text": "Unified Experience",
        "misconception": "Targets word substitution: &#39;Unified&#39; is a common term in software but not the correct expansion for UX."
      }
    ],
    "detailed_explanation": {
      "core_logic": "UX, or User Experience, refers to the overall experience a user has when interacting with a product, system, or service. It encompasses all aspects of the end-user&#39;s interaction with the company, its services, and its products, focusing on usability, accessibility, and pleasure.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;User eXchange&#39; and &#39;User eXecution&#39; use plausible but incorrect second words. &#39;Unified Experience&#39; substitutes &#39;User&#39; with a related but incorrect &#39;U&#39; word, testing if the student knows the exact expansion.",
      "analogy": "Think of UX like the design of a comfortable chair. It&#39;s not just about whether you can sit on it (functionality), but how it feels, how easy it is to get in and out of, and how aesthetically pleasing it is (the overall experience)."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "In the context of web application security, what does SQL stand for?",
    "correct_answer": "Structured Query Language",
    "distractors": [
      {
        "question_text": "Standard Query Language",
        "misconception": "Targets word substitution: &#39;Standard&#39; sounds plausible but &#39;Structured&#39; is the correct term, referring to the organized nature of the language."
      },
      {
        "question_text": "System Query Language",
        "misconception": "Targets similar-sounding terms: &#39;System&#39; is a common IT term, but incorrect for this specific acronym."
      },
      {
        "question_text": "Secure Query Language",
        "misconception": "Targets functional assumption: While SQL is used in secure applications, &#39;Secure&#39; is not part of its official expansion, and SQL itself has security vulnerabilities if not properly mitigated."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SQL, or Structured Query Language, is a domain-specific language used in programming and designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS). It is crucial for interacting with databases in web applications.",
      "distractor_analysis": "The distractors test precise recall of the first word in the acronym. &#39;Standard&#39; and &#39;System&#39; are plausible but incorrect substitutions, while &#39;Secure&#39; incorrectly implies a security property as part of the name rather than a characteristic that must be engineered.",
      "analogy": "Think of SQL as the specific language you use to ask a librarian (the database) for books (data) in a very organized way. If you don&#39;t speak the language correctly, you won&#39;t get the right information, or worse, you might accidentally mess up the library&#39;s catalog."
    },
    "code_snippets": [
      {
        "language": "sql",
        "code": "SELECT username, email FROM users WHERE id = 1;",
        "context": "A basic SQL query to retrieve user information from a database."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does OS stand for in the context of Android&#39;s security architecture?",
    "correct_answer": "Operating System",
    "distractors": [
      {
        "question_text": "Open Source",
        "misconception": "Targets similar-sounding terms and context: Android is open source, but OS specifically refers to the Operating System."
      },
      {
        "question_text": "Operational Security",
        "misconception": "Targets concept conflation: Operational Security is a cybersecurity domain, but not the expansion of OS in this context."
      },
      {
        "question_text": "Orchestration Service",
        "misconception": "Targets technical jargon confusion: Orchestration services exist in IT, but are unrelated to the basic OS acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In computing, OS is a fundamental acronym that stands for Operating System. It refers to the core software that manages computer hardware and software resources and provides common services for computer programs. Android&#39;s security architecture is built upon the Linux kernel, which is the core of its operating system.",
      "distractor_analysis": "The distractors leverage terms that are either related to Android&#39;s nature (Open Source), general security concepts (Operational Security), or plausible technical terms (Orchestration Service) to test precise recall of a foundational computing acronym.",
      "analogy": "Think of the OS as the conductor of an orchestra. It doesn&#39;t play the instruments (applications) itself, but it directs and manages all of them to work together harmoniously and securely."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "NET_BASICS"
    ]
  }
]