[
  {
    "question_text": "What does REXEC stand for in the context of network services?",
    "correct_answer": "Remote Execution",
    "distractors": [
      {
        "question_text": "Remote Exfiltration",
        "misconception": "Targets similar-sounding terms: Exfiltration is a related security concept but not the direct meaning of REXEC."
      },
      {
        "question_text": "Remote Exploit",
        "misconception": "Targets functional association: REXEC can be exploited, but &#39;Exploit&#39; is not its direct expansion."
      },
      {
        "question_text": "Remote Extensible Command",
        "misconception": "Targets word substitution: &#39;Extensible&#39; sounds plausible but is incorrect; &#39;Execution&#39; is the correct term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "REXEC is a network service that allows a user to execute commands on a remote host. It is part of the BSD &#39;r&#39; commands suite, though it has a slightly different authentication mechanism than others in that suite.",
      "distractor_analysis": "The distractors leverage terms that are related to security or remote operations but do not precisely match the &#39;EXEC&#39; in REXEC. &#39;Exfiltration&#39; is a common attack goal, &#39;Exploit&#39; describes how REXEC might be used maliciously, and &#39;Extensible&#39; is a plausible but incorrect word substitution for &#39;Execution&#39;.",
      "analogy": "Think of REXEC like telling a remote computer, &#39;Do this command for me,&#39; without physically being at its keyboard."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does SSM stand for in the context of Amazon Web Services?",
    "correct_answer": "Systems Manager",
    "distractors": [
      {
        "question_text": "Security Services Management",
        "misconception": "Targets similar-sounding terms: &#39;Security Services&#39; is a plausible but incorrect expansion for &#39;SS&#39; in a cloud security context."
      },
      {
        "question_text": "System Security Monitoring",
        "misconception": "Targets functional confusion: &#39;Monitoring&#39; is a common security function, but &#39;Manager&#39; is the correct term for this AWS service."
      },
      {
        "question_text": "Secure Systems Management",
        "misconception": "Targets word order/addition: Adding &#39;Secure&#39; is a common assumption for security-related acronyms, but it&#39;s not part of the official name."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Amazon SSM, or Systems Manager, is an AWS service that helps you view and control your infrastructure on AWS. It simplifies resource and application management, shortens the time to detect and resolve operational problems, and allows you to operate your infrastructure at scale.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Security Services Management&#39; and &#39;System Security Monitoring&#39; use plausible security-related terms that could be confused with the actual service name. &#39;Secure Systems Management&#39; adds an extra word (&#39;Secure&#39;) that, while fitting the context of security, is not part of the official acronym expansion.",
      "analogy": "Think of SSM as a remote control and diagnostic tool for your AWS servers and resources, allowing you to manage them without direct SSH access."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "aws ssm start-session --target i-0123456789abcdef0",
        "context": "Example of using the AWS CLI to start a session with an EC2 instance via SSM, demonstrating its remote management capability."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "CLOUD_SECURITY"
    ]
  },
  {
    "question_text": "What does OODA stand for in the context of cybersecurity and decision-making processes?",
    "correct_answer": "Observe, Orient, Decide, Act",
    "distractors": [
      {
        "question_text": "Observe, Organize, Detect, Act",
        "misconception": "Targets similar-sounding terms: &#39;Organize&#39; and &#39;Detect&#39; are related to security operations but are not the correct terms in the OODA loop."
      },
      {
        "question_text": "Observe, Orient, Detect, Analyze",
        "misconception": "Targets word substitution: &#39;Detect&#39; and &#39;Analyze&#39; are security functions but &#39;Decide&#39; and &#39;Act&#39; are the core decision-making and execution phases of OODA."
      },
      {
        "question_text": "Operate, Observe, Decide, Act",
        "misconception": "Targets initial letter confusion: &#39;Operate&#39; is a common action, but &#39;Observe&#39; is the correct first step in the OODA loop."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The OODA loop is a decision cycle in cybersecurity and military strategy, developed by military strategist John Boyd. It describes the four stages of decision-making: Observe (gather information), Orient (analyze and synthesize information), Decide (determine a course of action), and Act (implement the decision). This continuous loop allows for rapid adaptation to changing circumstances.",
      "distractor_analysis": "Distractors replace key terms with related but incorrect security or operational concepts. &#39;Organize&#39; and &#39;Detect&#39; are plausible but not part of the standard OODA model. &#39;Analyze&#39; is part of &#39;Orient&#39; but not a distinct phase. &#39;Operate&#39; is an action, but &#39;Observe&#39; is the initial information gathering phase.",
      "analogy": "Think of OODA like a cybersecurity defender&#39;s rapid response cycle: Observe the attack, Orient to understand its nature, Decide on a countermeasure, and Act to implement it, then repeat."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does OODA stand for in the context of cybersecurity and decision-making?",
    "correct_answer": "Observe, Orient, Decide, Act",
    "distractors": [
      {
        "question_text": "Observe, Organize, Decide, Act",
        "misconception": "Targets similar-sounding terms: &#39;Organize&#39; is a plausible action but &#39;Orient&#39; specifically refers to processing and contextualizing observations."
      },
      {
        "question_text": "Observe, Orient, Detect, Act",
        "misconception": "Targets word substitution: &#39;Detect&#39; is a component of &#39;Observe&#39; or &#39;Orient&#39; but not a distinct phase in the OODA loop."
      },
      {
        "question_text": "Operate, Orient, Decide, Act",
        "misconception": "Targets initial letter confusion: &#39;Operate&#39; is an action but the OODA loop begins with &#39;Observe&#39; as the initial information gathering phase."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The OODA loop is a decision cycle developed by military strategist John Boyd. It describes the process of Observe (gather information), Orient (analyze and synthesize information to form a mental model), Decide (determine a course of action), and Act (implement the decision). It&#39;s a continuous loop, emphasizing rapid iteration and adaptation.",
      "distractor_analysis": "Each distractor replaces one of the four critical phases with a related but incorrect term. &#39;Organize&#39; and &#39;Detect&#39; are actions that might occur within the &#39;Orient&#39; or &#39;Observe&#39; phases, respectively, but are not the distinct phases themselves. &#39;Operate&#39; incorrectly replaces &#39;Observe&#39; as the starting point of the cycle.",
      "analogy": "Think of the OODA loop like a tennis player: Observe the opponent&#39;s serve, Orient to predict its trajectory, Decide where to hit the ball, and Act by swinging the racket. The faster they cycle, the better they perform."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does Z-Wave stand for in the context of wireless technology?",
    "correct_answer": "Z-Wave is a proprietary wireless communication protocol used primarily for home automation.",
    "distractors": [
      {
        "question_text": "ZigBee Wireless Area Network Emitter",
        "misconception": "Targets acronym confusion: Students might confuse Z-Wave with ZigBee, another home automation protocol, and attempt to force an acronym."
      },
      {
        "question_text": "Zero-latency Wireless Access Verification Engine",
        "misconception": "Targets plausible-sounding but incorrect technical terms: &#39;Zero-latency&#39; and &#39;Verification Engine&#39; sound technical but are not related to the actual name."
      },
      {
        "question_text": "Zonal Wireless Automation Vectoring Emitter",
        "misconception": "Targets made-up technical jargon: This distractor uses complex-sounding words that have no actual meaning in the context of Z-Wave."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Z-Wave is not an acronym; it is a brand name for a proprietary wireless communication protocol designed for home automation applications. It allows smart devices to communicate with each other and a central control device.",
      "distractor_analysis": "The question is designed to test if the student understands that not all capitalized terms are acronyms. The distractors attempt to create plausible-sounding acronyms using common cybersecurity and networking terminology, or by confusing Z-Wave with similar-sounding protocols like ZigBee.",
      "analogy": "Think of &#39;Z-Wave&#39; like &#39;Bluetooth&#39; or &#39;Wi-Fi&#39; – they are brand names or specific technology standards, not acronyms that expand into longer phrases."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does DREAD stand for in the context of threat modeling?",
    "correct_answer": "Damage, Reproducibility, Exploitability, Affected Users, Discoverability",
    "distractors": [
      {
        "question_text": "Damage, Reliability, Exploitability, Affected Users, Discoverability",
        "misconception": "Targets similar-sounding terms: Reliability is a security concept but Reproducibility is the correct term in DREAD."
      },
      {
        "question_text": "Detection, Reproducibility, Exploitability, Affected Users, Discoverability",
        "misconception": "Targets initial letter confusion: Detection starts with &#39;D&#39; but Damage is the correct first component of DREAD."
      },
      {
        "question_text": "Damage, Reproducibility, Effectiveness, Affected Users, Discoverability",
        "misconception": "Targets word substitution: Effectiveness is a related concept but Exploitability is the precise term for how hard an attack is to perform."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The DREAD rating system is a method used in threat modeling to assess and prioritize threats based on five key factors: Damage (potential severity), Reproducibility (ease of replicating the exploit), Exploitability (difficulty of performing the attack), Affected Users (percentage of users impacted), and Discoverability (ease of finding the weakness).",
      "distractor_analysis": "Each distractor replaces one of the DREAD components with a plausible but incorrect term. &#39;Reliability&#39; is a general security attribute but not part of DREAD. &#39;Detection&#39; is a security function but &#39;Damage&#39; is the correct first &#39;D&#39;. &#39;Effectiveness&#39; is a measure of a control, but &#39;Exploitability&#39; specifically refers to the attack&#39;s difficulty.",
      "analogy": "DREAD is like a doctor&#39;s checklist for a potential illness: How bad could it get (Damage)? How easily can it spread (Reproducibility)? How hard is it to catch (Exploitability)? How many people will get sick (Affected Users)? How easy is it to find the source (Discoverability)?"
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does SASE stand for in the context of modern cybersecurity frameworks?",
    "correct_answer": "Secure Access Service Edge",
    "distractors": [
      {
        "question_text": "Secure Application Service Edge",
        "misconception": "Targets term substitution: &#39;Application&#39; is a common IT term, but &#39;Access&#39; is the correct focus for this framework&#39;s purpose."
      },
      {
        "question_text": "System Access Security Edge",
        "misconception": "Targets word order and substitution: Swapping &#39;Service&#39; for &#39;Security&#39; and changing the order creates a plausible but incorrect combination."
      },
      {
        "question_text": "Software-defined Access Service Edge",
        "misconception": "Targets similar technology concepts: &#39;Software-defined&#39; is a common prefix in networking (e.g., SDN), leading to confusion with the &#39;S&#39; in SASE."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SASE (Secure Access Service Edge) is a cybersecurity framework that converges networking (WAN) and network security services into a single, cloud-delivered offering. It&#39;s designed to support the secure access needs of a distributed workforce and cloud-based applications, moving security closer to the user and device.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Secure Application Service Edge&#39; replaces &#39;Access&#39; with &#39;Application&#39;, which is a related but incorrect focus. &#39;System Access Security Edge&#39; rearranges and substitutes words, making it sound plausible. &#39;Software-defined Access Service Edge&#39; leverages the familiarity of &#39;Software-defined&#39; in networking, which is a common misattribution for the &#39;S&#39; in SASE.",
      "analogy": "Think of SASE as a personalized, secure express lane for every user and device, no matter where they are. Instead of everyone having to go through a central, often distant, security checkpoint, SASE brings the security and network services directly to them, at the &#39;edge&#39; of the network."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "DEFENSE_DETECT",
      "GRC_COMPLIANCE"
    ]
  },
  {
    "question_text": "What does AIS stand for in the context of cybersecurity threat intelligence sharing?",
    "correct_answer": "Automated Indicator Sharing",
    "distractors": [
      {
        "question_text": "Automated Information Sharing",
        "misconception": "Targets word substitution: &#39;Information&#39; is a common term in security, but &#39;Indicator&#39; is specific to threat intelligence."
      },
      {
        "question_text": "Advanced Incident Sharing",
        "misconception": "Targets similar-sounding terms and scope confusion: &#39;Advanced&#39; and &#39;Incident&#39; are related security concepts but incorrect for this acronym."
      },
      {
        "question_text": "Automated Intelligence System",
        "misconception": "Targets word substitution and concept conflation: &#39;Intelligence&#39; is related, but &#39;System&#39; changes the nature of the initiative from sharing to a platform."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AIS, or Automated Indicator Sharing, is a Department of Homeland Security (DHS) initiative designed to facilitate the rapid, automated exchange of cyber threat indicators, such as Indicators of Compromise (IoCs), between the U.S. federal government and the private sector. Its purpose is to enable organizations to receive and act upon threat intelligence at &#39;machine speed&#39;.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Automated Information Sharing&#39; replaces &#39;Indicator&#39; with the broader &#39;Information&#39;, which is less specific to threat intelligence. &#39;Advanced Incident Sharing&#39; uses related but incorrect terms, confusing the &#39;A&#39; and &#39;I&#39; with other common security concepts. &#39;Automated Intelligence System&#39; changes &#39;Sharing&#39; to &#39;System&#39; and &#39;Indicator&#39; to &#39;Intelligence&#39;, altering the core function from a sharing initiative to a generic system.",
      "analogy": "Think of AIS as a real-time &#39;wanted poster&#39; system for cyber threats. Instead of manually printing and distributing posters, it automatically sends digital descriptions (indicators) of cybercriminals (threats) to everyone who needs to know, instantly."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does BCP stand for in cybersecurity planning?",
    "correct_answer": "Business Continuity Plan",
    "distractors": [
      {
        "question_text": "Business Compliance Plan",
        "misconception": "Targets similar-sounding terms: Compliance is a related concept but not the primary focus of BCP, which is operational resilience."
      },
      {
        "question_text": "Backup and Contingency Plan",
        "misconception": "Targets partial knowledge: Backup and Contingency are components or related concepts, but not the exact expansion of BCP."
      },
      {
        "question_text": "Basic Continuity Protocol",
        "misconception": "Targets word substitution: Protocol is a common tech term, but &#39;Plan&#39; is the correct and more comprehensive term for BCP."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Business Continuity Plan (BCP) is a comprehensive document that outlines how an organization will continue to operate its critical functions during and after a disruptive event. It focuses on maintaining essential business operations rather than just IT systems.",
      "distractor_analysis": "The distractors leverage terms that are related to business operations, planning, or recovery but do not precisely match the &#39;Business Continuity Plan&#39; expansion. &#39;Compliance&#39; is a business concern, &#39;Backup and Contingency&#39; are elements of resilience, and &#39;Protocol&#39; is a common IT term, making them plausible but incorrect choices.",
      "analogy": "Think of a BCP as a company&#39;s &#39;survival guide.&#39; If a major disaster strikes, the BCP tells everyone what to do to keep the most important parts of the business running, like a ship&#39;s captain having a plan for how to keep sailing even if an engine fails."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does SAMM stand for in the context of software security frameworks?",
    "correct_answer": "Software Assurance Maturity Model",
    "distractors": [
      {
        "question_text": "Software Application Maturity Model",
        "misconception": "Targets word substitution: &#39;Application&#39; is a common term in software but &#39;Assurance&#39; is specific to SAMM&#39;s focus on security quality."
      },
      {
        "question_text": "Security Assurance Maturity Model",
        "misconception": "Targets initial letter confusion: &#39;S&#39; for Security instead of Software, which changes the scope from software development to general security."
      },
      {
        "question_text": "Software Assessment Maturity Model",
        "misconception": "Targets similar-sounding terms: &#39;Assessment&#39; is a related activity but &#39;Assurance&#39; implies a broader, ongoing process of ensuring security quality."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SAMM, the Software Assurance Maturity Model, is an open-source framework designed to help organizations integrate security activities into their software development lifecycle. It provides a structured approach to assess and improve the maturity of software security practices across various business functions.",
      "distractor_analysis": "The distractors are designed to test precise recall of the acronym. &#39;Software Application Maturity Model&#39; substitutes &#39;Assurance&#39; with &#39;Application&#39;, a common but incorrect term. &#39;Security Assurance Maturity Model&#39; incorrectly assumes the &#39;S&#39; stands for &#39;Security&#39; rather than &#39;Software&#39;. &#39;Software Assessment Maturity Model&#39; replaces &#39;Assurance&#39; with &#39;Assessment&#39;, which is a component of assurance but not the full scope of the model.",
      "analogy": "SAMM is like a fitness tracker for your software development process. It helps you measure how &#39;fit&#39; (secure) your software practices are and provides a roadmap to get them in better shape."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "GRC_COMPLIANCE",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does TCB stand for in the context of security models?",
    "correct_answer": "Trusted Computing Base",
    "distractors": [
      {
        "question_text": "Total Control Block",
        "misconception": "Targets similar-sounding terms: &#39;Total Control&#39; sounds like a security concept, and &#39;Block&#39; is a common computing term, leading to a plausible but incorrect combination."
      },
      {
        "question_text": "Trusted Control Boundary",
        "misconception": "Targets word substitution: &#39;Boundary&#39; is related to security perimeters, which are components of TCB, but it&#39;s not the correct last word of the acronym."
      },
      {
        "question_text": "Technical Computing Base",
        "misconception": "Targets word substitution: &#39;Technical&#39; is a common adjective in computing, and &#39;Computing Base&#39; sounds plausible, but &#39;Trusted&#39; is the critical security-specific term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Trusted Computing Base (TCB) refers to the set of all hardware, firmware, and software components that are critical to enforcing the security policy of a system. Its integrity is paramount, as any compromise within the TCB can undermine the entire system&#39;s security.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Total Control Block&#39; uses common computing terms that sound authoritative. &#39;Trusted Control Boundary&#39; substitutes &#39;Base&#39; with &#39;Boundary,&#39; which is related to the TCB&#39;s security perimeter but is not the correct expansion. &#39;Technical Computing Base&#39; replaces &#39;Trusted&#39; with &#39;Technical,&#39; which is a plausible but incorrect adjective in this specific security context.",
      "analogy": "Think of the TCB as the unshakeable foundation and load-bearing walls of a secure building. If these core components are compromised, the entire structure&#39;s integrity is at risk, regardless of how strong the doors or windows are."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "SECURITY_MODELS"
    ]
  },
  {
    "question_text": "What does TLB stand for in the context of virtual memory systems?",
    "correct_answer": "Translation Lookaside Buffer",
    "distractors": [
      {
        "question_text": "Translation Local Buffer",
        "misconception": "Targets word substitution: &#39;Local&#39; sounds plausible as it&#39;s a local cache, but &#39;Lookaside&#39; refers to its function as a fast lookup table."
      },
      {
        "question_text": "Translated Lookahead Buffer",
        "misconception": "Targets word substitution: &#39;Lookahead&#39; implies pre-fetching, which is not the primary function, and &#39;Translated&#39; is a past participle instead of the active &#39;Translation&#39;."
      },
      {
        "question_text": "Transfer Lookaside Buffer",
        "misconception": "Targets initial letter confusion: &#39;Transfer&#39; starts with &#39;T&#39; but is unrelated to the address translation process."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A TLB (Translation Lookaside Buffer) is a CPU cache that stores recent virtual-to-physical address translations. It is used to speed up virtual address translation by avoiding a full page table walk for frequently accessed pages.",
      "distractor_analysis": "The distractors are designed to test precise recall of the terms &#39;Translation&#39; and &#39;Lookaside&#39;. &#39;Local&#39; and &#39;Lookahead&#39; are plausible but incorrect substitutions for &#39;Lookaside&#39;, while &#39;Translated&#39; is grammatically incorrect in this context. &#39;Transfer&#39; is a common &#39;T&#39; word in computing but irrelevant to the TLB&#39;s function.",
      "analogy": "Think of the TLB as a &#39;speed dial&#39; for memory addresses. Instead of looking up the full phone book (page table) every time, it quickly checks if the number (address translation) is already in its small, fast memory."
    },
    "code_snippets": [
      {
        "language": "c",
        "code": "int main() {\n    // Accessing a large array can demonstrate TLB misses\n    // If array elements are far apart, they might fall into different pages,\n    // leading to more TLB misses as translations aren&#39;t cached.\n    long long arr[1024 * 1024]; // ~8MB array\n    for (int i = 0; i &lt; 1024 * 1024; i += 1024) { // Stride by page size (assuming 4KB pages)\n        arr[i] = i; // This access might cause a TLB miss if &#39;i&#39; jumps pages\n    }\n    return 0;\n}",
        "context": "Code demonstrating how striding through a large array with a step size larger than a page can lead to frequent TLB misses, as each access might require a new address translation not present in the TLB."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "OS_MEMORY_MANAGEMENT",
      "CPU_ARCHITECTURE"
    ]
  },
  {
    "question_text": "What does ADC stand for in the context of sensor signal processing in AR systems?",
    "correct_answer": "Analog-to-Digital Converter",
    "distractors": [
      {
        "question_text": "Advanced Data Compression",
        "misconception": "Targets similar-sounding terms: &#39;Advanced&#39; and &#39;Data&#39; are common tech terms, but incorrect for this specific context."
      },
      {
        "question_text": "Analog Data Controller",
        "misconception": "Targets word substitution: &#39;Controller&#39; implies management rather than conversion, which is the core function."
      },
      {
        "question_text": "Automated Device Calibration",
        "misconception": "Targets functional confusion: Calibration is a related concept in sensor systems, but not what ADC specifically stands for."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In sensor signal processing, an ADC (Analog-to-Digital Converter) is an electronic circuit that converts continuous analog signals (like those from a transducer) into discrete digital signals that can be processed by digital systems, such as AR applications.",
      "distractor_analysis": "The distractors are designed to sound plausible by using common technical terms or related concepts. &#39;Advanced Data Compression&#39; uses common tech words but is functionally unrelated. &#39;Analog Data Controller&#39; substitutes &#39;Converter&#39; with &#39;Controller,&#39; which changes the device&#39;s primary role. &#39;Automated Device Calibration&#39; refers to a different, albeit related, process in device management.",
      "analogy": "Think of an ADC as a translator that takes a continuous spoken language (analog) and converts it into written text (digital) that a computer can understand and process."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does TOFU stand for in the context of security decisions within OAuth systems?",
    "correct_answer": "Trust On First Use",
    "distractors": [
      {
        "question_text": "Trust On Final Update",
        "misconception": "Targets word substitution: &#39;Final Update&#39; sounds like a security concept but is incorrect for TOFU."
      },
      {
        "question_text": "Trusted Operational Functionality",
        "misconception": "Targets acronym letter confusion: &#39;Operational Functionality&#39; is a plausible but incorrect expansion for &#39;OFU&#39;."
      },
      {
        "question_text": "Temporary On-demand Feature Usage",
        "misconception": "Targets concept conflation: &#39;Temporary On-demand&#39; relates to dynamic access but is not the correct expansion for TOFU."
      }
    ],
    "detailed_explanation": {
      "core_logic": "TOFU, or Trust On First Use, is a security model where a user is prompted to make a security decision (e.g., granting access to an application) the first time a new authorization context is encountered. This decision is then remembered and trusted for subsequent interactions, balancing user control with convenience.",
      "distractor_analysis": "The distractors are designed to sound plausible by using security-related or operational terms. &#39;Trust On Final Update&#39; incorrectly replaces &#39;First Use&#39; with a different temporal concept. &#39;Trusted Operational Functionality&#39; attempts to create a coherent phrase from the letters but misinterprets the &#39;OFU&#39; part. &#39;Temporary On-demand Feature Usage&#39; introduces concepts related to dynamic access but does not accurately reflect the &#39;Trust On First Use&#39; principle.",
      "analogy": "TOFU is like when your web browser asks if you trust a new website&#39;s security certificate the first time you visit it. Once you say yes, it remembers that decision for future visits."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "AUTH_AUTHZ"
    ]
  },
  {
    "question_text": "What does DVWA stand for in the context of penetration testing labs?",
    "correct_answer": "Damn Vulnerable Web Application",
    "distractors": [
      {
        "question_text": "Deliberately Vulnerable Web Application",
        "misconception": "Targets synonym substitution: &#39;Deliberately&#39; is a close synonym for &#39;Damn&#39; in this context, but not the exact term used in the official name."
      },
      {
        "question_text": "Dynamic Vulnerability Web Application",
        "misconception": "Targets similar-sounding terms: &#39;Dynamic&#39; sounds plausible for a web application, but it&#39;s not part of the official acronym."
      },
      {
        "question_text": "Distributed Vulnerable Web Application",
        "misconception": "Targets concept confusion: &#39;Distributed&#39; refers to a different architectural pattern and is not related to the purpose of this application."
      }
    ],
    "detailed_explanation": {
      "core_logic": "DVWA is a widely used open-source web application specifically designed to be vulnerable, providing a legal and safe environment for security professionals and students to practice penetration testing techniques. Its name explicitly states its purpose.",
      "distractor_analysis": "The distractors play on common misrememberings or plausible-sounding alternatives. &#39;Deliberately&#39; is a very close synonym to &#39;Damn&#39; in this context, making it a strong distractor. &#39;Dynamic&#39; and &#39;Distributed&#39; are terms often associated with web applications or systems, but they do not form part of the correct acronym, testing precise recall.",
      "analogy": "DVWA is like a crash test dummy for web security – it&#39;s intentionally designed to break so you can learn how to fix real cars."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "What does MTTR stand for in the context of vulnerability management metrics?",
    "correct_answer": "Mean Time To Remediate",
    "distractors": [
      {
        "question_text": "Mean Time To Respond",
        "misconception": "Targets similar-sounding terms: &#39;Respond&#39; is a common action in security incidents, but &#39;Remediate&#39; specifically refers to fixing vulnerabilities."
      },
      {
        "question_text": "Maximum Time To Remediate",
        "misconception": "Targets word substitution: &#39;Maximum&#39; implies an upper limit, whereas &#39;Mean&#39; refers to an average, which is the standard metric for this context."
      },
      {
        "question_text": "Measured Time To Resolution",
        "misconception": "Targets concept conflation: &#39;Resolution&#39; is a broader term, and &#39;Measured&#39; is redundant. &#39;Remediate&#39; is the precise action being tracked."
      }
    ],
    "detailed_explanation": {
      "core_logic": "MTTR, or Mean Time To Remediate, is a key metric in vulnerability management that measures the average time it takes to fix or mitigate identified vulnerabilities. It helps organizations assess the efficiency and effectiveness of their vulnerability patching and mitigation processes.",
      "distractor_analysis": "The distractors play on common security terminology. &#39;Mean Time To Respond&#39; is a valid metric in incident response but not vulnerability remediation. &#39;Maximum Time To Remediate&#39; changes the statistical measure from an average to an upper bound. &#39;Measured Time To Resolution&#39; uses a redundant word and a broader term, missing the specific action of remediation.",
      "analogy": "Think of MTTR like the average time it takes a mechanic to fix a specific type of car problem. A lower MTTR means they&#39;re more efficient at getting cars back on the road."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "RISK_MGMT"
    ]
  },
  {
    "question_text": "What does the acronym IRT stand for in the context of cybersecurity incident management?",
    "correct_answer": "Incident Response Team",
    "distractors": [
      {
        "question_text": "Information Recovery Team",
        "misconception": "Targets similar-sounding terms: &#39;Information&#39; and &#39;Recovery&#39; are related to incident management but not the precise term for the team."
      },
      {
        "question_text": "Internal Resolution Taskforce",
        "misconception": "Targets word substitution: &#39;Internal&#39; and &#39;Resolution&#39; are plausible but do not match the standard cybersecurity acronym."
      },
      {
        "question_text": "Incident Reporting Tool",
        "misconception": "Targets concept confusion: Confuses the team with a tool used in the incident management process."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Incident Response Team (IRT) is a dedicated group of individuals within an organization responsible for preparing for, detecting, analyzing, containing, eradicating, recovering from, and post-incident activities related to cybersecurity incidents. Their primary role is to manage the entire lifecycle of a security breach.",
      "distractor_analysis": "The distractors use terms that are related to incident management (e.g., recovery, internal, reporting) but do not form the exact, widely recognized acronym. &#39;Information Recovery Team&#39; focuses on a subset of IRT activities. &#39;Internal Resolution Taskforce&#39; uses plausible but incorrect words. &#39;Incident Reporting Tool&#39; confuses the team with a technology or process component.",
      "analogy": "An IRT is like a specialized emergency services unit (e.g., SWAT or HAZMAT) for digital crises. They are trained and equipped to handle specific types of emergencies (cyberattacks) and follow established protocols to mitigate damage and restore normal operations."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does IMD stand for in the context of medical devices within an IoT ecosystem?",
    "correct_answer": "Implantable Medical Device",
    "distractors": [
      {
        "question_text": "Integrated Medical Device",
        "misconception": "Targets similar-sounding terms: &#39;Integrated&#39; is a common term in technology and sounds plausible for a complex medical device, but &#39;Implantable&#39; specifies its nature."
      },
      {
        "question_text": "Internal Monitoring Device",
        "misconception": "Targets functional confusion: While an IMD performs internal monitoring, &#39;Internal&#39; is not the correct first word, and &#39;Monitoring&#39; is too generic."
      },
      {
        "question_text": "Intelligent Medical Device",
        "misconception": "Targets characteristic confusion: Many IoT devices are &#39;Intelligent,&#39; but this doesn&#39;t capture the specific &#39;Implantable&#39; aspect of an IMD."
      }
    ],
    "detailed_explanation": {
      "core_logic": "An Implantable Medical Device (IMD) refers to a device that is designed to be partially or wholly inserted into the human body for medical purposes, such as pacemakers, defibrillators, or continuous glucose monitors. In an IoT context, these devices often transmit data wirelessly.",
      "distractor_analysis": "The distractors use words that are related to medical technology or IoT characteristics (Integrated, Internal, Intelligent) but fail to capture the precise and critical &#39;Implantable&#39; aspect of the device, which has significant implications for security and patient safety.",
      "analogy": "Think of an IMD like a tiny, specialized computer that lives inside a patient&#39;s body, constantly working and sometimes communicating with the outside world. Its &#39;implantable&#39; nature makes its security particularly critical."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "IOT_SECURITY"
    ]
  },
  {
    "question_text": "What does CI stand for in the context of software development and cybersecurity?",
    "correct_answer": "Continuous Integration",
    "distractors": [
      {
        "question_text": "Continuous Improvement",
        "misconception": "Targets similar-sounding concepts: &#39;Continuous Improvement&#39; is a general business concept that sounds plausible in a development context but is not the specific technical process."
      },
      {
        "question_text": "Code Integration",
        "misconception": "Targets partial knowledge/word substitution: &#39;Code&#39; is a key part of the process, but &#39;Continuous&#39; is the defining characteristic of CI."
      },
      {
        "question_text": "Centralized Integration",
        "misconception": "Targets incorrect prefix: &#39;Centralized&#39; is a plausible architectural approach but does not accurately represent the &#39;C&#39; in CI, which emphasizes frequency and automation."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Continuous Integration (CI) is a software development practice where developers frequently merge their code changes into a central repository. Automated builds and tests are then run. This practice helps to detect integration errors early and rapidly.",
      "distractor_analysis": "The distractors are designed to catch those who have a general understanding of development concepts but lack precise knowledge of the CI acronym. &#39;Continuous Improvement&#39; is a common business term. &#39;Code Integration&#39; focuses on a part of the process but misses the &#39;Continuous&#39; aspect. &#39;Centralized Integration&#39; suggests a different architectural pattern.",
      "analogy": "Think of CI like a team building a LEGO castle. Instead of each person building a large section alone and trying to fit them together at the end (which often leads to parts not fitting), CI means everyone adds a few bricks at a time to the main castle, and after each addition, they quickly check if everything still connects properly. This way, mistakes are found and fixed immediately."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "git pull origin main\n./build.sh\n./test.sh\n",
        "context": "A simplified CI pipeline often involves pulling the latest code, building the application, and running automated tests."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEV_OPS"
    ]
  },
  {
    "question_text": "What does ML stand for in the context of cybersecurity and anomaly detection?",
    "correct_answer": "Machine Learning",
    "distractors": [
      {
        "question_text": "Malicious Logic",
        "misconception": "Targets similar-sounding terms: Malicious Logic is a cybersecurity concept but not the expansion of ML."
      },
      {
        "question_text": "Model Logic",
        "misconception": "Targets partial knowledge: &#39;Model&#39; is related to ML but &#39;Logic&#39; is an incorrect second word."
      },
      {
        "question_text": "Managed Learning",
        "misconception": "Targets word substitution: &#39;Managed&#39; sounds plausible in a technical context but is not the correct term."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ML, or Machine Learning, refers to algorithms that allow computer systems to learn from data without being explicitly programmed. In cybersecurity, ML is used for tasks like anomaly detection, malware classification, and threat intelligence by identifying patterns and making predictions.",
      "distractor_analysis": "The distractors are designed to confuse students with terms that are either related to cybersecurity (Malicious Logic), partially correct in their understanding of ML (Model Logic), or plausible but incorrect substitutions (Managed Learning).",
      "analogy": "Think of ML in cybersecurity like a highly trained guard dog that learns what normal behavior looks like and barks when something unusual happens, even if it&#39;s never seen that exact &#39;unusual&#39; thing before."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "from sklearn.ensemble import IsolationForest\n# Example of ML model for anomaly detection\nmodel = IsolationForest(contamination=0.1)\nmodel.fit(normal_traffic_data)\nanomalies = model.predict(new_traffic_data)",
        "context": "This Python snippet demonstrates a common Machine Learning algorithm (Isolation Forest) used for unsupervised anomaly detection in network traffic, a key application of ML in cybersecurity."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ML_BASICS"
    ]
  },
  {
    "question_text": "What does DFD stand for in the context of software design and security assessment?",
    "correct_answer": "Data Flow Diagram",
    "distractors": [
      {
        "question_text": "Design Function Diagram",
        "misconception": "Targets word substitution: &#39;Function&#39; is a plausible but incorrect substitute for &#39;Flow&#39;, which is central to DFD&#39;s purpose."
      },
      {
        "question_text": "Dynamic Flow Diagram",
        "misconception": "Targets similar-sounding terms: &#39;Dynamic&#39; sounds like it could relate to software processes, but &#39;Data&#39; is the correct focus."
      },
      {
        "question_text": "Detailed Functional Design",
        "misconception": "Targets concept conflation: &#39;Detailed Functional Design&#39; is a general design concept, but DFD refers to a specific type of diagram."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Data Flow Diagram (DFD) is a graphical representation of the &#39;flow&#39; of data through an information system. It illustrates how data is processed and stored, and how it moves from one entity to another within the system. In security assessment, DFDs are valuable for understanding potential attack paths and trust boundaries.",
      "distractor_analysis": "The distractors replace &#39;Data&#39; or &#39;Flow&#39; with related but incorrect terms. &#39;Design Function Diagram&#39; incorrectly emphasizes function over data movement. &#39;Dynamic Flow Diagram&#39; introduces a temporal aspect not inherent in the DFD&#39;s core definition. &#39;Detailed Functional Design&#39; is a broader design phase, not the specific diagram type.",
      "analogy": "Think of a DFD like a map of a city&#39;s water pipes: it shows where the water (data) comes from, where it goes, where it&#39;s stored, and how it&#39;s processed, without showing the actual physical pipes or pumps."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DESIGN_REVIEW"
    ]
  },
  {
    "question_text": "What does SOC stand for in the context of cybersecurity operations?",
    "correct_answer": "Security Operations Center",
    "distractors": [
      {
        "question_text": "Security Operations Capability",
        "misconception": "Targets similar-sounding terms: &#39;Capability&#39; is mentioned in the document as a function, but &#39;Center&#39; is the correct expansion for the organizational unit."
      },
      {
        "question_text": "System Operations Center",
        "misconception": "Targets word substitution: &#39;System&#39; is a plausible but incorrect substitute for &#39;Security&#39;, which is the core focus."
      },
      {
        "question_text": "Security Oversight Committee",
        "misconception": "Targets acronym letter confusion: &#39;C&#39; could plausibly stand for Committee, but it refers to a different type of organizational structure."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Security Operations Center (SOC) is a centralized unit within an organization that handles security issues. It is responsible for continuously monitoring and analyzing an organization&#39;s security posture, detecting, analyzing, and responding to cybersecurity incidents.",
      "distractor_analysis": "The distractors test the precise recall of the &#39;C&#39; in SOC, distinguishing between a functional &#39;capability&#39;, a generic &#39;system&#39; focus, and a governance &#39;committee&#39;, all of which are related but incorrect.",
      "analogy": "Think of a SOC as the &#39;nerve center&#39; or &#39;mission control&#39; for an organization&#39;s cybersecurity, constantly watching for threats and coordinating responses."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of a SOC analyst&#39;s daily task: reviewing alerts\ngrep &#39;severity=critical&#39; /var/log/siem_alerts.log | less",
        "context": "SOC analysts frequently review logs and alerts generated by security tools."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does RAT stand for in cybersecurity, often associated with advanced persistent threats?",
    "correct_answer": "Remote Access Trojan",
    "distractors": [
      {
        "question_text": "Remote Administration Tool",
        "misconception": "Targets similar functionality: While a RAT can be used for remote administration, &#39;Trojan&#39; emphasizes its malicious, deceptive nature."
      },
      {
        "question_text": "Remote Attack Tool",
        "misconception": "Targets general attack term: &#39;Attack&#39; is too broad; &#39;Trojan&#39; specifically refers to its method of delivery and disguise."
      },
      {
        "question_text": "Real-time Access Threat",
        "misconception": "Targets similar-sounding words: &#39;Real-time&#39; and &#39;Threat&#39; are related security terms but do not form the correct acronym expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Remote Access Trojan (RAT) is a type of malware that allows an attacker to remotely control an infected computer. It is called a &#39;Trojan&#39; because it often disguises itself as legitimate software to trick users into installing it, similar to the Trojan Horse of Greek mythology.",
      "distractor_analysis": "The distractors play on the functional aspects of a RAT (remote administration, attack capabilities) or use similar-sounding but incorrect words, testing the precise recall of the &#39;Trojan&#39; component which defines its deceptive nature.",
      "analogy": "A RAT is like a digital puppet master&#39;s strings, allowing an attacker to control your computer from afar, often after you&#39;ve unknowingly invited it in by downloading something disguised as harmless."
    },
    "code_snippets": [
      {
        "language": "powershell",
        "code": "Get-MpThreatDetection | Where-Object {$_.ThreatName -like &#39;*RAT*&#39;}",
        "context": "PowerShell command to detect potential RAT activity using Windows Defender threat detection logs."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "attack",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does NUMA stand for in the context of computer architecture?",
    "correct_answer": "Non-Uniform Memory Architecture",
    "distractors": [
      {
        "question_text": "Networked Unified Memory Access",
        "misconception": "Targets term substitution: &#39;Networked&#39; and &#39;Access&#39; are related to computer systems but incorrect for this specific architecture."
      },
      {
        "question_text": "Non-Universal Memory Allocation",
        "misconception": "Targets similar-sounding terms: &#39;Universal&#39; and &#39;Allocation&#39; are plausible but do not accurately describe the &#39;Non-Uniform&#39; characteristic."
      },
      {
        "question_text": "Node-Unit Memory Arrangement",
        "misconception": "Targets concept conflation: &#39;Node-Unit&#39; and &#39;Arrangement&#39; relate to the structure but miss the &#39;Non-Uniform&#39; and &#39;Architecture&#39; aspects."
      }
    ],
    "detailed_explanation": {
      "core_logic": "NUMA, or Non-Uniform Memory Architecture, describes a computer memory design used in multiprocessing where the memory access time depends on the memory&#39;s location relative to the processor. Each processor has its own local memory, which it can access faster than non-local memory (memory local to another processor or shared memory).",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Networked Unified Memory Access&#39; introduces networking concepts not central to NUMA&#39;s definition. &#39;Non-Universal Memory Allocation&#39; uses similar-sounding words but misrepresents the core concept of memory access time. &#39;Node-Unit Memory Arrangement&#39; focuses on components but misses the critical &#39;Non-Uniform&#39; aspect and the broader &#39;Architecture&#39; term.",
      "analogy": "Think of NUMA like a library with multiple reading rooms. Each room has its own set of books (local memory) that are quick to access. You can still get books from other rooms (non-local memory), but it takes longer because you have to walk there."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "2: kd&gt; !numa\nNUMA Summary:\nNumber of NUMA nodes : 2\nNumber of Processors : 4",
        "context": "The `!numa` command in a kernel debugger is used to display NUMA configuration and statistics on a Windows system, showing the number of nodes and processors."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does SMT stand for in the context of CPU architecture and thread scheduling?",
    "correct_answer": "Simultaneous Multithreading",
    "distractors": [
      {
        "question_text": "Symmetric Multiprocessing Technology",
        "misconception": "Targets similar-sounding terms and technology confusion: Symmetric Multiprocessing (SMP) is a related but distinct concept, and &#39;Technology&#39; is a common generic suffix."
      },
      {
        "question_text": "System Management Threading",
        "misconception": "Targets functional confusion: &#39;System Management&#39; sounds plausible for an OS component, but misrepresents the core function of SMT."
      },
      {
        "question_text": "Sequential Multi-Tasking",
        "misconception": "Targets antonym confusion: &#39;Sequential&#39; is the opposite of &#39;Simultaneous&#39; in this context, and &#39;Multi-Tasking&#39; is a broader OS concept."
      }
    ],
    "detailed_explanation": {
      "core_logic": "SMT, or Simultaneous Multithreading, is a CPU design technique that allows multiple independent threads of execution to be run on a single physical processor core concurrently. This is achieved by duplicating architectural state (registers, program counters) for each thread while sharing the core&#39;s execution resources (ALUs, caches). Hyper-threading is Intel&#39;s implementation of SMT.",
      "distractor_analysis": "The distractors are designed to test precise knowledge. &#39;Symmetric Multiprocessing Technology&#39; confuses SMT with SMP, a different architectural approach. &#39;System Management Threading&#39; uses plausible-sounding but incorrect functional terms. &#39;Sequential Multi-Tasking&#39; uses a term that is functionally opposite to &#39;Simultaneous&#39; and a broader OS concept.",
      "analogy": "Think of SMT like a chef with two sets of hands (threads) working on two different recipes (tasks) at the same time using the same kitchen equipment (processor core), rather than waiting for one recipe to finish before starting the next."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "OS_ARCH",
      "CPU_ARCH"
    ]
  }
]