[
  {
    "question_text": "What does AV stand for in the context of cybersecurity tools?",
    "correct_answer": "Anti-Virus",
    "distractors": [
      {
        "question_text": "Automated Verification",
        "misconception": "Targets similar-sounding terms: Verification is a security concept, but not the correct expansion for AV software."
      },
      {
        "question_text": "Application Vulnerability",
        "misconception": "Targets concept conflation: Vulnerability is a related security term, but AV specifically refers to software combating viruses."
      },
      {
        "question_text": "Access Validation",
        "misconception": "Targets functional confusion: Validation is a security function, but AV&#39;s primary role is not access validation."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AV, or Anti-Virus software, is a cybersecurity tool designed to detect, prevent, and remove malicious software, including viruses, worms, and Trojans, from computer systems. It typically works by scanning files and programs for known malware signatures or suspicious behavior.",
      "distractor_analysis": "The distractors present plausible-sounding security terms that share initial letters or general security relevance but do not accurately represent the specific function and expansion of Anti-Virus software. &#39;Automated Verification&#39; and &#39;Access Validation&#39; are general security processes, while &#39;Application Vulnerability&#39; refers to weaknesses in software, not the protective software itself.",
      "analogy": "Think of AV software as a digital immune system for your computer, constantly scanning for and neutralizing harmful pathogens."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sudo apt-get install clamav\nclamscan -r /home/user",
        "context": "Example command-line usage for installing and running a common open-source Anti-Virus scanner on a Linux system."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does AV stand for in the context of cybersecurity defense?",
    "correct_answer": "Antivirus",
    "distractors": [
      {
        "question_text": "Advanced Verification",
        "misconception": "Targets similar-sounding terms: &#39;Advanced&#39; and &#39;Verification&#39; are common security terms, but not the correct expansion for AV."
      },
      {
        "question_text": "Automated Vulnerability",
        "misconception": "Targets concept confusion: While related to security, &#39;Automated Vulnerability&#39; refers to a process, not a specific type of defensive software."
      },
      {
        "question_text": "Application Validation",
        "misconception": "Targets domain confusion: &#39;Application Validation&#39; is a software development concept, not the specific security software type."
      }
    ],
    "detailed_explanation": {
      "core_logic": "AV, or Antivirus, refers to software designed to detect, prevent, and remove malicious software like viruses, worms, and Trojans from computer systems. It typically works by scanning files and monitoring system behavior for known patterns of malware.",
      "distractor_analysis": "The distractors use terms that are plausible in a general cybersecurity context but do not accurately represent the specific &#39;Antivirus&#39; software. &#39;Advanced Verification&#39; sounds like a security process, &#39;Automated Vulnerability&#39; describes a type of security assessment, and &#39;Application Validation&#39; is a software quality assurance term.",
      "analogy": "Think of AV software as a digital immune system for your computer, constantly scanning for and neutralizing harmful invaders."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "# Example of an AV scan command (conceptual)\nclamscan -r --bell -i /home/user",
        "context": "Antivirus software often provides command-line interfaces for scanning specific directories or files."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does PID stand for in the context of process management on a compromised system?",
    "correct_answer": "Process ID",
    "distractors": [
      {
        "question_text": "Program Identifier",
        "misconception": "Targets similar-sounding terms: &#39;Program&#39; is related to &#39;Process&#39; but &#39;ID&#39; is the correct term for identification."
      },
      {
        "question_text": "Process Identification Descriptor",
        "misconception": "Targets wordiness/over-specification: Adds unnecessary words that are not part of the standard acronym expansion."
      },
      {
        "question_text": "Privilege Identifier",
        "misconception": "Targets concept confusion: &#39;Privilege&#39; is a security concept but not what &#39;P&#39; stands for in PID."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PID, or Process ID, is a unique identifier assigned to each running process by an operating system. It is crucial for managing processes, allowing users or administrators to monitor, control, or terminate specific applications or services.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Program Identifier&#39; is close but &#39;Process&#39; is the exact term. &#39;Process Identification Descriptor&#39; adds extra words, making it incorrect. &#39;Privilege Identifier&#39; confuses the concept with another security-related term.",
      "analogy": "Think of a PID like a social security number for a running program; it&#39;s a unique number that identifies it to the operating system."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "ps aux | grep firefox\n# Output might include: user  1234  0.5  2.0 123456 78900 ?        Sl   Jan01   0:15 /usr/lib/firefox/firefox",
        "context": "The &#39;ps&#39; command in Linux/Unix-like systems displays running processes, including their PIDs (e.g., &#39;1234&#39; in this example)."
      },
      {
        "language": "powershell",
        "code": "Get-Process -Name chrome | Select-Object Id, ProcessName",
        "context": "In PowerShell, &#39;Get-Process&#39; can retrieve process information, where &#39;Id&#39; corresponds to the PID."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "OS_BASICS"
    ]
  },
  {
    "question_text": "What does RAM stand for in the context of computer systems?",
    "correct_answer": "Random Access Memory",
    "distractors": [
      {
        "question_text": "Read Access Memory",
        "misconception": "Targets similar-sounding terms: &#39;Read&#39; is a common memory operation, but not part of the acronym&#39;s expansion."
      },
      {
        "question_text": "Rapid Access Module",
        "misconception": "Targets word substitution: &#39;Rapid&#39; and &#39;Module&#39; sound plausible for a memory component but are incorrect."
      },
      {
        "question_text": "Random Allocation Memory",
        "misconception": "Targets functional confusion: While memory allocation is random, &#39;Allocation&#39; is not the correct term in the acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "RAM, or Random Access Memory, is a form of computer data storage that can be accessed randomly at any time, in any order, and from any physical location. It is used to store working data and machine code that is currently being used by the CPU.",
      "distractor_analysis": "The distractors play on common misunderstandings or similar-sounding terms related to memory. &#39;Read Access Memory&#39; incorrectly substitutes &#39;Random&#39; with a common memory operation. &#39;Rapid Access Module&#39; uses plausible but incorrect descriptive words. &#39;Random Allocation Memory&#39; confuses the functional aspect of memory allocation with the acronym&#39;s precise expansion.",
      "analogy": "Think of RAM as your computer&#39;s desk. It&#39;s where you keep all the documents and tools you&#39;re actively working on, allowing for quick access. When you close a program, those items are put away, and the desk is cleared for new tasks."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does UID stand for in the context of user privileges on a system?",
    "correct_answer": "User Identifier",
    "distractors": [
      {
        "question_text": "Unique Identification",
        "misconception": "Targets similar-sounding terms: &#39;Unique&#39; is a common descriptor for identifiers, but &#39;User&#39; is the specific context."
      },
      {
        "question_text": "User Identity",
        "misconception": "Targets word substitution: &#39;Identity&#39; is related to &#39;Identifier&#39; but is not the precise term used in system contexts."
      },
      {
        "question_text": "Universal ID",
        "misconception": "Targets scope confusion: &#39;Universal&#39; implies a broader scope than the system-specific &#39;User&#39; context."
      }
    ],
    "detailed_explanation": {
      "core_logic": "UID, or User Identifier, is a numerical value assigned to each user account on a Unix-like operating system. It is used by the system to identify users and determine their permissions and privileges. A UID of 0 typically represents the root user, which has full administrative control over the system.",
      "distractor_analysis": "The distractors play on common misunderstandings of &#39;ID&#39; and the specific context of &#39;User&#39;. &#39;Unique Identification&#39; is plausible because UIDs are unique, but &#39;User&#39; is the correct first word. &#39;User Identity&#39; is close but &#39;Identifier&#39; is the technical term. &#39;Universal ID&#39; incorrectly broadens the scope beyond a single system&#39;s user management.",
      "analogy": "Think of a UID like a unique employee ID number in a company. It identifies you specifically and determines what resources you can access and what actions you can perform within the company&#39;s systems."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "id -u\n# Output: 1000 (example for a non-root user)\n\nsudo su\nid -u\n# Output: 0 (for the root user)",
        "context": "The `id -u` command in Unix-like systems displays the current user&#39;s UID. A UID of 0 signifies the root user."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "OS_BASICS"
    ]
  },
  {
    "question_text": "In the context of network forensics, what does ARP stand for?",
    "correct_answer": "Address Resolution Protocol",
    "distractors": [
      {
        "question_text": "Advanced Routing Protocol",
        "misconception": "Targets similar-sounding terms: &#39;Advanced&#39; and &#39;Routing&#39; are network-related but incorrect, confusing ARP with routing protocols."
      },
      {
        "question_text": "Authentication Request Protocol",
        "misconception": "Targets functional confusion: &#39;Authentication&#39; is a security concept, but ARP&#39;s function is address resolution, not authentication."
      },
      {
        "question_text": "Automatic Resource Provisioning",
        "misconception": "Targets acronym letter confusion: &#39;Automatic&#39; and &#39;Resource&#39; are plausible but incorrect, conflating ARP with resource management systems."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ARP (Address Resolution Protocol) is a communication protocol used for discovering the link layer address, such as a MAC address, associated with a given internet layer address, typically an IPv4 address. It&#39;s crucial for local network communication.",
      "distractor_analysis": "The distractors are designed to test precise knowledge of ARP&#39;s expansion and function. &#39;Advanced Routing Protocol&#39; sounds plausible as ARP is network-related, but it&#39;s not a routing protocol. &#39;Authentication Request Protocol&#39; misattributes a security function to ARP. &#39;Automatic Resource Provisioning&#39; uses words that fit the &#39;A&#39; and &#39;R&#39; but are completely unrelated to ARP&#39;s networking function.",
      "analogy": "Think of ARP as a phone book for a local neighborhood. If you know someone&#39;s name (IP address) but need their house number (MAC address) to deliver a package, you&#39;d look it up in the local phone book (ARP cache)."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "arp -a",
        "context": "The &#39;arp -a&#39; command is used to display the current ARP cache entries on a system, showing the IP-to-MAC address mappings."
      }
    ],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does PII stand for in the context of data privacy and cybersecurity?",
    "correct_answer": "Personally Identifiable Information",
    "distractors": [
      {
        "question_text": "Private Identity Information",
        "misconception": "Targets word substitution: &#39;Private&#39; is related to privacy but &#39;Personally&#39; is the correct and more precise term."
      },
      {
        "question_text": "Personal Identification Information",
        "misconception": "Targets word order and substitution: &#39;Identification&#39; is close but &#39;Identifiable&#39; is the correct adjective, and &#39;Information&#39; is repeated."
      },
      {
        "question_text": "Protected Individual Information",
        "misconception": "Targets similar-sounding terms: &#39;Protected&#39; and &#39;Individual&#39; are related concepts but do not form the correct expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "PII, or Personally Identifiable Information, refers to any data that could potentially identify a specific individual. This includes direct identifiers like names, addresses, and social security numbers, as well as indirect identifiers that, when combined, can pinpoint an individual.",
      "distractor_analysis": "The distractors test precise recall of the terms &#39;Personally&#39; and &#39;Identifiable&#39;. Many students might substitute &#39;Private&#39; or &#39;Protected&#39; for &#39;Personally&#39;, or &#39;Identification&#39; for &#39;Identifiable&#39;, which are plausible but incorrect variations.",
      "analogy": "Think of PII as the unique &#39;fingerprint&#39; of your digital self. Any piece of data that, alone or combined, points directly back to you is PII."
    },
    "code_snippets": [],
    "difficulty": "foundational",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "GRC_COMPLIANCE"
    ]
  }
]