[
  {
    "question_text": "What does MBR stand for in the context of Windows system forensics?",
    "correct_answer": "Master Boot Record",
    "distractors": [
      {
        "question_text": "Main Boot Region",
        "misconception": "Targets similar-sounding terms: &#39;Main&#39; and &#39;Region&#39; are plausible but incorrect substitutions for &#39;Master&#39; and &#39;Record&#39;."
      },
      {
        "question_text": "Memory Boot Record",
        "misconception": "Targets concept confusion: &#39;Memory&#39; is a related forensic concept but not part of the MBR acronym, which refers to disk structure."
      },
      {
        "question_text": "Master Boot Routine",
        "misconception": "Targets word substitution: &#39;Routine&#39; implies a process, whereas &#39;Record&#39; refers to a specific data structure on the disk."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Master Boot Record (MBR) is a special type of boot sector at the very beginning of partitioned computer storage devices like hard disks. It holds the boot loader for the installed operating system and information about the disk&#39;s logical partitions. Malware can infect the MBR to gain persistence and control over the system before the operating system even loads.",
      "distractor_analysis": "Distractors are designed to test precise recall. &#39;Main Boot Region&#39; uses similar-sounding words. &#39;Memory Boot Record&#39; conflates disk structures with memory concepts. &#39;Master Boot Routine&#39; substitutes &#39;Record&#39; with a process-oriented term, which is incorrect for this specific data structure.",
      "analogy": "Think of the MBR as the table of contents and the first page of instructions for a book. If that first page is tampered with, the entire book (operating system) might not load correctly or might lead you to malicious content."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "dd if=/dev/sda of=mbr.bin bs=512 count=1",
        "context": "This command, often used in Linux environments, demonstrates how to extract the first 512 bytes of a disk, which typically contains the MBR, for forensic analysis."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does SIA stand for in the context of file system forensics?",
    "correct_answer": "Standard Information Attribute",
    "distractors": [
      {
        "question_text": "Security Information Attribute",
        "misconception": "Targets word substitution: &#39;Security&#39; is a common cybersecurity term and sounds plausible in this context, but &#39;Standard&#39; is correct."
      },
      {
        "question_text": "System Information Attribute",
        "misconception": "Targets word substitution: &#39;System&#39; is a general computing term that could logically precede &#39;Information Attribute&#39;, but is incorrect."
      },
      {
        "question_text": "Standard Incident Attribute",
        "misconception": "Targets word substitution and concept confusion: &#39;Incident&#39; relates to security events, but &#39;Information&#39; is the correct term for file metadata."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In file system forensics, particularly with NTFS, SIA refers to the Standard Information Attribute. This attribute stores metadata about a file, including creation, modification, MFT entry modification, and access timestamps. These timestamps are crucial for forensic analysis, though malware can manipulate them.",
      "distractor_analysis": "The distractors replace &#39;Standard&#39; with &#39;Security&#39; or &#39;System&#39;, which are common and plausible terms in a cybersecurity context, or &#39;Information&#39; with &#39;Incident&#39;, which is related to security but incorrect for this specific file attribute. This tests precise recall of the attribute&#39;s name.",
      "analogy": "Think of SIA as a file&#39;s basic ID card, containing its birth date, last updated date, and last seen date. While someone might try to forge the dates on the ID, the card itself is the &#39;Standard Information Attribute&#39;."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does UPX stand for in the context of malware packing and unpacking?",
    "correct_answer": "Ultimate Packer for eXecutables",
    "distractors": [
      {
        "question_text": "Universal Packer for eXecutables",
        "misconception": "Targets word substitution: &#39;Universal&#39; sounds plausible for a widely used packer but &#39;Ultimate&#39; is the correct term."
      },
      {
        "question_text": "Unpacking Program for eXecutables",
        "misconception": "Targets functional description as expansion: Describes what it does rather than its actual name, confusing purpose with acronym."
      },
      {
        "question_text": "Unified Protection for eXecutables",
        "misconception": "Targets similar-sounding terms and concept conflation: &#39;Unified Protection&#39; sounds like a security feature, but UPX is a compression/packing tool, not a protection suite."
      }
    ],
    "detailed_explanation": {
      "core_logic": "UPX is a free, open-source executable packer that compresses executable files, making them smaller and sometimes harder to analyze. It&#39;s widely used for legitimate software distribution but also frequently employed by malware authors to obfuscate their code.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Universal&#39; is a common guess due to UPX&#39;s widespread use. &#39;Unpacking Program&#39; describes its function but isn&#39;t the name. &#39;Unified Protection&#39; misrepresents its primary purpose as a compression tool rather than a security protection system.",
      "analogy": "Think of UPX like a zip file for programs. It shrinks them down, but it&#39;s not designed to protect them from being opened, just to make them smaller."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "upx --best my_program.exe",
        "context": "Command-line usage of UPX to compress an executable file for distribution or obfuscation."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does DLL stand for in the context of malware analysis and process injection?",
    "correct_answer": "Dynamic Link Library",
    "distractors": [
      {
        "question_text": "Direct Link Loader",
        "misconception": "Targets similar-sounding terms: &#39;Direct Link&#39; sounds plausible given the context of linking and loading, but is incorrect."
      },
      {
        "question_text": "Dynamic Load Library",
        "misconception": "Targets word substitution: &#39;Load&#39; is a common operation for libraries, but &#39;Link&#39; is the correct term in the expansion."
      },
      {
        "question_text": "Distributed Logic Layer",
        "misconception": "Targets concept conflation: &#39;Distributed Logic&#39; sounds like a technical term but is unrelated to the specific function of a DLL."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Dynamic Link Library (DLL) is a Microsoft Windows implementation of the shared library concept. DLLs contain code and data that can be used by multiple programs simultaneously, allowing for modularity and code reuse. In malware analysis, DLL injection is a common technique where malicious code is loaded into another process via a DLL.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Direct Link Loader&#39; uses similar-sounding words related to loading. &#39;Dynamic Load Library&#39; substitutes &#39;Link&#39; with &#39;Load&#39;, which is a common operation for libraries but not part of the official acronym. &#39;Distributed Logic Layer&#39; attempts to sound technically plausible but is entirely unrelated to the function of a DLL.",
      "analogy": "Think of a DLL as a toolbox that multiple workers (programs) can share. Instead of each worker having their own hammer, screwdriver, etc., they all use tools from a central, shared toolbox. DLL injection is like a malicious worker secretly adding a harmful tool to that shared toolbox, which then gets used by other unsuspecting workers."
    },
    "code_snippets": [
      {
        "language": "c",
        "code": "#include &lt;windows.h&gt;\n\nBOOL APIENTRY DllMain(HMODULE hModule, DWORD ul_reason_for_call, LPVOID lpReserved)\n{\n    switch (ul_reason_for_call)\n    {\n    case DLL_PROCESS_ATTACH:\n        // Malicious code executes here when DLL is loaded\n        MessageBox(NULL, &quot;Malicious DLL Injected!&quot;, &quot;Warning&quot;, MB_OK);\n        break;\n    case DLL_THREAD_ATTACH:\n    case DLL_THREAD_DETACH:\n    case DLL_PROCESS_DETACH:\n        break;\n    }\n    return TRUE;\n}",
        "context": "This C code snippet shows a basic DllMain function, which is the entry point for a DLL. In DLL injection, the malicious code is often placed within this function to execute automatically when the DLL is loaded into a target process."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT",
      "OS_WINDOWS"
    ]
  },
  {
    "question_text": "What does LLVM stand for in the context of reverse engineering and compiler infrastructure?",
    "correct_answer": "Low Level Virtual Machine",
    "distractors": [
      {
        "question_text": "Low Latency Virtual Machine",
        "misconception": "Targets similar-sounding terms: &#39;Latency&#39; is a common performance metric, but &#39;Level&#39; refers to the abstraction layer."
      },
      {
        "question_text": "Language Level Virtual Machine",
        "misconception": "Targets concept confusion: While LLVM works with various languages, &#39;Language Level&#39; is not part of its official expansion."
      },
      {
        "question_text": "Lightweight Logic Virtual Machine",
        "misconception": "Targets word substitution: &#39;Lightweight&#39; and &#39;Logic&#39; are plausible descriptors but incorrect for the official acronym."
      }
    ],
    "detailed_explanation": {
      "core_logic": "LLVM is a collection of modular and reusable compiler and toolchain technologies. It is often referred to as the &#39;Low Level Virtual Machine&#39; because it provides a low-level intermediate representation (IR) that can be used as a universal compilation target for various programming languages and then compiled to different machine architectures.",
      "distractor_analysis": "The distractors play on common misunderstandings or plausible-sounding alternatives. &#39;Low Latency&#39; is a performance characteristic, not part of the name. &#39;Language Level&#39; might seem appropriate given LLVM&#39;s role in language processing, but it&#39;s incorrect. &#39;Lightweight Logic&#39; uses words that could describe aspects of a virtual machine but are not the correct expansion.",
      "analogy": "Think of LLVM as a universal translator and builder for software. It takes code written in any language, translates it into a common &#39;blueprint&#39; (the IR), and then can build that blueprint into a working program for any type of computer, much like a construction company uses a single architectural drawing to build houses with different materials or in different locations."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "clang -S -emit-llvm hello.c -o hello.ll\nllvm-as hello.ll -o hello.bc\nllc hello.bc -o hello.s\nclang hello.s -o hello",
        "context": "This sequence demonstrates how Clang (a frontend for LLVM) compiles C code to LLVM IR (.ll), then to LLVM bitcode (.bc), then to assembly (.s) using llc, and finally links it into an executable."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "RE_BASICS",
      "COMPILER_BASICS"
    ]
  },
  {
    "question_text": "What does REPL stand for in the context of scripting for binary analysis tools like OllyDbg?",
    "correct_answer": "Read-Eval-Print Loop",
    "distractors": [
      {
        "question_text": "Replace-Execute-Process-Loop",
        "misconception": "Targets functional confusion: While &#39;replace&#39; is a function, the core concept is about interactive evaluation, not execution and processing."
      },
      {
        "question_text": "Read-Edit-Parse-Load",
        "misconception": "Targets similar-sounding terms: &#39;Edit&#39; and &#39;Parse&#39; are related to code manipulation but don&#39;t capture the &#39;Eval&#39; and &#39;Print&#39; aspects of an interactive loop."
      },
      {
        "question_text": "Runtime-Environment-Program-Loader",
        "misconception": "Targets acronym letter confusion: Students might associate REPL with broader runtime concepts, misinterpreting the &#39;P&#39; and &#39;L&#39;."
      }
    ],
    "detailed_explanation": {
      "core_logic": "A Read-Eval-Print Loop (REPL) is an interactive programming environment that takes single user inputs (reads), evaluates them, and returns the result to the user (prints). This loop continues until explicitly exited. It&#39;s common in scripting languages and interactive debuggers for quick testing and command execution.",
      "distractor_analysis": "The distractors are designed to sound plausible by using terms related to programming, execution, or code manipulation. &#39;Replace-Execute-Process-Loop&#39; focuses on a specific action mentioned in the text (replace) but misses the general interactive evaluation nature. &#39;Read-Edit-Parse-Load&#39; uses terms that are part of a compiler/interpreter pipeline but not the specific interactive loop. &#39;Runtime-Environment-Program-Loader&#39; attempts to associate REPL with broader system components, which is incorrect.",
      "analogy": "Think of a REPL like a conversation with a calculator: you type an expression (Read), it computes the answer (Eval), and then shows you the result (Print), waiting for your next input (Loop)."
    },
    "code_snippets": [
      {
        "language": "python",
        "code": "&gt;&gt;&gt; 2 + 2\n4\n&gt;&gt;&gt; print(&#39;Hello&#39;)\nHello\n&gt;&gt;&gt; def greet(name):\n...     return f&#39;Hello, {name}&#39;\n...\n&gt;&gt;&gt; greet(&#39;World&#39;)\n&#39;Hello, World&#39;",
        "context": "Python&#39;s interactive interpreter is a classic example of a REPL, where commands are entered, evaluated, and results are immediately displayed."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "RE_BASICS",
      "PROGRAMMING_BASICS"
    ]
  },
  {
    "question_text": "What does IDS/IPS stand for in the context of network security?",
    "correct_answer": "Intrusion Detection System/Intrusion Prevention System",
    "distractors": [
      {
        "question_text": "Internet Data System/Internet Protection System",
        "misconception": "Targets word substitution: Replaces &#39;Intrusion&#39; with &#39;Internet&#39; and &#39;Detection/Prevention&#39; with &#39;Data/Protection&#39;, which are related but incorrect concepts."
      },
      {
        "question_text": "Information Detection System/Information Prevention System",
        "misconception": "Targets word substitution: Uses &#39;Information&#39; instead of &#39;Intrusion&#39;, which is a common mistake given the focus on data in security."
      },
      {
        "question_text": "Intrusion Detection Service/Intrusion Prevention Service",
        "misconception": "Targets word substitution: Replaces &#39;System&#39; with &#39;Service&#39;, which can be confused in a cloud or managed security context, but is not the correct expansion."
      }
    ],
    "detailed_explanation": {
      "core_logic": "IDS (Intrusion Detection System) and IPS (Intrusion Prevention System) are network security technologies. An IDS monitors network traffic for suspicious activity and alerts administrators, while an IPS not only detects but also actively blocks or prevents detected threats from reaching their targets.",
      "distractor_analysis": "The distractors are designed to test precise recall of the terms &#39;Intrusion&#39;, &#39;Detection&#39;, &#39;Prevention&#39;, and &#39;System&#39;. Common errors include substituting &#39;Intrusion&#39; with &#39;Internet&#39; or &#39;Information&#39;, and &#39;System&#39; with &#39;Service&#39;, all of which are plausible but incorrect in this specific acronym.",
      "analogy": "Think of an IDS as a security guard who watches for suspicious activity and reports it, while an IPS is a security guard who not only watches but also physically stops intruders from entering."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "sudo snort -c /etc/snort/snort.conf -i eth0 -A console",
        "context": "This command runs Snort, a popular open-source IDS/IPS, in console alert mode on the &#39;eth0&#39; interface, using a specified configuration file."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does CUPP stand for in the context of social engineering and password profiling?",
    "correct_answer": "Common User Passwords Profiler",
    "distractors": [
      {
        "question_text": "Common User Password Profiling",
        "misconception": "Targets word form confusion: &#39;Profiler&#39; is the correct noun for the tool, not the gerund &#39;Profiling&#39;."
      },
      {
        "question_text": "Custom User Passwords Profiler",
        "misconception": "Targets similar-sounding adjective: &#39;Custom&#39; sounds plausible for a tool that generates tailored password lists, but &#39;Common&#39; refers to its focus on frequently used patterns."
      },
      {
        "question_text": "Centralized User Passwords Profiler",
        "misconception": "Targets scope confusion: &#39;Centralized&#39; implies a repository, whereas CUPP is a tool for generating lists based on common patterns, not a central database."
      }
    ],
    "detailed_explanation": {
      "core_logic": "CUPP, or Common User Passwords Profiler, is a tool used in social engineering and penetration testing to generate password lists based on information about a target. It leverages common password patterns and personal details to create dictionaries for brute-force or dictionary attacks.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Common User Password Profiling&#39; changes the noun &#39;Profiler&#39; to the gerund &#39;Profiling&#39;, which describes the action rather than the tool itself. &#39;Custom User Passwords Profiler&#39; uses a plausible but incorrect adjective, as CUPP focuses on &#39;common&#39; patterns. &#39;Centralized User Passwords Profiler&#39; introduces a concept of centralization that is not part of CUPP&#39;s function, which is about generating lists, not managing a central repository.",
      "analogy": "CUPP is like a detective who studies common criminal behaviors to predict where a suspect might hide, but for passwords. It doesn&#39;t store all passwords, but it knows how to guess them based on typical human choices."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "python cupp.py -i",
        "context": "Example command to run CUPP in interactive mode to generate a password list based on user input."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "ATTACK_EXPLOIT",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does IDT stand for in the context of computer architecture and memory forensics?",
    "correct_answer": "Interrupt Descriptor Table",
    "distractors": [
      {
        "question_text": "Instruction Definition Table",
        "misconception": "Targets similar-sounding terms: &#39;Instruction&#39; is related to CPU operations, but &#39;Interrupt&#39; is the correct term for handling asynchronous events."
      },
      {
        "question_text": "Internal Data Table",
        "misconception": "Targets generic computing terms: &#39;Internal Data&#39; is too broad and doesn&#39;t specify the function of handling interrupts."
      },
      {
        "question_text": "Interrupt Dispatch Table",
        "misconception": "Targets functional similarity: &#39;Dispatch&#39; implies routing, which is part of the IDT&#39;s role, but &#39;Descriptor&#39; is the precise term for the table&#39;s entries."
      }
    ],
    "detailed_explanation": {
      "core_logic": "The Interrupt Descriptor Table (IDT) is a critical data structure in x86 and Intel 64 architectures. It contains entries that point to Interrupt Service Routines (ISRs), which are specific software routines designed to handle various interrupts and exceptions generated by the CPU or external devices. When an interrupt occurs, the CPU uses the interrupt number as an index into the IDT to find and execute the appropriate handler.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Instruction Definition Table&#39; uses a related but incorrect term. &#39;Internal Data Table&#39; is too generic and lacks specificity. &#39;Interrupt Dispatch Table&#39; is functionally close but uses &#39;Dispatch&#39; instead of the precise &#39;Descriptor&#39; found in the official Intel architecture documentation.",
      "analogy": "Think of the IDT as a phone book for emergencies in a computer. Each entry in the book (descriptor) has a number (interrupt number) and a contact person (interrupt service routine) to call when a specific emergency (interrupt or exception) happens."
    },
    "code_snippets": [
      {
        "language": "assembly",
        "code": "lidt [idt_ptr] ; Load IDT register\n; ... later ...\nint 0x0E      ; Trigger page fault (example interrupt)",
        "context": "Assembly instructions for loading the IDT and triggering an interrupt, demonstrating its direct interaction with the CPU."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "OS_INTERNALS",
      "DEFENSE_DETECT"
    ]
  },
  {
    "question_text": "What does KDBG stand for in the context of Volatility Framework&#39;s memory analysis?",
    "correct_answer": "Kernel Debugger Data Block",
    "distractors": [
      {
        "question_text": "Kernel Debugging Data Block",
        "misconception": "Targets word substitution: &#39;Debugging&#39; is a process, &#39;Debugger&#39; refers to the specific tool/component, which is more precise here."
      },
      {
        "question_text": "Kernel Data Block Global",
        "misconception": "Targets letter confusion: &#39;G&#39; for Global instead of &#39;Debugger&#39; is a common misinterpretation, especially when &#39;Data Block&#39; is present."
      },
      {
        "question_text": "Key Debugger Data Buffer",
        "misconception": "Targets multiple word substitutions: &#39;Key&#39; instead of &#39;Kernel&#39; and &#39;Buffer&#39; instead of &#39;Block&#39; are plausible but incorrect substitutions."
      }
    ],
    "detailed_explanation": {
      "core_logic": "KDBG refers to the Kernel Debugger Data Block, a critical data structure within the Windows kernel (`_KDDEBUGGER_DATA64`). Volatility uses this block to identify the operating system version, service pack level, and other crucial information for memory analysis, as it contains pointers to active processes and loaded modules.",
      "distractor_analysis": "The distractors test precise recall of the acronym&#39;s expansion. &#39;Kernel Debugging Data Block&#39; is close but uses the gerund &#39;Debugging&#39; instead of the noun &#39;Debugger&#39;, which is less specific to the structure itself. &#39;Kernel Data Block Global&#39; misinterprets the &#39;G&#39; in KDBG. &#39;Key Debugger Data Buffer&#39; substitutes &#39;Kernel&#39; with &#39;Key&#39; and &#39;Block&#39; with &#39;Buffer&#39;, both plausible but incorrect in this specific context.",
      "analogy": "Think of KDBG as the operating system&#39;s &#39;ID card&#39; for memory forensics. It contains all the essential details about the OS version and structure that tools like Volatility need to correctly interpret the memory dump, much like an ID card tells you who a person is and their basic attributes."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "$ python vol.py -f memory.raw kdbgscan",
        "context": "The `kdbgscan` plugin in Volatility is specifically designed to locate and analyze the KDBG structure within a memory dump to help identify the correct profile."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "DEFENSE_DETECT",
      "OS_INTERNALS"
    ]
  },
  {
    "question_text": "What does HPET stand for in the context of computer hardware and memory forensics?",
    "correct_answer": "High Precision Event Timer",
    "distractors": [
      {
        "question_text": "High Performance Event Timer",
        "misconception": "Targets word substitution: &#39;Performance&#39; is a common descriptor in computing, but &#39;Precision&#39; is the correct term for this specific timer."
      },
      {
        "question_text": "Hardware Peripheral Event Timer",
        "misconception": "Targets initialism confusion: &#39;Hardware Peripheral&#39; sounds plausible for a device, but &#39;High Precision&#39; is the accurate expansion."
      },
      {
        "question_text": "Host Processor Event Timer",
        "misconception": "Targets scope confusion: &#39;Host Processor&#39; narrows the scope incorrectly; HPET is a system-level timer, not solely tied to the host processor."
      }
    ],
    "detailed_explanation": {
      "core_logic": "HPET, or High Precision Event Timer, is a hardware timer used in modern PCs. It provides a set of continuously running counters that can be programmed to generate interrupts at a much higher resolution and accuracy than older timers, which is crucial for multimedia synchronization and other time-sensitive tasks. In memory forensics, accessing its reserved memory region can cause system instability.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;High Performance Event Timer&#39; substitutes &#39;Precision&#39; with a commonly used, but incorrect, adjective. &#39;Hardware Peripheral Event Timer&#39; uses plausible but inaccurate terms for the &#39;H&#39; and &#39;P&#39;. &#39;Host Processor Event Timer&#39; incorrectly limits the timer&#39;s scope to just the CPU.",
      "analogy": "Think of HPET as a highly accurate stopwatch built into your computer, much more precise than a standard clock. If you try to mess with its internal gears (by inadvertently reading its memory region), the whole system might freeze because it relies on that precision for timing."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "Which of the following best describes the purpose of a DLL in the context of Remote DLL Injection?",
    "correct_answer": "A Dynamic Link Library containing malicious code that is loaded into another process.",
    "distractors": [
      {
        "question_text": "A Data Link Layer protocol used for network communication.",
        "misconception": "Targets domain confusion: Confuses Dynamic Link Library with Data Link Layer, a networking concept."
      },
      {
        "question_text": "A Device Location Log used for tracking hardware.",
        "misconception": "Targets similar-sounding terms: Substitutes &#39;Dynamic Link&#39; with &#39;Device Location&#39; and &#39;Library&#39; with &#39;Log&#39;, creating a plausible but incorrect IT term."
      },
      {
        "question_text": "A Digital License Ledger for software activation.",
        "misconception": "Targets concept conflation: Associates DLL with licensing, a common software management concept, but unrelated to its technical function in injection."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In the context of Remote DLL Injection, DLL stands for Dynamic Link Library. It is a file containing code and data that can be used by multiple programs simultaneously. Attackers leverage this by forcing a legitimate process to load a malicious DLL, thereby executing the attacker&#39;s code within the context of the legitimate process.",
      "distractor_analysis": "The distractors are designed to test precise understanding of the acronym &#39;DLL&#39; in a cybersecurity context. One distractor uses a networking acronym (Data Link Layer) that shares the same letters. Another creates a plausible but incorrect IT-related term (Device Location Log). The third conflates DLL with software licensing (Digital License Ledger), which is a common but unrelated concept in software.",
      "analogy": "Think of a DLL as a specialized toolbox. In Remote DLL Injection, an attacker forces a legitimate worker (process) to pick up a malicious toolbox (DLL) and use its tools, making the worker unknowingly perform harmful tasks."
    },
    "code_snippets": [
      {
        "language": "c",
        "code": "HMODULE hDll = LoadLibrary(&quot;malicious.dll&quot;);\nFARPROC func = GetProcAddress(hDll, &quot;MaliciousFunction&quot;);\n((void(*)())func)();",
        "context": "This C code snippet illustrates how a legitimate process might load and execute a function from a DLL, which an attacker exploits in Remote DLL Injection."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "ATTACK_EXPLOIT"
    ]
  },
  {
    "question_text": "In the context of memory forensics and rootkit detection, what does the acronym &#39;ELF&#39; commonly refer to?",
    "correct_answer": "Executable and Linkable Format",
    "distractors": [
      {
        "question_text": "Executable Loadable File",
        "misconception": "Targets word substitution: &#39;Loadable&#39; is similar to &#39;Linkable&#39; but not the precise term, and &#39;File&#39; is too generic."
      },
      {
        "question_text": "Encrypted Linkage Format",
        "misconception": "Targets concept confusion: &#39;Encrypted&#39; introduces a cryptographic concept not directly related to the file format&#39;s primary purpose, and &#39;Linkage&#39; is close but not exact."
      },
      {
        "question_text": "Extended Library Function",
        "misconception": "Targets scope confusion: &#39;Library Function&#39; refers to a component within a program, not the overarching file format itself, and &#39;Extended&#39; is a common prefix for many technical terms."
      }
    ],
    "detailed_explanation": {
      "core_logic": "ELF, or Executable and Linkable Format, is a standard file format for executables, object code, shared libraries, and core dumps in Unix-like operating systems. It&#39;s crucial in memory forensics because understanding its structure helps in analyzing how programs are loaded and executed, and how rootkits might manipulate these structures.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Executable Loadable File&#39; uses a synonym for &#39;Linkable&#39; and a generic term for &#39;Format&#39;. &#39;Encrypted Linkage Format&#39; introduces an unrelated concept (encryption) and a slightly off term. &#39;Extended Library Function&#39; confuses the file format with a component type, and uses a common but incorrect prefix.",
      "analogy": "Think of ELF as the blueprint and instruction manual for how a program is built and run on a Linux system. Just as a builder needs to understand a blueprint to modify a house, a forensic analyst needs to understand ELF to analyze or detect modifications to a program&#39;s execution."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "readelf -h /bin/ls",
        "context": "The `readelf` utility can be used to display information about ELF files, including their headers, sections, and symbols, which is vital for forensic analysis."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "SEC_BASICS",
      "OS_LINUX",
      "MALWARE_ANALYSIS"
    ]
  },
  {
    "question_text": "What does KEXT stand for in the context of macOS kernel operations?",
    "correct_answer": "Kernel Extension",
    "distractors": [
      {
        "question_text": "Kernel Executable",
        "misconception": "Targets similar-sounding terms: &#39;Executable&#39; is a common file type, but &#39;Extension&#39; specifically refers to macOS kernel modules."
      },
      {
        "question_text": "Kernel External",
        "misconception": "Targets word substitution: &#39;External&#39; implies something outside, but KEXTs are integrated components of the kernel."
      },
      {
        "question_text": "Key Exchange",
        "misconception": "Targets unrelated domain: &#39;Key Exchange&#39; is a cryptographic concept, completely unrelated to kernel modules, but shares the &#39;KEX&#39; prefix."
      }
    ],
    "detailed_explanation": {
      "core_logic": "KEXT, or Kernel Extension, refers to a dynamically loadable module that extends the functionality of the macOS kernel. These are analogous to device drivers or loadable kernel modules (LKMs) in other Unix-like operating systems. They run in kernel space and have high privileges.",
      "distractor_analysis": "The distractors test for precise recall. &#39;Kernel Executable&#39; is plausible as KEXTs are executable code, but &#39;Extension&#39; is the specific term. &#39;Kernel External&#39; is a subtle word change that alters the meaning. &#39;Key Exchange&#39; is a common acronym in cybersecurity (KEX) but belongs to a completely different domain (cryptography), testing if the student can differentiate context.",
      "analogy": "Think of a KEXT as an app for your macOS kernel. It adds new features or hardware support directly to the operating system&#39;s core."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "kextstat",
        "context": "The `kextstat` command lists currently loaded kernel extensions on a macOS system."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "OS_MACOS"
    ]
  },
  {
    "question_text": "What does WMI stand for in the context of Windows operating systems and management?",
    "correct_answer": "Windows Management Instrumentation",
    "distractors": [
      {
        "question_text": "Windows Monitoring Interface",
        "misconception": "Targets word substitution: &#39;Monitoring&#39; and &#39;Interface&#39; are related to system observation but are not the correct terms for WMI&#39;s comprehensive management capabilities."
      },
      {
        "question_text": "Windows Malware Interception",
        "misconception": "Targets domain confusion: &#39;Malware Interception&#39; relates to security, which WMI can assist with, but it&#39;s not its primary function or expansion."
      },
      {
        "question_text": "Web Management Integration",
        "misconception": "Targets initialism confusion: &#39;Web&#39; and &#39;Integration&#39; are common tech terms, but &#39;Windows&#39; and &#39;Instrumentation&#39; are specific to WMI&#39;s role."
      }
    ],
    "detailed_explanation": {
      "core_logic": "WMI (Windows Management Instrumentation) is a core component of the Microsoft Windows operating system that provides a unified way to manage local and remote computers. It allows scripting languages (like PowerShell) to manage Windows systems, providing data and operations on operating system components, services, and applications.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Monitoring Interface&#39; sounds plausible as WMI provides monitoring capabilities, but &#39;Management Instrumentation&#39; is the exact term. &#39;Malware Interception&#39; attempts to link WMI to a security function, which it can support, but it&#39;s not its direct expansion. &#39;Web Management Integration&#39; uses common IT terms but incorrectly substitutes &#39;Windows&#39; and &#39;Instrumentation&#39;.",
      "analogy": "WMI is like a universal remote control for your Windows system. Instead of needing a different tool for every setting or service, WMI provides a single interface to query information and perform actions across various parts of the OS."
    },
    "code_snippets": [
      {
        "language": "powershell",
        "code": "Get-WmiObject -Class Win32_Process | Select-Object ProcessName, ID, WorkingSetSize",
        "context": "Example PowerShell command using WMI to retrieve information about running processes on a Windows system."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS",
      "SEC_BASICS"
    ]
  },
  {
    "question_text": "What does NAT stand for in the context of network services?",
    "correct_answer": "Network Address Translation",
    "distractors": [
      {
        "question_text": "Network Access Translation",
        "misconception": "Targets word substitution: &#39;Access&#39; is a common networking term but incorrect in this specific acronym."
      },
      {
        "question_text": "Network Address Transceiver",
        "misconception": "Targets similar-sounding technical terms: &#39;Transceiver&#39; is a network component but not the correct expansion for NAT."
      },
      {
        "question_text": "Network Application Translation",
        "misconception": "Targets scope confusion: &#39;Application&#39; is too high-level; NAT operates at the network layer, not the application layer."
      }
    ],
    "detailed_explanation": {
      "core_logic": "Network Address Translation (NAT) is a method of remapping one IP address space into another by modifying network address information in the IP header of packets while they are in transit across a traffic routing device. It is commonly used to allow multiple devices on a private network to share a single public IP address.",
      "distractor_analysis": "The distractors test precise recall of the &#39;Address&#39; and &#39;Translation&#39; components. &#39;Access&#39; is a plausible substitute for &#39;Address&#39; due to its relevance in networking, &#39;Transceiver&#39; is a real network device but unrelated to the function, and &#39;Application&#39; incorrectly shifts the scope to a higher layer of the OSI model.",
      "analogy": "NAT is like a postal service for a large apartment building. All outgoing mail from different apartments (private IPs) gets stamped with the building&#39;s address (public IP), and incoming mail to the building&#39;s address is then routed to the correct apartment."
    },
    "code_snippets": [
      {
        "language": "bash",
        "code": "iptables -t nat -A POSTROUTING -o eth0 -j MASQUERADE",
        "context": "This Linux iptables command configures a common form of NAT (masquerading) to allow internal network traffic to exit via an external interface (eth0)."
      }
    ],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "NET_BASICS"
    ]
  },
  {
    "question_text": "What does OEP stand for in the context of obfuscated program analysis?",
    "correct_answer": "Original Entry Point",
    "distractors": [
      {
        "question_text": "Obfuscated Execution Point",
        "misconception": "Targets term substitution: Students might associate &#39;O&#39; with &#39;Obfuscated&#39; given the context, and &#39;Execution Point&#39; sounds plausible."
      },
      {
        "question_text": "Operational Entry Procedure",
        "misconception": "Targets similar-sounding terms: &#39;Operational&#39; and &#39;Procedure&#39; are common in technical contexts and could be confused with the correct terms."
      },
      {
        "question_text": "Output Entry Point",
        "misconception": "Targets concept confusion: Students might think of &#39;Output&#39; as the result of the deobfuscation process, rather than the original starting point."
      }
    ],
    "detailed_explanation": {
      "core_logic": "In the context of obfuscated programs, the Original Entry Point (OEP) refers to the memory address where the legitimate, unobfuscated program code would normally begin execution. After a deobfuscation stub has decrypted or unpacked the original program, control is typically transferred to this OEP to begin the program&#39;s intended functionality.",
      "distractor_analysis": "The distractors are designed to test precise recall. &#39;Obfuscated Execution Point&#39; incorrectly assumes the &#39;O&#39; refers to &#39;Obfuscated&#39; rather than &#39;Original&#39;. &#39;Operational Entry Procedure&#39; uses common technical terms that are phonetically similar but semantically incorrect. &#39;Output Entry Point&#39; misinterprets the role of the entry point in the deobfuscation flow.",
      "analogy": "Think of OEP as the &#39;real front door&#39; of a house that has been temporarily boarded up. The deobfuscation stub is like a temporary side entrance that leads you to the tools to unboard the front door, so you can then enter through the OEP."
    },
    "code_snippets": [],
    "difficulty": "intermediate",
    "question_type": "definition",
    "prerequisites": [
      "REVERSE_ENGINEERING_BASICS",
      "BINARY_ANALYSIS"
    ]
  }
]